[
    {
        "Question": "Mentally destroyed after discovering that my mother escorted / made porn as recently as 3 years ago\nAbsolutely scarring experience, I found this while doing something for her on her phone by accidentally finding a mortifying photo of an ad she had made. Haven’t said anything to her as I wasn’t meant to find out. This is affecting me really really really fucking badly, and need some clarity on this so I can get my mental condition back to being able to focus on university, work, and sleep.",
        "Q_score": 425,
        "Id": "11ittji",
        "Url": "https://www.reddit.com/r/Advice/comments/11ittji/mentally_destroyed_after_discovering_that_my/",
        "Aswer": "Remember that your mom is more than just your mom. She's a human being like anyone else, which means that she is a sexual being that desires and is desired. What she does with that is her right, her choice, and has nothing to do with you, or the role that she plays in your life.\n\nThat side of her life is not about you, so stop making it about you. It's not going to help you in any way to obsess over this.  \n\nThe less said about it the better.",
        "A_score": 648
    },
    {
        "Question": "14f here, my best friend is dating a 30 year old and I don't know what to do? any advice I feel like it is not normal.\nI (14f) have a friend (14f) who is dating a 30 yo dude and he talks so casually like nothings wrong like it is normal, and she acts like its completely normal and so do our other friends, and i feel like im going crazy i swear its not normal for him to do that??? is he wrong for this or am i crazy?????????????? also i think he might be abusing her? idk she said hes great but something is off",
        "Q_score": 111,
        "Id": "11iyfq9",
        "Url": "https://www.reddit.com/r/Advice/comments/11iyfq9/14f_here_my_best_friend_is_dating_a_30_year_old/",
        "Aswer": "Yes that is abnormal and illegal. If you can you should anonymously contact her parents or a school counsellor. It’s going to make her angry but she’s being molested",
        "A_score": 209
    },
    {
        "Question": "Family went out last night without me.\nFirst and foremost I’ve been battling anxiety and depression because of Covid. When Covid happened I had no one to lean on for help. My parents made fun of me for wearing a mask, my brother didn’t believe in it and my sister ignored me and my other brother hosted parties and got angry with me because I didn’t show but now makes fun of me and bullies me. \n\nI went to therapy Friday and found out that the root of my problem has been my family and work. My job keeps me at the lowest position and doesn’t promote me. I think they do it because I make under $20 a hour and others that apply want more. \n\nLast night I get a text from my sister because I was in the group message saying “thanks for the invite I had a blast” knowing that they all went out without me. I reached out to my mom asking her if she got invited out and she left me on read. This morning she plays dumb with me saying she was sleeping and wants to know if everything is alright. \n\nI have an expensive dinner to go to Saturday with my family. High end restaurant in my city. We go to this restaurant this time of year because of some people’s birthdays in my family. I’m thinking about not going since I was not included in last nights fun. I’m not sure what to do.",
        "Q_score": 47,
        "Id": "11ixbev",
        "Url": "https://www.reddit.com/r/Advice/comments/11ixbev/family_went_out_last_night_without_me/",
        "Aswer": "I feel like there is more to this story!",
        "A_score": 51
    },
    {
        "Question": "Boyfriend cannot clean up after himself and drinks to the point of vomiting most weekends\nMy boyfriend(22) and I (22) moved in together and he is unable to clean up after himself. Typical problem right? I feel stupid writing this, I’ve spoken to him countless times about this and he just acts like i’m nagging him. He recently moved out of his mums house where he had everything done for him yet i had to move out at 18 from a toxic family situation. you’ve heard it all before\n\nmy problem currently is most weekends he drinks to the point of being sick (all over the bathroom) which is concerning. not only does he vomit all over the bathroom making it stink and unusable, he wakes me up when i work weekends, and sleeps for so long i have to clean up his sick or i’ll be stepping in it to use the bathroom and get ready for work.\n\nit’s also concerning that he is unable to control his drinking with his friends and gets himself into such state, and when i bring it is up he says “i haven’t been sick in a long time” when really it was a week ago.\n\ntoday, i heard him tear up the bathroom during the night and as i showered last night in preparation, i just got ready at work in the morning and i’ve just come home.\n\nit’s literally been 12 hours and there’s still liquid vomit everywhere,, i don’t know what to do.\n\ni’m in so much debt from moving out as soon as i could, i thought i could try and get rid of this debt and get a nice, safe place to live whilst becoming more stable.\n\ni can’t move out at this stage, any advice is appreciated",
        "Q_score": 21,
        "Id": "11j55tu",
        "Url": "https://www.reddit.com/r/Advice/comments/11j55tu/boyfriend_cannot_clean_up_after_himself_and/",
        "Aswer": "Pay off your debt as soon as possible and move out. \n\nYou cannot fix him.",
        "A_score": 44
    },
    {
        "Question": "My dad thinks my girlfriend is ugly\nA few months ago I met a lovely girl , we started dating and I showed a picture of her to my dad , little did I know that his reaction would hurt me so much , he looked at her picture for the first time and  felt repulsive ,  \" she looks like a maid servant \" is what uttered from his mouth . And I was shocked I wanted to shout at him in anger but kept my cool . Fast forward to today I'm still dating her and he's telling me that I should find somebody better looking , she is also 5 years elder to me and he thinks that she is taking advantage of me because I'm gullible and naive.  He believes that most of the decisions I've taken in life are dumb ..... my dad is a really great guy but I didn't know  he would react this way , he reasons with me saying ,  he wants what's right for me and I should look for someone with a better looking face, I feel so let down . He constantly reminds me about this every day to a point where I'm now questioning my own decision about dating her . I love her, but this thing keeps nagging me every day, and I'm not sure what to do. I'm scared to even introduce her to my dad . \nWhat would you do if you were in my shoes , and how would you guys handle it ?. Do you think it's bad dating someone 5 years older? I'm 24, and she's 29 .",
        "Q_score": 62,
        "Id": "11is1ld",
        "Url": "https://www.reddit.com/r/Advice/comments/11is1ld/my_dad_thinks_my_girlfriend_is_ugly/",
        "Aswer": "I’m a 42 yr old dad. I have a 22 yr old son. I was bitching at him one day to do something with his life. He was going from dead end job to dead end job. He would come home and tell me or complain about his job. I didn’t want to hear it or listen to it. I just wanted him to find a job. He was trying to figure him self out. His response was “I can never make you happy”and I stopped and realized and thought about what he said to me that day. I still remember it clearly. He was right he can’t make me happy only I can make myself happy and only he can make himself happy. And only you can make your happy. You will never be able to make your dad happy and your not on this planet to make him happy. If he can’t do it on his own it’s because he has issues that he needs to work on, like myself. My son and I are now in a better place. He got a job at a gym and I enjoy talking to him now because he is not complaining no more. He is having fun with his life and that’s all I ever wanted for him. If your dad can’t understand that you have to do what you have to do to make your life count and make it the way you want to live it. It’s your life not his and we only get one shot at it. If you live that girl who gives a fuck as long as you and her are happy together. You are the one who is gonna share your life with her not your dad. You have to be able to please your self before you can please others. When you get that he will envy you because he won’t know how to get what you have. He won’t tell you but it’s true. Hopefully you do the right thing for yourself and your girl. Good luck",
        "A_score": 151
    },
    {
        "Question": "9 year age gap\nis 20yo and 29yo a weird age gap? (girl turned 20 in december, guy is turning 30 in april) is that strange? the guy knew her since she was 18 and pursued her when she was 19. is that weird? he’s not like.. creepy, he’s a pretty cool guy, everyone loves him, very sweet and kind. but what’s your opinion on the age gap..\n\nedit: okay im going to provide a bit more context.\n\n1. i’m the 20yo girl.. i promise lol. a bit more info on me, i’m not in college yet, decided not to go until i’m 10000% confident that i can mentally handle it.\n(i suffer from severe adhd and bpd which impacts my daily life a LOT)\n2. he does not have a pattern of chasing after younger girls, all the girls he’s pursued in the past have been around his age (no younger/older than 3 years)\n3. he hasn’t settled into a salary job, we actually met at my work place when i was 18. when we started becoming friends around march 2022, he was quitting and now has moved onto a job in his career field. he does not live on his own yet, (we live in canada, the economy sucks). and he graduated college at 27.\n4. he’s never really shown signs of manipulation, most of our decisions have been mutual on both sides, he’s never pushed me into making choices i didn’t feel comfortable with. i don’t feel like he has power over me or tries to control me. there’s been a couple instances during sex where he has tried to push his fetishes onto me, and i would have to be persistent in declining, but he would eventually stop.\nso overall i’m not too sure, but then again, i don’t exactly trust my own stance because i am so much younger. hence why i came on here to ask you guys. there’s a lot that’s happened between us that would take me ages to type out. but this is the general basis of it.",
        "Q_score": 358,
        "Id": "11idvhv",
        "Url": "https://www.reddit.com/r/Advice/comments/11idvhv/9_year_age_gap/",
        "Aswer": "I’m 29 and if I compare my level of emotional intelligence/general life experience to that of when I was 19, I’d say I’m almost an entirely different person. I can also say that the thought of dating a 19 year old now makes me cringe.",
        "A_score": 466
    },
    {
        "Question": "Friend is mad at me for \"misgendering\" my boyfriend\nI’m a cis woman (22) btw. \n\nSo my boyfriend (20) recently came out as non binary and now goes by he/they pronouns. I was a little unsure about it at first because I thought it’s going to change our relationship but no, everything’s the same basically. We also have a friend who I call T because she’s basically the focal point of the story. \n\nT is a trans woman. I get along with her really good until yesterday. I don’t even know how it really came up but I talked with her and called my bf \"he\". She looked at me very pissed and told me to not misgender him, especially in her presence because it’s disrespectful. I told her that he goes by both he AND they pronouns. She basically dismissed it and said that it’s still disrespectful because by calling him \"him\" I’m being cis-normative and borderline transphobic. \n\nEventually I brought my bf to us and asked him what he thinks because that’s basically what’s important. He said that it’s fine because (again) he goes by both he and they pronouns. T was basically just like \"whatever\" and was kinda rude to me the whole evening. Didn’t even say me goodbye, just walk straight past me. \n\nI talked with my bf about it again and apologised if I hurt him in any way but he said that it’s okay. He then showed me messages of him and T and T told him that he shouldn’t allow me misgendering him and that he can’t let people walk over him. \n\nI honestly feel really bad about all of this. Like my bf said it’s okay but I obviously don’t know if he’s being serious. And I kinda feel like a bigot even though I know I’m not transphobic.",
        "Q_score": 289,
        "Id": "11ie2kk",
        "Url": "https://www.reddit.com/r/Advice/comments/11ie2kk/friend_is_mad_at_me_for_misgendering_my_boyfriend/",
        "Aswer": "Well, isn't T kinda invalidating your BF by not allowing him to be called \"he\"? She is literally saying you can't use said pronoun when your BF said you can, how is that different from not allowing a trans woman to use \"she\"? Only your BF can define what his pronouns are.\n\nSounds like T wanted to give you a lecture about pronouns but when she realized her mistake she just got mad at you because she doesn't want to be wrong.",
        "A_score": 599
    },
    {
        "Question": "MY GUY BEST FRIEND TOLD ME HE HAS FEELINGS\nI have a guy best friend. He and I have been friends for over a year now, and thing have been great, we chat, we hangout occasionally, and we do all the best friend shenanigans you would think of. I have made it very clear that I don't want a relationship with anyone at the moment, I'd rather work on myself.\n\nbut lately, he's been ghosting me, and after three days of me spamming him with texts waiting for him to respond so I can make sure he's not in god's heavens or anything, he replied.\n\nhe replied saying that he had a great time with me and that he'll always remember me bla bla bla, but he wanted to not talk as we did before because he had feelings for me. I told him it was fine and that I won't be mad at him or anything and we \\*ended it\\* in a civil matter.\n\nhe wanted to not talk to me anymore because it hurts him and stuff. so I said it's ok. we were ok... but then I thought to myself... if he thinks that TALKING to me is going to make him get hurt... then how is he feeling seeing all my stories and posts on Instagram? so I removed him from my Instagram because I truly don't want to tease or seduce him.\n\nbut he went NUTS and removed me from all platforms and blocked me. HE EVEN TOOK IT TO THE NEXT LEVEL AND LEFT ALL THE GROUP CHATS THAT WE HAVE IN COMMON. a friend of mine also says that since I retweeted a quote of how some people don't deserve you and whatever around the time all that happened then he might have thought it was about him.\n\nI really liked this guy, he has been a great friend and I stood by him so many times. I cry everyday thinking that I messed it up. when it was literally him that said he doesn't want to talk to me anymore. I don't know, I have never had any experience with guys before and this is truly new to me.. so please tell me.. how can I make it all right again? that's if I ever should.\n\nPLUS, DOES ANYONE HERE HAVE SOME TYPE OF WAY I CAN GET OVER THIS FRIENDSHIP BREAKUP BECAUSE IT HURTS SOOO BADLY.\n\n**UPDATE:** I couldn't hold it in any longer I texted him saying that I didn't mean him on the quote and whatever and he said he thought it was about him. he was a bit cold but I mean we DID say we weren't gonna be like before so yeah. I feel so much better now that I made things clearer.. thank you all for helping me here and I will move on from our friendship with peace now that I know I ended things the good way.",
        "Q_score": 42,
        "Id": "11iqfj6",
        "Url": "https://www.reddit.com/r/Advice/comments/11iqfj6/my_guy_best_friend_told_me_he_has_feelings/",
        "Aswer": "guy here that had something similar happen to him- if he likes u that much, then he wont stay for long. he'll either break and want to be friends again, or he'll think he's moved on and say \"yeah, i can talk to her, its gonna be fine\". \n\nand he doesnt hate you anything, he just wants the badness from unreciprocated love to go away. he's gonna be fine, u guys are gonna be fine.",
        "A_score": 48
    },
    {
        "Question": "My son (13) is a sociopath and tried to kill his sister (6). I want him out of our lives, what can I do?\nThis account was made as a throwaway three or four months ago, when I feared my son was trying to hurt my family. He proceeded to set the house on fire with his sister, my sister and two family dogs in it. He has been an escalating issue for several years (I will post my old draft below in comment) and at this point he went to stay with his dad while my family, now homeless, took emergency shelter at a hotel. Because of the arson, a social worker came to my daughter at school to check on her safety at home. General bases to cover like access to food and clothing, and if she was harmed in any way. They met with me after this, to let me know that my daughter has been sexually abused by my son. She is 6 and he is 13. I broke down hearing what the worker quoted to me and I still am. My poor daughter had never told me. From the time I guess this may have happened (from context of the social worker’s retelling; I don’t want to pressure her or ask questions), I can deduce she may have been as little as 3 or 4. She knows that I know and I told her she did the right thing. I’m doing my best to take care of her in this situation, asked the worker how to talk to her so she can feel safe, and filed the report and will file a restraining order.\n\nThe police are beginning to look to speak with my son. There is a reason this worries me. Ideally, they find him, and he gets arrested or sent to a facility. If he is given benefit, he will do or say anything to get what he wants. I don’t know what he’ll do or say but I know nothing is off limits. The worker mentioned they’d want to know if he was perpetuating abuse he was a victim of, so I have already prepared for the possibility that he accuses any family member, my boyfriend (my boyfriend has never been alone with either of them regardless of the fact that I trust him) or even myself of having abused him. I don’t suspect he has been abused but to him, no casualty is too great to spare in order to get what he wants. Everything is a means to an end. We have endured suicide threats (that we took seriously), physical violence, running away, vandalism and now arson/attempted murder because he didn’t get his way. \n\nI know I’m supposed to still love him. I don’t think I do. For the last year the house felt so tense when he was there. We were always on eggshells. Being away from him we feel like we finally have peace (with the exception of this news and him being involved in our lives again). All I want is to be done with him. I want to move forward with my daughter and never have him able to come near us or the possibility of him entering our lives. I know, big picture he needs to be away from people, guns and the internet and into serious therapy. Right now, I just want him out of our lives. How do I make sure this happens?",
        "Q_score": 782,
        "Id": "11hxh1t",
        "Url": "https://www.reddit.com/r/Advice/comments/11hxh1t/my_son_13_is_a_sociopath_and_tried_to_kill_his/",
        "Aswer": "It starts with inpatient crisis. He gets evaluated at an acute care facility, assessed for behaviors, diagnoses, level of care. From there, the acute care facility will recommend the best course of action then set it in motion. It’s possibly he may have to spend some time in DJJ given the arson, it such a but it’s a start. \n\nGetting a patient permanently institutionalized is a long process. It likely requires several rounds of acute and long term care before insurances will approve, there’s also usually a pretty long wait list too. Age may also be an issue. I don’t know of many places anymore that take children into that type of setting. \n\nI’m an adolescent inpatient counselor and have seen many children like yours. It’s so hard on everyone and the process is heartbreakingly slow. Rest assured that you’ve done nothing wrong, some people are just born broken and we can’t fix them. You have to do what is best for everyone, including your son. Best of luck to you. Stay strong, and take care of you and your family.",
        "A_score": 830
    },
    {
        "Question": "I'm probably gonna disappear completely sometime soon.\nI'm 16 sophomore in high school. I honestly dont even know where to start but I've been diagnosed w more than 30 mental illnesses. even though some of them aren't technically official like schizophrenia bc of the fact that u cant actually get diagnosed w certain things till your 18 they just basically label it as onset schizoaffective disorder or whatever it is they just say its onset bc they basically know I have it but cant diagnose it officially. I have ADHD BPD schizophrenia insomnia depression extreme paranoia antisocial personality disorder which basically means I'm a diagnosed psychopath dissociative personality disorder stress anxiety conduct disorder social anxiety disorder and a lot of others. if I misspelled any its because I'm typing this while I'm rly fuckin high. I've been smoking since i was about 12 and drinking since a year before that. I've taken long breaks from smoking and drinking to see if it makes anything better but it never does even after months of not smoking or drinking. i have really bad trauma because growing up a lot of my friends ended up dying some of them right in front of me. one of their birthdays was today. I try to talk to people about it sometimes but most of the time they just dont listen or dont take it seriously. I was in a rly bad abusive relationship about 2 years ago but no one took it seriously because I'm a guy and no one believed me. all of this is just locked up in my head all day because no one knows about it. no one ever asks and if they did they wouldn't care. I have friends but they always lie to me. I know most of them r using me. I've gone to therapy counseling psychologists psychiatrists everything and nothing helps no matter what i say or do. I'm on 13 different medications right now most of which I'm taking double all the way up to 8x regular doses of. my parents dont rly care ab me and they never have. one time I disappeared for 3 weeks and they barely even noticed. didnt do anything no police report didnt even wonder where I was. they never rly talked to me or interacted w me at all as a child. I'm not rly sure if I grew up poor or if they just didnt give me anything because i slept on a bare mattress with no pillows sheets or blanket. i still have back problems from sitting on the floor all day on my computer since they didnt get me a chair or desk. i dont think I've ever been in love w anyone ever and I dont think ill ever b able to love someone. i dont think anyone will ever rly love me either. most of my family hates me most of my friends r fake. the only place I've ever felt real was on the internet but now this place is so dead theres no one to talk to ever. I try to tell people whats on my mind but no one ever responds. I honestly dont rly have any reason to stay in this town anymore. for months I've been thinking ab just disappearing one day and not coming back. I'm just so alone everyone I've ever cared ab is dead. all I want is someone who cares about me. I just want a fucking hug. I just want someone to love me because aft all the shit I've been thru I fuckin deserve it. I dont know wtf to do. I'm so lost and I'm so scared. i dont think  i deserve this",
        "Q_score": 23,
        "Id": "11in9dt",
        "Url": "https://www.reddit.com/r/Advice/comments/11in9dt/im_probably_gonna_disappear_completely_sometime/",
        "Aswer": "None of those diagnoses are YOU. Your parents are not good at parenting. Those things don’t make you who you are. You can rise above your current circumstance. Find something you enjoy. Try to cut back on the meds. That seems like way too much for someone who is not done growing into an adult. You will find your people.",
        "A_score": 42
    },
    {
        "Question": "Introverted black single mom with no friends\nI'm 27F and very lonely. I have a 9 month old son and my ex has gone no contact and disappeared. My only friends think I'm gross for having sex and a baby before marriage. I'm not even Christian anymore. The only people who want to talk to me are creepy dudes who want a one night stand or want to get with a vulnerable woman to harm me more. I like white guys, I need to point that out, but most of them are rude and give me unsolicited opinions about how they'd never date a black woman or how I should have used protection and they wouldn't raise a black man's baby when I didn't ask them to. I'm just looking for friends and get that BS the moment I they find out. My mom hates me and her solution is to find another man. I work overnights so my parents can babysit and my coworkers hate me too. The nicest ones don't even speak English.\n\nI live in Mankato, Minnesota. Not many black people here, and the ones that are here are mostly from Somalia, a Muslim country, and most of them don't speak much English. I met some Somalian people a few years ago, but a lady I used to talk to a lot now says I should get back with my abusive ex because raising a baby without him goes against God, and I'm gross for not being married before sex. That's probably most of their culture's opinions. I'm so tired of religion being used against me and racist white people making me feel like dirt. I should move, but I don't know where I can go where I'd be welcome. I'm not trying to get with another man. I just want friends so I don't go insane. I don't know what I can do around here when I work overnights, sleep in the afternoons, and don't know people to go to bars with. (Don't want to drink either because I'm nursing.)\n\nI think I'm on the autism spectrum and stumble over my words when I'm talking in person along with feeling like crap and always embarrassed like a spotlight is on me.\n\nThanks for any advice. I will not add anyone on other platforms for any reason.",
        "Q_score": 42,
        "Id": "11ihea2",
        "Url": "https://www.reddit.com/r/Advice/comments/11ihea2/introverted_black_single_mom_with_no_friends/",
        "Aswer": "If you're looking for friends and your local area is very religious and judgmental about your situation, then have you considered saving up some money and moving away to another city with more open-minded people? I knwo you need family right now to help you watch your baby, but in the long run if you want friends for your own mental health, then either moving to another city or trying again to reach out to others in your local community may be the only options.\n\nStill, take care of yourself and your baby for now, and save up! Good luck and take care.",
        "A_score": 22
    },
    {
        "Question": "My mom has been crying and is devastated since I moved out what do I do?\nI grew up with a single mom and for a while was my only guardian before my dad came back to be part of my life. Where very close and to her it’s just me in her family. I decided I wanted to move out for college with a friend and get an apartment in the city but since then my mom has been torn and never even wanted me to move out in the first place. She’s lived alone since and said how much she miss me and wants me to move back in but today she called and was crying on the phone how lonely she is and how afraid she is and wants me to consider moving back in when my lease is up though I’ve been planning for me and my gf to then move in which again she’s not fond of. I visit her each week between school and work but she’s still sad. What do I do, I don’t like my mom being so lonely and sad but then again I’m almost 20 and should live my own life?",
        "Q_score": 143,
        "Id": "11i6eha",
        "Url": "https://www.reddit.com/r/Advice/comments/11i6eha/my_mom_has_been_crying_and_is_devastated_since_i/",
        "Aswer": "She needs to be able to support herself,  and let you have your own life.",
        "A_score": 225
    },
    {
        "Question": "I (25m) Got a boner while a guy was trying to force himself on to me\nI have never really labeled myself as straight or gay. Even growing up I didn't really care if someone was a boy or girl. I like you if I like you. But when I went to hang out with friends playing video games, there was these other guys they invited. One of whom I knew back in high-school but wasn't friends with. When I was in the bathroom he told me he liked me and that through me off. I was really confused. I have also been getting out of a bad break up but he started touching me and pulling at my pants and one thing I did know. I did not want to have sex with this guy. I told him no and he started teasing that I'm hard. Which I was and I found that confusing because I 100% did not want to have sex with this guy. He kept pushing himself on me and picked me up putting on the sick. I told him NO! and I'm serious and started pushing at him but he just grabbed my hands and kept saying I do want it. I started crying at that point begging him not to rape me and that's when he stopped.  I was crying and he left me there. I pulled my pants back up and today recieved a text saying he's sorry if he scared me... But I feel odd that I had a boner when I did not want to have sex with him. I wasn't even really attracted to her. I just wanted him to go away but my boner didn't go away.",
        "Q_score": 41,
        "Id": "11ih8h4",
        "Url": "https://www.reddit.com/r/Advice/comments/11ih8h4/i_25m_got_a_boner_while_a_guy_was_trying_to_force/",
        "Aswer": "Hi, it's called arousal non-concordance. It's a perfectly normal and predictable response in sexual assault. And it's unrelated to desire or consent. \n\nWhen someone with a head injury is brought in, sometimes one the symptoms that tells us it's likely very serious is a huge, unrelenting boner (priapism). \n\nErections are like blinking. They're not under your control. \n\nHe was the bad guy in this, not you. He was manipulating you to get you to comply, along with using force. He is NOT SAFE. Please,  do not be alone with him. \n\nLet's talk about you getting some help through this awful assault.  \n\nhttps://www.rainn.org/articles/sexual-assault-men-and-boys\n\nhttps://www.rainn.org/resources\n\nI am deeply sorry he betrayed you and assaulted you.",
        "A_score": 119
    },
    {
        "Question": "I have an online only friend that I've known for about a year and a half, but haven't heard from them since July of 2022. I get this message tonight. What do I do?\n\\[Here\\]([https://imgur.com/a/x4vQ2Y1](https://imgur.com/a/x4vQ2Y1)) is the message.  This was completely out of no where.  I only have his contact on reddit and discord, and don't know anyone who knows him.  The blanked out areas are full names or places.  I have never heard of the person he says is trying to kill him. He lives in Canada, and I in the US.  WTF do I do?\n\nEdit: Hey everyone.  So last night, a very kind person reached out from that area.  He found the exact inn, and I called the front desk.  There was already an ambulance there, she said.  She didn't know anything about what happened, and as far as I can find, there is nothing on the news.\n\nIf you are wondering why I didn't do anything sooner, I was told by my step dad to NOT call, and in that panick, I forgot that non emergency numbers were a thing\n\nEdit2: I contacted the patient info number for the neatest hospital, and I found out that he was admitted to the ER, but he was discharged.  I still have no idea what happened, and haven't heard from him",
        "Q_score": 310,
        "Id": "11hqg7m",
        "Url": "https://www.reddit.com/r/Advice/comments/11hqg7m/i_have_an_online_only_friend_that_ive_known_for/",
        "Aswer": "I’d go with call. Better safe than sorry I think. Worst case, some kid gets the shit scared out of him and never does it again (and you waste police time). Best case, you save someone’s life.",
        "A_score": 479
    },
    {
        "Question": "My wife abandoned me but now wants me back\nLast year my wife of 13yrs abruptly moved out of our apartment, she packed up everything she owned told me to expect a divorce and moved into her best friends house 3 hours away. she left me with the rent and bills to pay on my own with 10 months remaining on a lease and also left behind 2 of 3 cats. she eventually presented me with divorce papers i reluctantly signed and was unwavering in her decision. i cried and begged but she wouldn't budge. i was depressed, went through therapy took spravato treatments and developed body tremors from the severe anxiety. after some digging i learned she flew to NY to meet some guy she met on discord but to this denies it ever happened. after 10 months of misery i met a new girl, lots in common and she's smoking hot.. like omg she's so hot and she actually likes me.. I was so happy and out of my deep depression... just as things look up my ex wife shows back up at my apartment and tells me she made a mistake and wants me back. sobbing and panicking she tried to convince me she never really wanted a divorce but just space.. and she was only telling me she would never come back to distance me and she never meant it but always intended to come back home... i'm torn, for so long i wanted her back, i would have done anything for this chance months ago.. but i have fallen in love with someone else after accepting my fate.. should i accept that she has made a mistake and taker her back? or continue to try a new relationship with my new found love that may or may not continue to a possible future. should i go for the sure thing with my ex or risk being alone again if things width the new girl don't work out??? please help",
        "Q_score": 338,
        "Id": "11hduil",
        "Url": "https://www.reddit.com/r/Advice/comments/11hduil/my_wife_abandoned_me_but_now_wants_me_back/",
        "Aswer": "Smokin' hot vs. a stinkin' liar? Surely you jest!",
        "A_score": 611
    },
    {
        "Question": "I want to be independent from my parents as soon as possible, what should I do?\nI (17f) live with my parents who like to control every aspect of my life. Just today, they threatened to remove my bedroom door because I did not make my bed earlier in the morning before I left for school. I am not allowed to work and have no source of income. I turn 18 in November and they have threatened multiple times to kick me out on that day. I don't know what to do because I honestly do not want to live here anymore. I have looked at colleges out of state but they are really expensive and I don't know if I would qualify for many scholarships to cover the cost.\n\nAny advice is welcome. Thank you for reading😀.",
        "Q_score": 82,
        "Id": "11hof68",
        "Url": "https://www.reddit.com/r/Advice/comments/11hof68/i_want_to_be_independent_from_my_parents_as_soon/",
        "Aswer": "Definitely put some work into searching for scholarships, there are tons of them out there. Here's a website where you can search for them;\n\nhttps://www.scholarships.com/\n\nIf you have free time and are interested in any hobbies that could potentially make money, I would consider looking into that as well.",
        "A_score": 59
    },
    {
        "Question": "Manager refused previously approved day off because she is in sick leave. Then I saw her at the gym.\nI work at an after school tutoring academy. The management has been really awful and we have a high staff turnover. Up until recently we were not allowed any days off and if we were sick we were still expected to work as we could “just sit in the classroom and tell the children what to do”. This kind of approach lead to 3 teachers leaving at once, resulting in me having to cover many new classes or even have 2 year levels in a class at once (which is difficult when they’re on completely different curriculum/topics and need individual attention). \nA few weeks ago we hired more teachers so we could all have a lighter work load and be covered if someone was sick or needed a day off. The manager was the first one to take advantage of this and took a day off for a family birthday. So I also put in a request to have a day off as my partner is a professional athlete and will be playing in a very important final next week. I got the day approved and I worked out travel and accommodation for the match. That is until today, when she texted me to say that I can’t have the day off anymore because she injured her foot  (a small cut with a couple of stitches) and is now on 2 weeks of sick leave, meaning I have to cover her classes. I didn’t reply because I was extremely frustrated and didn’t know how to respond so I went to the gym to blow off some steam. When I arrived at the gym I saw said manager working out on the treadmill and stair master. We didn’t acknowledge each other. Now I don’t know how to respond. Do I make it known that I saw her there? Do I call in sick on the day? Should I just work that day and deal with it?",
        "Q_score": 23,
        "Id": "11hu7dh",
        "Url": "https://www.reddit.com/r/Advice/comments/11hu7dh/manager_refused_previously_approved_day_off/",
        "Aswer": "You should have said hello how’s the foot you would have ha some leverage \n\nI’m assuming you’ve let slip at work what you saw",
        "A_score": 44
    },
    {
        "Question": "Guy I’m seeing asked me to shave\nThe guy I’m seeing said he enjoys eating girls out so he said to prep my vagina. He said it kinda in a playful way as a joke so I asked what do u mean prepping it to whcih he said a trim a shave etc. i didn’t find this funny and I said I found it disrespectful. He said he meant it playfully and he said sorry. I said texts can be misinterpreted and I said I don’t like shaving. He then sent me a dead reply. I feel insecure now about down there and think that he doesn’t find me attractive down there. I hate shaving it makes me look like I have a bad skin condition from how bad the shaving bumps I get r. I don’t want to shave and im making that clear to him. This has put me off him a bit but I think im going to wait to see him in person and maybe ask him about it again. Is this a good idea or should I just leave it? I feel the need to shave now even though I hate it im really upset :(",
        "Q_score": 304,
        "Id": "11gylsl",
        "Url": "https://www.reddit.com/r/Advice/comments/11gylsl/guy_im_seeing_asked_me_to_shave/",
        "Aswer": "i’m gonna be blunt here - i’m a bisexual woman and whilst i do not care at all if someone i’m with  shaves or not, the last thing i want if i’m giving head is a mouth full of pubes.\n\n\nhowever, you should never feel pressured to shave or alter your body at all for your partner. It doesn’t sound like he was trying to be malicious at all, rather just a communication issue",
        "A_score": 1299
    },
    {
        "Question": "Is it weird that I(15m) am freinds with a classmate(14f) or are my other freinds just being weird/immature?\ni do classwork and talk with her a lot because i have similar interests. i made the mistake of telling my freinds i had to go to talk with her for school and now they have been making things weird, calling me weird and stuff, how do i get them to stop?",
        "Q_score": 54,
        "Id": "11he0xr",
        "Url": "https://www.reddit.com/r/Advice/comments/11he0xr/is_it_weird_that_i15m_am_freinds_with_a/",
        "Aswer": "Ignore them and focus on your friendship.  \nPeople can (and will) be dicks - unfortunately, that won't really change as you get older.  \nHowever, it is your decision with whom you enjoy spending time.",
        "A_score": 90
    },
    {
        "Question": "Is my girlfriend toxic or am I just overreacting?\nHello,\n\nMy girlfriend, about 2 weeks ago, asked if I would be interested in going on a trip to Mexico with her. As a young person who doesn’t have the most amount of expendable money to their name and is trying to save up as much money possible over the next couple of years to begin the process of purchasing my own home, I told her I’m not sure it would be the best idea financially for me. Fortunately though, I do have a job that pays out bonuses! An average bonus can be around $2000 after taxes, which so happens to be just about the amount each of us would pay to go to Mexico. Knowing this, I told her if I got a bonus of at least $2000 this quarter, I would be fine going to Mexico! She agreed. \n\nFast forward 2 weeks. I now know that I will be receiving at least $2000 on my bonus. \n\nExpecting her to be happy, as she loves going to Mexico, I told her that I’m willing to go to Mexico since I have the extra cash on hand. Unexpectedly, she said she no longer wants to go due to the fact that “It’s not fair that I’ve been handed a bonus check and that she would have to work to save up the money”. \n\nIn my opinion, it shouldn’t matter how I got the money. If she was perfectly fine with working to get the money before she knew I received my bonus, she should be perfectly fine working after she knew I got the bonus. \n\nPlease tell me if you agree with me or not and why. I’d love to know everyone’s honest opinion.",
        "Q_score": 466,
        "Id": "11gsh6w",
        "Url": "https://www.reddit.com/r/Advice/comments/11gsh6w/is_my_girlfriend_toxic_or_am_i_just_overreacting/",
        "Aswer": "She sounds less mature and more competitive",
        "A_score": 669
    },
    {
        "Question": "Two of my friends went on a date and one ended up being a total creep.\nJason (24m) and Caitlin (23f) went on a date after meeting at a game night I hosted (fake names). \n\nCaitlin is the sweetest little marshmallow you'll ever meet. She's a little ball full of anxiety and love, generally nervous about confrontation, and too good for this world! She's usually a pretty big introvert, and doesn't go on many dates. \n\nAfter the date, Caitlin reached out to me saying the date went very poorly and she was uncomfortable being around him now. She wasn't trying to put me in an awkward position, but just wanted to ask that for future game nights, I don't invite both of them to the same event. When I asked for further details, she told me about how pushy he had been while they kissed and a couple of creepy jokes he had made. \n\nHere's the thing. She asked me several times to not say anything to him. I wasn't planning on it, anyways, but I promised I wouldn't. \n\nHe's messaged me asking if she blocked him, because his texts aren't going through and he's not sure why. He thinks he was a perfect gentleman.\n\nI don't want to be friends with someone who made my friend so uncomfortable. She didn't go to work the next day. I want to block him, he's not someone I see often, and it should be easy but it's hard. We've been friends for a few years and it sucks that he doesn't know what he did wrong. \n\nI don't know what to do. I'm in an uncomfortable spot. What should I do?",
        "Q_score": 154,
        "Id": "11gxa3v",
        "Url": "https://www.reddit.com/r/Advice/comments/11gxa3v/two_of_my_friends_went_on_a_date_and_one_ended_up/",
        "Aswer": "don’t tell him directly what she said but ask him things that maybe might give him a chance to explain such as “oh how did the date go?” and let him tell the night as he remembers",
        "A_score": 202
    },
    {
        "Question": "I’m starving and my mom won’t feed me. Is there anything I can do?\nI’m 16 years old and I live with my Mom, her ex, and my sister.\n\n2 1/2 - 3 months ago, my mom stopped going grocery shopping, and only on some days would her ex go out and buy ingredients to cook with. Meaning that I go most days with no food at all, with my only form of sustenance being my school lunches. On weekends, I’m shit out of luck. Originally, I thought it has to do with a bad financial situation, until she told me outright that she was simply too lazy.\n\nI tell her that I’m hungry, and she replies to me saying “You’re always hungry.” I’m rapidly losing weight. I’m 5’10-5’11 and I used to be 170 lbs, I’m down to 150 now. I’ve never felt more weak in my entire life, and recently, I’ve started feeling dizzy and lightheaded, some times even short of breath. How get through to my mom?",
        "Q_score": 541,
        "Id": "11jx4dw",
        "Url": "https://www.reddit.com/r/Advice/comments/11jx4dw/im_starving_and_my_mom_wont_feed_me_is_there/",
        "Aswer": "There are times in life when asking for help is the wisest path.  This is one of those times.  Talk to an adult you trust about what is happening, perhaps teacher, an aunt, an uncle, a minister, or somebody who can help you.  Ask for help.",
        "A_score": 894
    },
    {
        "Question": "I didn’t take my placebo pill during my period and didn’t tell my BF. I understand he’s angry and I should have been more considerate but there are many more factors that should have weighed into his feelings.\n1. We have been together almost 9 years. Of those 9 years, I have never had a pregnancy scary, have always either taken pills or had an IUD AND my BF still wears condoms most times we do have sex. \n\n2. I did not take my placebo pill during a week I was already on my period. We are not usually sexually active during my period.  And were not this time. \n\n3. DIRECTLY after the week of placebo pills of this pack, I got an IUD inserted. \n\n4. BF still uses a condom almost every time. \n\nNow he’s incredibly upset with me and telling me he could never trust me again. I’m not sure what to tell him. I understand he’s upset but given all these added factors, I don’t think this should be relationship ending. Am I wrong?\n\nETA for context: we actually already had this fight about a month ago and we agreed it was his right to know about my birth control decisions. HOWEVER. The placebo is the placebo. I know it does nothing whether I took it or not. What he’s upset about is my decision to not take it without telling him. What I don’t understand is why this is such a big deal given all the previous factors AND it being a placebo pill.",
        "Q_score": 415,
        "Id": "11jlwqd",
        "Url": "https://www.reddit.com/r/Advice/comments/11jlwqd/i_didnt_take_my_placebo_pill_during_my_period_and/",
        "Aswer": "Do you both realize the placebo pill is literally *a placebo*? It doesn't have any medication, it's just there to keep you in the habit of taking a pill every day while you have your period. It doesn't change anything. It does nothing.",
        "A_score": 1415
    },
    {
        "Question": "A child I’m babysitting has very large bruises\nHi guys, I’m new to this sub but I don’t know what to do. I [18F] am currently watching two siblings (both under the age of 4), the oldest is still napping, but the youngest is a little girl and I just changed her diaper. When I went to wipe her, I saw a green and purple bruise spread across her entire bottom. It’s very large. Could this be from spanking? I babysit for their best friends every other week as well, should I mention this to them? This is the first time I’m sitting for them, the mom seemed very anxious but I just chalked it up to me being their first sitter ever. I was abused as a child but being in the situation of the grown up, I don’t know what to do. Please help me. Do I take pictures of the bruise? What if nobody believes me without proof? Is that wrong?? I’m going to check the oldest’s bottom once he wakes up while I’m changing him and see if there’s something similar.\n\nUPDATE: The oldest’s entire bottom and legs are bruised too. I have been able to take pictures of JUST their backs and the backs of the oldest’s legs, as they have bruises all the way up their spines as well. Nothing from the photo could be taken as pornographic. I have looked at Mongolian Spots and didn’t know about them prior to this issue, so thank you for those that have educated me. I did call the parents friends who I am very close with and trust, and they said they will help me out. I doubt that it’s those though, they both have the same marks in the exact same spots and they’re purple and look like bruises. I can see blood vessels. I’ll keep y’all updated. Thanks everyone.",
        "Q_score": 175,
        "Id": "11jkzno",
        "Url": "https://www.reddit.com/r/Advice/comments/11jkzno/a_child_im_babysitting_has_very_large_bruises/",
        "Aswer": "If you have even the slightest inkling that there is child abuse going on, you should report it to the police.\n\nIt their job to investigate, find proof, etc - not yours.\n\nDon’t ignore your instincts, if gut tells something is wrong, it probably is.",
        "A_score": 185
    },
    {
        "Question": "i’m being blackmailed\nyes i’m stupid as fuck i know but i’m being blackmailed over my nudes by an unknown person to send them money, i gave them 125$ but they just requested more and i was able to buy myself a week to figure out what the fuck to do they have the screenshots and are able to send them to everyone i know on instagram i don’t even know what to do i’m so embarrassed and just want to give up",
        "Q_score": 97,
        "Id": "11jlmao",
        "Url": "https://www.reddit.com/r/Advice/comments/11jlmao/im_being_blackmailed/",
        "Aswer": "Block them, lock down your social media, and move on. There is **no amount of money** you can send that will make them leave you alone, they will continue asking for more until you block them and move on. \n\nAlso watch out for anyone who messages you here and claims they can get your money back, they are also a scammer.",
        "A_score": 245
    },
    {
        "Question": "What should I do about my sister abusing my niece?\nSo when I was a little girl, I was heavily physically, sexually, and mentally abused by my older sister. It came out when I was about 11, but because my sister was a minor and my parents didn't want to deal with the situation, it lead to no apprehension on her part. Fast forward 17 years, I'm 28 now and my sister has two children of her own. Up until now, there's been no evidence of her abusing my nieces but my mom called me today and told me that the older of the two girls (10) was slammed up against a wall by my sister for \"mouthing off.\" For years, I've put off calling my sister in because it seemed that she was too scared of losing her social position to abuse the girls and that maybe she viewed her girls fundamentally different from me, and I figured that was at least better then a foster home. But now, I don't know what to do. I'm terrified for both of my nieces and feel deeply guilty that I haven't done anything until now, and feel like this has been going on for MUCH longer then we know if my sister was comfortable with casually bringing it up to my mom.",
        "Q_score": 57,
        "Id": "11je9hy",
        "Url": "https://www.reddit.com/r/Advice/comments/11je9hy/what_should_i_do_about_my_sister_abusing_my_niece/",
        "Aswer": "Contact CPS/DHS. Right away.",
        "A_score": 81
    },
    {
        "Question": "Child’s Party\nMy daughter is 10 years old. Yesterday she went to a party trip for a friend.\n\nThere were 8 kids in total. After the trip out they went back to the birthday girls house for food and then we all collected our kids at 7:30pm.\n\nOr at least that’s what I thought. It turns out that the 2 boys were collected, and I collected my daughter - but the remaining girls all had a sleepover.\n\nMy daughter is now quite upset, and to be honest I’m an angry and confused father that my daughter has been ‘othered’.\n\nI just need a sense check from Reddit on what I can do to help my daughter feel better, and also some constructive advice not to feel angry with the birthday girls parents.",
        "Q_score": 91,
        "Id": "11j6v26",
        "Url": "https://www.reddit.com/r/Advice/comments/11j6v26/childs_party/",
        "Aswer": "Everyone on here is being super nice and reassuring you. Fact is if she was the only girl picked up then I actually think she is being excluded. \n\nWithout being too reactionary I would encourage her to broaden her friend group. I have raised two boys and a girl and I can confirm that girls are a much much tougher cohort to navigate from a social perspective. Their bullying can be calculating and truly heartbreakingly nasty. \n\nExclusion is also a really tough finger to point at… they’re all free to choose their friend group so it’s a very easy form of bullying that can be sort of ‘excused’ with a little gaslighting. \n\nI would be very careful with the friend group, encourage her to cast her net further afield while still remaining ‘friendly’ with this lot.  \n\nMy daughter has had this exact scenario happen then was slowly but surely more and more excluded until she was outright ostracized and ignored… we’re looking to change schools as she’s self harming (14y/o). \n\nHopefully I’m wrong and all the other posters are correct but none the less, be open and available, ALWAYS have her back and encourage her to integrate new friends into her life.",
        "A_score": 127
    },
    {
        "Question": "My dad has PTSD wants me to stay home from school tomorrow because he's scared to be alone, but I hate his guts\nSo my dad's a relentless drunk, and I hate his guts. He's an all around asshole, and I just hate him. About a year ago he was fishing on a boat, and it sank, 1 person who was onboard died, and ever since he's been a little more fucked than usual. He's done nothing but drink and get mad and yell ever since. Sure he did all of that stuff before on a weekly basis, but ever since it's been on about a daily basis. So for about a year he just didn't work whatsoever because he's been scared to go back on a boat, but since we're broke as shit he finally went back on the water for a week last week. Apparently they tormented him on the boat and kept playing tricks about the boat going down to fuck with him, so he came home and went on a 3 day bender, yelling and breaking shit for 3 days straight. My mom also happens to be pretty sick, and she's having lots of lung related problems,and she has to go in tomorrow overnight. And he wants me to stay tomorrow to keep him company. Now the thing is, I know if I stay, I'm probably not going to leave my room once so I don't see what difference it makes. On top of that I've already missed a lot of school recently, and while he was on his bender I didn't leave my room for 3 days, so I haven't eaten in 3 days, because I obviously didn't want to go out and deal with him screaming and breaking shit, so for that reason alone I think he deserves to be alone for a day. But the good guy inside of me wants to stay, what should I do?",
        "Q_score": 21,
        "Id": "11jk16c",
        "Url": "https://www.reddit.com/r/Advice/comments/11jk16c/my_dad_has_ptsd_wants_me_to_stay_home_from_school/",
        "Aswer": "I grew up in a less than stellar household, so I’ll advise you as I would have once advised me from this place of hindsight: \n\nGo to school. You are not that man’s keeper. \n\nYour father is not owed your time simply by right of parenthood. He’s creating an awful environment for everyone, including himself. Leaving for a bit during the day will be both good for your attendance and your nerves.\n\nNo one likes a mean drunk. He can wallow by himself.",
        "A_score": 24
    },
    {
        "Question": "How to overcome my fear of fast food?\nMy partner recently started eating lots of fast food and it literally repulses me.. I’m also worried for her health, happiness etc.. \n\nI grew up in a super healthy household so I’m just not used to people eating it around me, especially people I care about",
        "Q_score": 58,
        "Id": "11j9vlw",
        "Url": "https://www.reddit.com/r/Advice/comments/11j9vlw/how_to_overcome_my_fear_of_fast_food/",
        "Aswer": "Realizing that the rule is everything in moderation. Also maybe consider therapy if you're \"literally\" repulsed by fast food and try to work on being less judgemental",
        "A_score": 166
    },
    {
        "Question": "is it weird to offer food to a girl I'm dating?\nGirl I'm dating is low on food at the moment, and doesn't have a job currently. Is it weird to offer her a small amount for a food delivery or something? We've only been on one date, but seems like she's having a tough week. What do you guys think?\n\nEdit: I did end up offering to get her a doordash, kept it light and playful though, thanks for the feedback guys!",
        "Q_score": 34,
        "Id": "11ja5vs",
        "Url": "https://www.reddit.com/r/Advice/comments/11ja5vs/is_it_weird_to_offer_food_to_a_girl_im_dating/",
        "Aswer": "It’s not weird at all! It’s actually very thoughtful and in my eyes it shows your thinking about her! I would find out what her favorite foods are, and then send her a DoorDash meal gift!",
        "A_score": 33
    },
    {
        "Question": "I recently found out I’m pregnant and the father is calling me selfish and won’t talk to me\nI (21F) just found out I am 12 weeks pregnant. \n\nFor a little background information, I’m 21 and the baby’s father is 22. We are not dating. We have been in kind of a situation ship for the past 1.5 years. I was using birth control and he always used protection. I’ll call him “L” for this story. \n\nWhen I found out I was pregnant I knew immediately that I would be going through with the pregnancy and keeping my baby.  I had decided to tell L pretty quickly. I didn’t think he would react the way he did. After telling him, he immediately asked what I was planning on doing. I told him I wanted to keep the baby. He got kinda angry and told me it’s unfair for me to make that decision. He told me he’s not ready for nor wants a child right now. I had tried explaining my feelings on ab**tion, and why I made the decision I did. L didn’t want to hear my reasoning or talk about it whatsoever. He had told me I was being selfish. \n\nI completely believe the father should be able to have some opinion on these things. But on the other hand, it’s also my body and half my child as well. I feel terrible over the way things went with L. He now refuses to talk to me and I’m not sure what to do now. I know I want to keep my baby. \n\nWith all that being said, I’m hoping to get some outside opinions on this. Am I being selfish? Has anyone else been through this? Thanks in advance!",
        "Q_score": 291,
        "Id": "11kia1t",
        "Url": "https://www.reddit.com/r/Advice/comments/11kia1t/i_recently_found_out_im_pregnant_and_the_father/",
        "Aswer": "Your body your choice. But you also can’t expect him to be happy about it. If you want to keep the baby, fine. But plan on being a single mom.",
        "A_score": 1102
    },
    {
        "Question": "I want to break up with my girlfriend, but...\nMy girlfriend isn't the nicest to me. She likes to hit me, hurt me, and say stuff to me that mentally hurts me. I want to break up with her, but she said that if I do, she will kill herself. WHAT DO I DO?? Do I endure the pain, or save myself, but live with the grief knowing that its my fault someone died?",
        "Q_score": 91,
        "Id": "11klhdd",
        "Url": "https://www.reddit.com/r/Advice/comments/11klhdd/i_want_to_break_up_with_my_girlfriend_but/",
        "Aswer": "She won't do it.\n\nBreak up and call that police telling them what she said. \n\nIt's just manipulating you to stay",
        "A_score": 250
    },
    {
        "Question": "My (50F) son (15M) has become a far-right extremist and I have no idea what to do\n \n\nThrowaway account because this is too embarrassing.\n\nFor some context, my son is on the spectrum and has difficulty forming relationships with people as a result, although he still has a few in person friends. He's extremely intelligent, and knows many things, especially when he puts his mind to it. I also know he uses a lot of social media, since it's easier for him to make friends that way, however I did not monitor them which I regret doing.\n\nThe first red flag was when he was 13 and he began talking to me about various statistics which he said proved that the races were not equal, like crime and IQ, and when I pointed out there are societal reasons for this, he went on a rant and said that that these are actually biological (I still don't know what his sources are). At that time I just chalked it up to him not understanding the world very well and assumed he would grow out of it, but it has only gotten worse in every way.\n\nHe ordered a copy of Mein Kampf to our home. Fortunately, I saw the package and threw it away before he could get his hands on it, but when I confronted him about it, he started screaming and telling me that all his online friends and he started a reading group where they would read books together and they started with Mein Kampf, and that now he would be left out. I asked him if any of his friends at school were reading Mein Kampf, and he said that they were \"normies\" who didn't understand reality. I asked him if he thought I was a \"normie\" too, and he went on an incredibly misogynistic tirade against me saying that I was a \"whore\" and a \"roastie\" (I looked up what it meant later and I was horrified) for pursuing my career (which has provided our family with lots of money, including that he benefits from!) and for openly talking about my past relationships before I met his father, and also because his father and were never married and now separated. He told me he hated me for ruining his life by waiting \"so long\" to have children which is why he was on the spectrum and had difficulty talking to people (many of my friends had children at my age and they did not have children on the spectrum, not that it's a problem anyway). And that was only the beginning, I do not wish to go into more detail, but I couldn't even say anything to him as I broke down crying. I loved my son and we were so close until that point and never before had anything so mean ever been said to me. I couldn't handle it. I didn't understand why he would say such horrible things to me, or how he could have learned such ideas. I am a progressive, and especially feminist, and I thought I was raising our son to hold the same values, but he became the complete opposite of what I wanted him to be.\n\nIn the aftermath of this, I confiscated his computer and phone, although I did let him send one last message to his horrible \"friends\" since he wouldn't stop screaming to us about how he couldn't just abandon them without saying anything. However, this did not help in any way. He began spending more and more time outside the house, which I thought was a good thing and that maybe he was socializing with his peers who didn't accept this sort of thing. I also noticed over the next few months that he was getting more and more muscular, I was proud of him, but I also did not want him to believe he had to prove his \"manliness\" by getting big muscles, he then cursed me out and told me I was trying to make him a \"soyboy\" (a term I did not know and had to look up) so he didn't care what I had to say. Eventually I find out he somehow managed to find a skinhead gang after school and they workout together... after I saw him with them, I screamed at him and then at them that they as grown men should stop trying to manipulate a teenage boy and there was no reason for him to spend time with strange men in their 20s and 30s.\n\nAfter that, I was very strict about everything he was doing. I would pick him up and drop him off, even though it meant I needed to take off time from work to do so. When I dropped him off at home, I locked the doors to make sure he could not escape before returning to work. However, this did not work either, and eventually I was called by the school principle who let us know that he and his school friends (who he has also convinced to become Nazis now!) had beaten a group of POC boys up and that he and his friends would receive a suspension as a result. I was so livid. I could not imagine the fact I was raising a future criminal, and he told me that I was a traitor for not being proud of him for being stronger than them and for beating up \"murderers of our people, rapists of our women, and invaders of our lands\". No reason can get to him, and no discipline can get to him. And now I AM SUFFERING THE CONSEQUENCES TOO, all my friends now assume I must be a racist because of my son, and don't want to spend time with me anymore. The other parents at the school avoid me. People who used to be friendly are now cold. I have no idea how to deal with this situation, can anyone here on Reddit give me good advice?",
        "Q_score": 134,
        "Id": "11kf43s",
        "Url": "https://www.reddit.com/r/Advice/comments/11kf43s/my_50f_son_15m_has_become_a_farright_extremist/",
        "Aswer": "Inpatient therapy. Check him into a psychiatric hospital for everyone's safety. This is way above your pay grade. He is obviously not ok, and he needs a professional or six. Especially considering that he's already become violent, it shouldn't be hard to get him admitted. Be prepared to call law enforcement to get him into the facility. You cannot handle this on your own, and the time for outpatient therapy has passed. He'll likely be even more abusive to you in the short term, but in the long term it will be good for all of you.",
        "A_score": 121
    },
    {
        "Question": "My Girlfriend is hanging out with people that she knows openly have a crush on her, as well as people that actively try to ruin our relationship, she refuses to listen to me when I protest.\nMy girlfriend has an issue with disconnecting with people, I’m aware of this and I don’t push her about it. However, we recently haven’t been spending much time together because of how often her friend is staying at her place. They’ve known each other since they were kids and I have no right to step in between them, the problem I have is she is fairly sure that he has a crush on her, at least a mild one. Even though it’s something I’m not quiet about disliking, they wouldn’t stop talking to them even if I really tried (which I have.) the reason I tried wasn’t because of the crush, it was because he’s a extremely rude person, as well as a raging racist even though it’s (Just a joke.) Which bothers me due to the fact I am African American. He’s tried to ruin our relationship and she gossips with him about me as well, I love her but I’ve found myself not showing it as much because of how uncomfortable I felt when I learned all of this. On top of all that, she’s just now telling how many of the people she talks or talked to recently (Like a couple months) have a crush on her that she’s aware of. She out right refuses to stop talking to any of them, I don’t want to break up with her but I don’t know what else to do.",
        "Q_score": 22,
        "Id": "11kr71h",
        "Url": "https://www.reddit.com/r/Advice/comments/11kr71h/my_girlfriend_is_hanging_out_with_people_that_she/",
        "Aswer": "If she likes the attention more than the comfort of her partner, I feel like you should set her free to pursue this attention-seeking on her own.",
        "A_score": 23
    },
    {
        "Question": "I’m 18 and haven’t left my house in 2 years.\nI left school at 16 with 0 GCSES and since then I’ve been living with my parents doing nothing but playing games and watching stuff. \n\nI have no friends, no goals or passions, I havnt left the house since I stopped going to school, there has genuinely been times I’m unsure what month it is. \n\nI don’t know how to speak to people, the only face to face conversations I have are short and occasional talks I have with my brother. \n\nI want to start having a life but I don’t know where to begin or if it’s seriously too late for me. I don’t even know if I can get a job when I have no GCSES, experience or people skills for an interview. \n\nHow do I make friends at the very least or have a relationship? Like I don’t understand how it’s possible at this stage. Google says just talk to people and you’ll learn with practice, but who would want to talk to someone who doesn’t know how to talk? \n\nI’ve literally spent my whole life just drifting along with no one and nothing being babied by my parents to the point I’m convinced I have a disability they’re not telling me about.",
        "Q_score": 142,
        "Id": "11k6g4v",
        "Url": "https://www.reddit.com/r/Advice/comments/11k6g4v/im_18_and_havent_left_my_house_in_2_years/",
        "Aswer": "Your parents have failed you and you are failing yourself as well.  You get out of life what you put into it.  If you put nothing into it then you'll get nothing out of it.  I would recommend finishing your education then getting a job.  Once you have a job you will meet others and you can work on your social skills.",
        "A_score": 221
    },
    {
        "Question": "Should I send my ex the necklace he gave me with his name on it?\nMy ex broke up with me a few months ago. It wasn’t a messy breakup, I took it hard and sent a few lame texts but thats about it. I’ve stopped trying to contact him so I can heal but I have a necklace he gave me with his name on it. I think it would be best for me to get rid of it but I feel weird about throwing it out. Would it be weird to send it to him and let him deal with it?\n\nAlso, any advice on how to get over said ex? He was my best friend and first love, all my friends were his friends so im kinda just alone now lol.",
        "Q_score": 28,
        "Id": "11kl8wc",
        "Url": "https://www.reddit.com/r/Advice/comments/11kl8wc/should_i_send_my_ex_the_necklace_he_gave_me_with/",
        "Aswer": "Toss it. Don't send it to him, it's like contact. No contact.",
        "A_score": 89
    },
    {
        "Question": "Is it controlling to ask your bf to stop watching porn ?\n",
        "Q_score": 27,
        "Id": "11k48vg",
        "Url": "https://www.reddit.com/r/Advice/comments/11k48vg/is_it_controlling_to_ask_your_bf_to_stop_watching/",
        "Aswer": "Human relationships are far more complicated than black and white statements, so it’s often dangerous to a relationship’s longevity to take in advice that is so absolutist. (Notions to some of the replies) \n\nI personally don’t believe it’s controlling to ask your boyfriend, because your boyfriend also has a choice in agree or disagreeing based on his personal boundaries. \n\nI would say, if you want a partner to not watch porn, communicate that to them, and see what they think. If they don’t agree, look inward and decide if this topic is a large enough issue to be a potential breaking point. There’s no right or wrong morality in finding your personal boundaries, and there’s nothing wrong with saying to someone, “we’re not totally compatible.” Just take note when you find these boundaries, and see if you want to find a partner that reflect them too.",
        "A_score": 157
    },
    {
        "Question": "Is it normal to be attracted to masculine women?\nGuys I don't know if this is normal. I'm definitely a straight male. I have no attraction whatsoever to men. But women who are somewhat muscular and have short hair really seem attractive to me for some reason. Even better if I feel like they might stand up for me or protect me.\n\nWhat does this mean? Does this make me less of a man?",
        "Q_score": 131,
        "Id": "11lk8b9",
        "Url": "https://www.reddit.com/r/Advice/comments/11lk8b9/is_it_normal_to_be_attracted_to_masculine_women/",
        "Aswer": "Attracted to women, somehow thinks that's gay. Just... think about it for a second lol",
        "A_score": 340
    },
    {
        "Question": "Little sister took over 60 of my multivitamin gummies. I’m scared to tell my parents.\nI was watching two of my non-verbal autistic siblings like I do everyday and everything was fine until I went in my room for a bit to go on my computer . I have my computer to where I can see my door in case my sister walks out her room. I do this because she steals everything and either rips it or puts it in her mouth so she has to be monitored 24/7\n\nI guess I didn’t see her take my men’s multivitamin case but when I checked on her later there she was eating two of them. I had her spit it out and I took the case and quickly counted how many were left. In total there’s 150 gummies, I had taken 10 so far and when I counted there was 76 left meaning she supposedly ate 64 gummies because I couldn’t find any in the room, Your suppose to take 2 a day. \n\nI don’t understand how she opened it because it’s child locked but she did and I’m freaking out because my parents will kill me if I tell them. She’s overweight and the multivitamins are for men but she seems fine and normal, it’s been an hour already. I don’t know if I should tell them because everything seems fine. What do I do?\n\nUPDATE: I called poison control and they said she should be fine since their gummies but to just give her lots of water.",
        "Q_score": 543,
        "Id": "11l6l4a",
        "Url": "https://www.reddit.com/r/Advice/comments/11l6l4a/little_sister_took_over_60_of_my_multivitamin/",
        "Aswer": "Seconding calling a poison control hotline to confirm if this is an issue or not.\n\nEven if she'll be fine, let your parents know. They may not be aware that she can get through childproof packaging and eat things that she shouldn't.",
        "A_score": 636
    },
    {
        "Question": "27M my girlfriend is leaving me because I don't have money\nBasically I'm 27m unemployed for 3 years and I cant find a job, I liked this girl and we started dating, I didn't wanna feel small to her so I'd usually spend money from my savings on dinners and gifts etc, now Im literally broke so when we hang I take her to cheap places or the park or just a car ride and yesterday she got upset when I said I don't have money to go to the movies and said \" you're the man you should be able to take care of me \". It honestly broke me to pieces and almost cried and idk what to do, I'm an engineer but I am having an extremely hard time finding any job even one not related to my field, my bank balance is 0 and all the cash I got is around 40$\n\nWhat do I do?",
        "Q_score": 26,
        "Id": "11ls1cg",
        "Url": "https://www.reddit.com/r/Advice/comments/11ls1cg/27m_my_girlfriend_is_leaving_me_because_i_dont/",
        "Aswer": "You need to worry less about dating and more about the fact that you have no money to support yourself.",
        "A_score": 114
    },
    {
        "Question": "Confused about my sexuality and in the process of losing the one person I was ever comfortable with.\nI'm having trouble finding a subreddit this fits in, but am desperate to send it off somewhere!  It just mysteriously never showed up on the other ones I've tried, so I wonder if the mods just quietly deleted it, or never let it through.  I hope this is okay to post here.\n\nI don’t know what I hope to get out of this post.  Maybe advice, or information that seems relevant to any of it, or just your own stories if you’ve been through anything like this or find any of my problems relatable.  I want to know it isn’t just me. There’s a lot to unpack here, and I don’t know how to organize it all, so here we go! It’s going to be incredibly hard to follow, and I’m sorry for that.\n\n---\n\nI seem to be broken.  The hardware is all there, but the software was never installed,  Maybe the software is in there, but too buggy to work.  I don’t know.  All I know is I’m 25 and have never had sex, and don’t really have desire to.  I mean… I want to try, now, sort of, but haven’t always.  I want someone to appreciate my body.  I wish I had let someone appreciate it when it was younger and stronger and tighter.  I age, and lose my opportunity to explore, to be desired.  I am not religious; it is not that Catholic Shame that prevents me from sex.  It just horrifies and disgusts me.  I evolved for multiplying, and the sex that is a necessity for it.  Sexuality is a big part of being a mammal, of being a human.  Why why why do I lack it?  I can enjoy looking at a man, generally don’t enjoy looking at women the same way, and tend to be more comfortable when the view excludes the genitals.\n\nMy external sex organs feel uncomfortable and creep me out a bit, but not as bad as they used to.  I have not been a victim of sexual abuse.  I am not transgender.  I feel like a woman, and would be unhappy with a penis.  (Any ideas what could be up with me here?)  Physically and mentally, I am a woman; however recently I have come to wonder if it is possible to be psychologically one gender but *socially* the other, if that makes sense.  The way a man treats a male friend is very different than a woman treats a woman, a woman treats a man, or a man treats a woman.  There is a specific kind of friendship and interaction I have only ever observed between men, and it saddens me that it is unlikely I will ever fully experience that type of bond.\n\nBesides this lack of sex drive and such, I am not much of a people person.  I have my one good friend, and that was all I needed, but I’m losing him through no intention of either of us.  I have made a few work friends, even having gone to parties with some and out to a restaurant for drinks with another, but find it hard to be with people.\n\n---\n\nWe were originally “pen-pals” (keyboard pals).  I was in university and heavily struggling.  It turns out I had some wild anemia that should have left me completely incapable (but somehow didn’t quite) and some fucky hormones that were making it hard to function, but I didn’t get those answers when I needed them.  I felt very overwhelmed and alone, ended up on a penpal-finding site, and he messaged me.  At first, I was annoyed by his comment that he, too, knew how it felt, to feel like one was getting left behind in a world that was moving on too fast, but kept that thought to myself and kept the conversation going.  Turns out, he really did know, better than I.\n\nWe became great friends.  We could tell each other anything.  I learned he was ill, lost most his friends because of it (when he couldn’t party, the partiers left; when he couldn’t work, those relationships dissolved; when he couldn’t play cricket, his teammates were no longer teammates).  He left home at 17 to escape an abusive alcoholic father, worked so hard on his education, got his degree, and I imagine life was finally becoming okay.  He only got to work a few years at the career he fought for before he became ill, and eventually couldn’t physically perform regardless of how hard he pushed.  He and I found each other and became pen-pals a few years later, at which point he was mobile within his home and usually managed to get outside a little bit once every few days.\n\nHe was (is?) fun and upbeat, charismatic, witty.  I was surprised to eventually learn that he had gone through some sexual and emotional abuse/trauma that left him with body dysmorphia, feeling worthless and unlovable, on-and-off suicidal with several botched attempts.  Even before this came out, we were very close, and it made me more comfortable with being open about my own struggles with the idea of sex.  Our problems here were very different, but somehow also very much the same.\n\nYears of phone calls and photos and daily text-chats went by.  He’d often express his regret that I wasn’t from somewhere closer (“shame you’re not local”); we’d talk about how nice it would be if I could just pop in for a cup of tea and a visit, sometimes.  We’d discussed the possibility of me coming to meet him, someday.  Perhaps that amount of long-distance communication is odd and unhealthy.  What do you think?  Can someone really be friends with a person they’ve never met?  Were we too co-dependent?  \n\nAnyway… a couple years went by, and I ended up going traveling through a few countries that were close together.  At the last country, I ended up on his doorstep.  He didn’t know I was coming, and I had found a few accommodations (hostels and campgrounds) nearby that I’d intended to check out and check into one of once I arrived.  I thought he’d probably chat with me on his doorstep, and if things went well I would come back and spend more time with him other days.  To my surprise, this beautiful, generous, vulnerable human who had no idea I was coming *trusted* me, opened up his little home to me, and made it clear that I was welcome to anything in it.  Though he is just renting one room in the house, I ended up there at a point where 3 others had just left and a fourth was in the process of moving out and no longer lived there, so we had privacy and the run of the house.\n\nWe watched movies together and played a board game he ordered.  We sat around and drank tea and listened to music and chatted and were our odd selves.  I had recently joined a cricket team in my home country, and he helped me practice his sport a bit outside.  He wanted to make sure I explored and did some touristy things, and would find me maps and send me off on adventures he couldn’t follow on.  As I walked out the door, he’d be grabbing me my the backpack to stuff in snacks and juice and the like.  He told me what foods I should try and where to get them, and once when I got home from a hike, I found he had made me a big pot of pasta.  I know that took a good bit of effort with his limited energy.  I felt so cared about.  I loved so well, and was so well-loved.  But, of course, I had to go back to my own country.  Those were a happy 10 days that I’ve been chasing ever since.\n\nWe continued chatting via text and phone call, sharing photos and videos.  A few months later, we planned for me to return the next summer.  We thought I might get a YM Visa down the road, so I could live and work out there for a couple years, but I’m getting older and trying to start a career, and am only eligible for that visa until I am 30, and I can’t see this being a possibility in the next few years, so I guess that’s that, then.  Yet another thing the pandemic ripped from me.\n\n After I left that first time, I kept becoming even fonder of him.  I loved him; I knew that for a long time.  He felt like a cool older brother, sort of, and I loved him that way.  But also I was discovering it was a versatile kind of love.  I *could* love him like a sibling.  I could love him as if he were my son, and I were ferociously maternally protective.  I could love him as a friend.  I felt a sort of attraction I’d never felt, before, too.  I could love him romantically, if I so chose.  So I did, and once I spilled my guts out to him, he eventually came around to the idea as well.  I didn’t push him; he just grew into the idea on his own.  We we became even closer, in this strange new way.  Eventually, I felt willing –– excited, even –– to try to explore some physical intimacy and sexuality with him.\n\nThe pandemic started getting attention a couple weeks before my flight would have left, and he urged me to cancel my ticket and try again when it was sorted out and safer in a few weeks.  Boy, if we knew then what we know now…\n\nIt’s been 4 years since I’ve seen him.  He’s gotten gradually sicker the whole time, which was somewhat expected.  Most days he’s not really well enough to chat back-and-forth, but will still text me to let me know he’s okay.  On lucid/focused/better (never “good”) days we chat and I see his old self peek out from time to time.  He is vaccinated, but caught COVID a while back, which also did not help things. I thought that post-covid would be a good time to slip in a visit, during the window which he had the antibodies from fighting off the infection and would be protected by both the vaccine and natural immunity.  He said he was too sick to visit (I think he’s self-conscious about his situation; things must be unravelling over there) and too scared, and I watched that little window where I could visit without putting him in danger slowly close.\n\nI know I won’t see him again, now.  I’ve tried to come to terms with that for the last few years, but keep finding myself picking up scraps of hope.  I wish I could move on.  I’ve tried.  I have a hard time finding people I can make connections with, and he was one of the precious few.  I don’t know if I’ll ever experience a romantic connection again.  I don’t know if I’ll ever feel ready to explore intimacy again.  I don’t want to die a virgin, but I can’t bring myself to even consider touching anyone else, yet.  Maybe the right person will come along, and be patient enough to stand by me for years as a friend, until I feel safe and secure and emotionally connected/intimate enough to try.\n\nI just can’t stop thinking of all those little pockets of happiness we’ve had, and all the happiness I never got the chance to have.  I imagined getting home from work and crawling into bed behind him, or making dinner while he kept me company.  I thought about the movies and music I wanted to share with him, all the cups of tea I wanted to drink with him.  I think about wanting to wake up to that bright face and its absurdly mobile eyebrows (he emotes with these in the most adorable, exaggerated way, lol), that beautifully rough voice and its prickly accent.  I never met his mum, but we sort-of interacted, and we somewhat communicated through him.  Early on, when we were just starting to get close as keyboard-pals, I guess he told his mum and sister about me.  They asked about me a few times over the year, and supposedly expressed fondness.  I’ve asked about them some, too, and get the impression that I would get along with his little family very well.  As creepy as I’m sure this is, I looked forward to meeting them, and am sad I will not.  I always thought I’d bring his Mum a little pot of zinnias to first meet her, and we’d probably end up drinking tea and talking about bits and bobs and…\n\nanyway, I’m rambling.  It’s just a weird thing.  I always knew this relationship was a long shot and could never actually last, but I wanted to steal a few more happy moments in this life, and thought I could help supply some better moments to him, too, and it’s hard watching that opportunity become an impossibility and not knowing whether I will ever feel such a connection again, or if I even want to feel such a connection with someone else.  I know this whole thing has been absolutely absurd from the beginning, but kind of wonderful, too.\n\n---\n\nWas this relationship always unhealthy?  Was it weird?  How do I get over it?  How do I move on?\n\nAny idea what's up with my sexuality?  What can I do about that?  I don't want my broken sexuality.  I want to be able to explore.\n\nWhat about my thought of being \"socially male\"?  Any idea what that might be?  Is there a term for it?",
        "Q_score": 30,
        "Id": "11lrkeh",
        "Url": "https://www.reddit.com/r/Advice/comments/11lrkeh/confused_about_my_sexuality_and_in_the_process_of/",
        "Aswer": "1. This sounds like a good relation where two people with similar, but not exactly the same issues support each other. Without toxicity. That is rare. \n\n2. Regarding your sexuality, maybe lurk on the r/asexual and r/asexuality sub.  You may be demisexual or graysexual. Or asexual. \n\n3. This can happen if you want a relationship where you are not wanted for your body or for sex. This may stem from number 2. \n\nI hope you two can keep on supporting each other. It seems that you have a special friendship.",
        "A_score": 6
    },
    {
        "Question": "[F 21] Dad stole $4200 from me to \"make a point\"\nOur bank is Navy Federal, and he's the veteran, so unfortunately, he's the sponsor who oversees my bank account.\n\nI had gotten 5000$ as a refund for not living on campus anymore. I live at home bc it's cheaper and because it's only 30 minutes away.\n\nI did spend money on small things, like lunch or dinner, bc I don't have a meal plan at college anymore.\n\nMy parents got pissed that I wasn't home by 9 pm last night due to a literary magazine meeting that ended at 9:30. Normally my curfew is 10. \n\nAs a result, my dad took $4200 out of my account, left me with no money in my checkings, and left me with only $600 dollars in savings. Keep in mind that I have to pay for college next semester, so that's not going to work at all. \n\nI have a job that pays $11.75 per hour, and I live in AL, so that's not bad ig. The thing is, I planned on not only paying for next sem bc my grandma's money wouldn't cover it, but I also planned on moving out to an apartment to get out of this abusive household. \n\nMy parents said that I'd get the money back \"when I can prove that I'm mature\" or something. But since I can never get their approval on anything I do anyway, I know that'll never happen. \n\nThis feels incredibly wrong to me. Most of that money was the refund from college that my gma is paying for, and some of it I even earned. My dad did give me a generous amount at one point but I can't remember how much it was.\n\nWhat can I do to get that money back? I feel like he just stole everything from me. Or what should I do now, when I can't pay for next semester and can't pay to move out?",
        "Q_score": 241,
        "Id": "11l9unk",
        "Url": "https://www.reddit.com/r/Advice/comments/11l9unk/f_21_dad_stole_4200_from_me_to_make_a_point/",
        "Aswer": "You’re 21 and your parents control your bank account and have a curfew for you?   Time to take control of your finances and your life and move out!   Find a bunch of roommates if need be, but living under that kind of control at 21 is not right and not fair!   You’re an adult and have every right to be treated as one!",
        "A_score": 485
    },
    {
        "Question": "Husband’s request\nMy husband has asked me on several occasions to wake him up with a blowjob, which would be fine, but he has narcolepsy. \nHe is the hardest person to wake up. \nHe’ll sleep through alarms, being shaken, etc. I’ve told him that I’m concerned that if I tried to do what he asks, that he it won’t wake him up. \nHe was unbothered by it and said that he for sure would wake up. What should I do? I don’t want to put myself or him in an uncomfortable position, but this is something he really wants.",
        "Q_score": 26,
        "Id": "11lm00g",
        "Url": "https://www.reddit.com/r/Advice/comments/11lm00g/husbands_request/",
        "Aswer": "If you try it and he doesn't wake up, just stop. No big deal.",
        "A_score": 81
    },
    {
        "Question": "I’m on a deployment overseas, and I know of several soldiers cheating on spouses/partners. Should I stay in my lane or expose them? What is the right thing to do here?\n",
        "Q_score": 542,
        "Id": "11kw6qf",
        "Url": "https://www.reddit.com/r/Advice/comments/11kw6qf/im_on_a_deployment_overseas_and_i_know_of_several/",
        "Aswer": "I used to do marriage counseling when I was in the Army. With  each couple, I would meet with the partners individually, with EVERY SINGLE COUPLE I would ask about  infidelity.  Each and every time both would say NO. Then I asked:  \" When you and your spouse were apart for deployment,  did you have sex with someone else?\"\n\n100% at least one partner said YES. \n\nI never understood it. I still  don't.",
        "A_score": 1021
    },
    {
        "Question": "My girlfriend is pregnant - we decided not to keep it, now she says she would only abort it “for me”\nI feel awful. My girlfriend (27f) and I (29m) have known each other for 7 years. We finally became a couple 3 months ago. Now she’s pregnant (yes we did use protection)\n\nWe’re both still dependent on our parents financial aid and I don’t think we could manage a child let alone offer a good life for them.\n\nI’m a trained actor and work two jobs to support myself alone. She just started an education in illustration and works part time as a call agent. \n\nOn top of that I struggle with some mental issues and have just started therapy.\n\nWe initially decided against the child but today my girlfriend said that she would only abort it “for me”. \n\nI don’t know what to do. I love this woman and definitely want to have a family with her. But right now seems too irresponsible and honestly impossible. The more we talk, the more I feel like she definitely wants to keep the baby.",
        "Q_score": 144,
        "Id": "11l2crz",
        "Url": "https://www.reddit.com/r/Advice/comments/11l2crz/my_girlfriend_is_pregnant_we_decided_not_to_keep/",
        "Aswer": "Remind her to think about the child's perspective. I was born to parents who didn't plan it, and it was awful. I'm estranged from one parent and I am low contact with the other.  I wish they had waited to become parents. \n\nEvery child should be born to parents who have prepared, saved, matured, achieved their goals, and are ready to sacrifice their money, sleep, time, hobbies, and social lives for the kid. \n\nIt's her choice. Tell her you aren't ready to be a proper father.",
        "A_score": 174
    },
    {
        "Question": "Post got taken down in another sub! I’m really just desperate for help!\nDesperately needing suggestions for home.\n\nHello, I’m F(21) and my dad is 67. We’ve always lived in the same house, but since mom passed in ‘09, the quality of our home has completely went to hell. Never cleaned, etc, and was never forced to pick up or have a daily routine. I recently got on new meds to help w depression and to overall motivate me to live a better life while I do counseling and other things. Dad and I both are severely mentally ill, but he has never got treatment. He is retired now, but does nothing all day. The state of our house is completely unlivable at this point, mold to where one room is completely closed off and I can’t breathe (I have asthma and severe allergies), it is also just filled with trash bags, etc. We have carpets in every room but kitchen and bathroom, all of which are completely destroyed, so much clutter to where it’s unbearable and there is no living space (house is only 800 sqft). Dad sleeps on the nastiest couch with the dogs (we adopted before mom passed). I want to completely tear down the house and build a new one. He just wants to start on fixing the house by “expanding the closed off bedroom”. We don’t have any appliances replaced because even if someone would come inside to help install, how would we even get around things. PLEASE, I am desperate for tips to start this project and I am young and clueless how to, I cannot live like this anymore. If all goes well, I will potentially have a job making $70,000+ soon (fingers crossed). We are well below poverty line, so all I can think about is how I want to tear down this place, as I think it is well beyond saving, and build our new home. Thank you all. A few comments I had previously suggested first getting a dumpster to empty out the trash of the home, but then what next..?",
        "Q_score": 34,
        "Id": "11ld9qy",
        "Url": "https://www.reddit.com/r/Advice/comments/11ld9qy/post_got_taken_down_in_another_sub_im_really_just/",
        "Aswer": "Are the both of you open to throwing things away?",
        "A_score": 22
    },
    {
        "Question": "Should I call CPS on my bff and his wife? She attempted suicide at home while child was home. Idk wtf to do.\nMy bff and is wife have a 4 year old.  Suspected neglect,the child super small and developmentally way behind, kind of always dirty.   Dads a gamer and is always gaming.  Mom has a bunch of mental illness and depression.   I don’t think either can care for him.  Anyway, mom attempted suicide in the house while dad and child were home.   Mom is I guess in the hospital.   Dad is home, but he says his 4 year old is staying with family until Mom comes home. I don’t know why.  \nHow safe is it going to be for that kid to be in the house with a Mom who just attempted suicide?   I mean, the care for the child prior to suicide was questionable.   \nWill anyone from the psych ward worry about the kid?   \nI mean, he’s my bff.  Do I call cps?  We don’t know what to do.  Super worried about this kid.",
        "Q_score": 29,
        "Id": "11l93uf",
        "Url": "https://www.reddit.com/r/Advice/comments/11l93uf/should_i_call_cps_on_my_bff_and_his_wife_she/",
        "Aswer": "Yes. Call CPS. Sounds like there’s some very valid concerns for the kid’s health and safety. You could save the kid’s life. This is so sad",
        "A_score": 36
    },
    {
        "Question": "my sever admins are trying to make my discord server lgbtq+\nOk the title sounds a bit strange this might need some context then I'll do the advice part (this is my first post so I don't exactly know if I'm doing it right)\nBasically I have a discord server focused around gaming and technology and we needed a name change science we all decided the current name didn't represent the server but the admins have been trying to push a name involving lgbtq+ things. I'm not homophobic or anything and i support the lgbtq+ community but at the end of the day it's just not what the server is focused on there are other servers out there focused around that. I've changed the name for now as for some reason I'm finding this whole thing pretty stressful but I really don't know how to handle this situation\nIf people need more information just tell me as this is my first post.\n\nEdit:good news situation is sorted thanks for the help",
        "Q_score": 30,
        "Id": "11ks5gb",
        "Url": "https://www.reddit.com/r/Advice/comments/11ks5gb/my_sever_admins_are_trying_to_make_my_discord/",
        "Aswer": "\"Sorry but this community is about games and technology so i don't feel having LGBTQ in the name would represent it well.\"",
        "A_score": 68
    },
    {
        "Question": "How do I tell my sister I don’t want to share a space with her when we travel?\nMy family (husband and 5 kids) are invited to my nieces graduation party in another state. Because of our family size we prefer to get an Airbnb and while we’re visiting we will also take our kids to do some touristy thing. Well my younger sister, Layla was  also invited and suggested we get a place to share so that her kids can hang out with mine and we could save a bit of money by splitting cost.. In most circumstances/ with most people ( or Layla solo) I wouldn’t mind but I really do not want to spend any amount of nights with her kids.. I love them. I truly do. I just can’t handle how naughty they are.. The younger one isn’t that bad but the older child, Keith (8),who I suspect is neurodivergent, does not listen, he is very rude, has little to no manners, and is mischievous in scary ways. Part of me wants to support her because she’s a single mom but the other part of me doesn’t want to ruin this time away from me, my husband or kids.. Because of the last trip we took together where Keith was caught stealing, set a garbage can on fire, and wouldn’t listen to Layla at all; My husband was a firm no. so, that’s what we’ll do but I don’t know how to tell my sister without this coming off really bad.. She is super sensitive and always feels like the world is out to get her and her kids. They literally do no wrong in her eyes until it’s really bad. I don’t want her to feel picked on and I don’t want this to cause rifts between us.. how do I let her down easy?\n\nEdit: I just ripped the bandaid off and used a combination of being clear about why we don’t want to share a space but made it less about them and more about us.. I just told her we plan staying with a friends one night ( which is true) and that I think it would be best for all of us to have separate spaces to unwind since our kids will all be a bit more cranky from traveling.. I also said it would probably be best so none of us have to deal with each others kids different sleeping patterns and such.. \nI appreciate the input. It helped me find a way to be kind and direct about my families needs. The only think I didn’t do was write it in a away that was absolutely firm so if she come back with a “ oh I don’t mind” I’ll have to add a bit of spice to make sure she understands it’s nonnegotiable. ( I text her since we have very different schedules and half the time she doesn’t answer her phone anyways)",
        "Q_score": 23,
        "Id": "11kl4iw",
        "Url": "https://www.reddit.com/r/Advice/comments/11kl4iw/how_do_i_tell_my_sister_i_dont_want_to_share_a/",
        "Aswer": "\n>Because of the last trip we took together where Keith was caught stealing, set a garbage can on fire, and wouldn’t listen to Layla at all; My husband was a firm no.\n\nOof!\n\nThis is a **rough** situation! I can totally understand why you wouldn't want to vacation with Baby Satan, but I have no idea how you communicate that to your sister without hurting anyone's feelings.\n\nMy suggestions: \n\n1. Maybe see if he can visit his Dad during the event?\n\n2. If he can't, maybe go the other way hard and get your sister in with a family counselor who specializes in behavioral therapy. They can do wonders. Costly, but you can't realistically avoid your nephew forever and he's a little boy who needs help.",
        "A_score": 13
    },
    {
        "Question": "How to go to a bar by myself and hopefully meet someone?\n(20F) I'm new to drinking. I don't have much friends and I'm very socially awkward. But I am brave enough to go out and try new things. I havent experienced a relationship yet and it's not like I'm desperate or whatever but I'd like to know how to behave in such an environment alone. The last time I went to a bar, it was really crowded and I was in a corner by myself not knowing what to do. I think I'm okay looking but I feel like guys my age want nothing to do with me as every guy that walked in didn't even throw a glance my way lol. I just need some advice.",
        "Q_score": 21,
        "Id": "11k2lyy",
        "Url": "https://www.reddit.com/r/Advice/comments/11k2lyy/how_to_go_to_a_bar_by_myself_and_hopefully_meet/",
        "Aswer": "Going to the bar with the specific intention of meeting someone special is almost always disappointing.\n\nGoing to the bar to without reservations and have conversations is much more rewarding.  I go to the bar TO TALK to other people that don't work with me or live in my house.   There are dozens of people I talk to at our local bar.  There are several friendship groups that occasionally invite me to stuff because I know them through the bar.\n\nThis is difficult for introverted people.  Not only do you have to put yourself out there, some people won't always like you or want to talk to you.   That's life.   Its also difficult if nobody is up there.  If no one is there, I have just one or two and chat with the bartender (all of whom I know.)   This is more difficult in packed clubs with a hundred people.\n\nEvery serious relationship I've ever had happened when I wasn't \"trying\" to meet someone.  Its almost like trying too hard messes everything up.   Just be yourself and be open to making friends and talking to other people.  The rest will happen eventually",
        "A_score": 46
    }
]