{
    "Posts": [
        {
            "Question": "What is the best way to break up with a live in gf of nine years?\nMyself ( M, 32) and my gf (F, 33) have been together nine years.\n\n4 years ago we moved to her hometown , because she said she wants to live by her family and start a family there. We have been waiting for me to have a a higher paying job before me proposing.\n\nShe makes more money than myself. With living in the expensive area her family lives, I struggle to make ends means especially as we split everything 50/50 and in situations where I cannot she has an excel sheet to keep track of it.\n\nOver the past 4 years, I have tried really hard to fit it, but I am miserable. I hate that place and would rather live somewhere with more simple people and some nature.\n\nI recently got a huge pay upgrade, and I thought that this would make me happier. It only made me more miserable because I realized it was not the finances that were making me unhappy, its the location.\n\nShe is very clear that she would only live in that town.\n\nI want to break up but I am really struggling with the logistics. We live together and I also cannot leave my job abruptly because I want to keep a good relationship with them.\n\nI have no support system and no where I can stay because we live by her childhood friends and entire family.\n\nI am also terrified she will hate me. I feel so bad that I will be walking away after nine years and I know she is expecting an engagement and marriage, and babies in the coming two years.\n\nAny advice would be so helpful please!",
            "Q_score": 175,
            "Id": "12r76gm",
            "Url": "https://www.reddit.com/r/Advice/comments/12r76gm/what_is_the_best_way_to_break_up_with_a_live_in/",
            "Aswer": "You may be better off suggesting the two of you get a therapist to walk you through this uncoupling.",
            "A_score": 283
        },
        {
            "Question": "Is making short films a really odd hobby for someone in their 30s ? How can I deal with people insulting me over my hobby ??\nI have a hobby of making short films and I'm currently working on an action thriller film. The film has a character that's inspired by Donnie Yen's character in John Wick 4. I bought all of the things that i need for the film, the sunglasses, cane and an airsoft gun. I was told that my hobby is lame and that no one in their 30s does this as they claim its childish. Is it really that childish ?? How can I deal with people insulting me ??",
            "Q_score": 33,
            "Id": "12rk8sg",
            "Url": "https://www.reddit.com/r/Advice/comments/12rk8sg/is_making_short_films_a_really_odd_hobby_for/",
            "Aswer": "There's is no shortage of people willing to hate on things, its on you to stop caring about what they think.\n\nMaking short films sounds perfectly fine to me but even if it didn't, why should you care about my opinion on your hobbies? You don't need approval.\n\nUnless it is harming others, follow your passion. It is your life, it would be a shame to waste it.\n\nI happen to be obsessed with mountain biking. But if someone else is just as passionate about basketweaving, I have equal respect for it. \n\nThe only people I don't have much respect for are the haters that do nothing but consume, never doing or creating, and all their useless shit talking.",
            "A_score": 21
        },
        {
            "Question": "Male colleague asked me to tie his shoes\nI (23F) was asked by my male colleague (late 30's?) to tie his shoes. He also referred to himself as \"abang\" (meaning brother in Malay, but can be used affectionately to refer to an older man - think like \"oppa\" in Korean). I found it weird so I didnt do it, but I'd like to know if there was any other meaning behind it. \n\nI told my parents about this weird encounter and they got very angry. I'd just like to know what it's supposedly suggesting",
            "Q_score": 71,
            "Id": "12re1qr",
            "Url": "https://www.reddit.com/r/Advice/comments/12re1qr/male_colleague_asked_me_to_tie_his_shoes/",
            "Aswer": "It is very weird.  I would not tie his shoes either.  He may have a fetish or maybe he is just odd.",
            "A_score": 99
        },
        {
            "Question": "If a friend asked me for a small art favor, and I didn't want to profit from it is it appropriate to ask them to cover the cost of supplies?\n***This doesn't apply to gifts, nor to professional exchange for profit***\n\nSay your friend is working on a project and they decide that an illustration would really make it come together. They can't find a royalty free piece of clipart or a stock image that would fit, so they go to you and ask for a one-off favor. There is a mutual understanding that neither party wants to profit from this exchange. This doesn't apply to gifts(charity), nor to professional favors which would be public or for profit. Is a favor for a favor, instead of paying for professional art you're going to make it for them, and exchange they're going to do something small instead of paying full price.\n\n**Edit: because people are misunderstanding, this is coming from a real life situation. I offered to make my friend this art for free, and they refused to let me do it for free. They told me to come up with a favor for a favor in the middle, and I wanted to know what was reasonable. Friend does not want art for free!** ***Friend does not want art for free!*** Favor for a favor, not favor for ***free!***it felt weird to talk about the personal side of it in public. I autistic and I don't always do a good job picking out what information is and isn't important to context, so I'm sorry if you got confused. I really just need to know what the hell favor means I what the fuck I'm supposed to do about that. Are these good exchanges?\n\nArt supplies are expensive sometimes, and digging into my personal supply will take away from my ability to work on personal projects later on. It would also be bad if I ran out of supplies while working on the project for them. So, in the spirit of fairness would it be appropriate to ask them to meet even with you by covering the cost of those supplies?\n\nIn traditional work this might look like asking your friend to give you enough money to buy a crowquil, ink and pad of vellum or a number two round brush just in case they needed to be replaced. Digitally, it might look like paying for a month of your Adobe subscription to make sure you don't lose access to the program you need.\n\nWould this be appropriate? Also, any other ideas?\n\nEdit:\n\nTo quote my friend, \"don't you dare do it as a gift, you gotta come up with something.\"they want to help me because I'm helping them, the goal being to soften the blow of a net negative or break even. \n\nI'm not saying that your advice isn't good advice, I just don't appreciate the advice with the side helping of judgments towards my personal character. You guys are making a lot of assumptions about my behavior and expectations. It's a request, it's optional, asking for a favor for a favor. if they can't chip in, then they can't chip in! I would still make them the illustration regardless because they're my friend. This isn't an exchange of goods of services, it's not conditional like that. When I said I didn't want to profit, I meant it. Read the top of the post, favor for a favor. It's not a gift, and it's not a transactional(professional)exchange.\n\nThere's also an assumption going around that I'm going to make my friend pay for all the examples as though they were an itemized bill. NO! Of course not. \"Just in case they needed to be replaced,\" means I'm only asking them for help with tools I'm using for their illustration, and tools I expect that may soon run out.\n\nDigital painting program subscriptions are a limited, finite resource. You rent your canvas and tools for 30 days, and within that time you'll make a few paintings. If you pay $20, and you make five paintings, that's $4 per painting. I would see that the same as 30 sheets of paper. Of those 30 days, only a fraction of that is actually usable hours, so the resource is scarcer than you'd think. I'm not a professional artist, I'm a hobbyist, so I pay for the entire cost of that program up front. Saying that digital art costs me nothing to make is categorically false and using that your justification that I'm being unreasonable is not a valid argument.",
            "Q_score": 152,
            "Id": "12r6bvy",
            "Url": "https://www.reddit.com/r/Advice/comments/12r6bvy/if_a_friend_asked_me_for_a_small_art_favor_and_i/",
            "Aswer": "Yes, be up-front and tell them you'll work on the project, but they have to cover the supplies.",
            "A_score": 127
        },
        {
            "Question": "Hey all, Gen z kid here, I'm turning 18 later this year! Any tips on being an adult?\n",
            "Q_score": 76,
            "Id": "12rb9du",
            "Url": "https://www.reddit.com/r/Advice/comments/12rb9du/hey_all_gen_z_kid_here_im_turning_18_later_this/",
            "Aswer": "Don’t do it. Don’t grow up. 1/5 star rating\n- a bitter 24 yr old",
            "A_score": 174
        },
        {
            "Question": "Girlfriend broke up with me after I told her about my friend who passed\nMy buddy took his own life 3 days ago. Well I finally opened up to her about it yesterday. And she decided to block me on everything. Still have no idea why.",
            "Q_score": 38,
            "Id": "12rh99y",
            "Url": "https://www.reddit.com/r/Advice/comments/12rh99y/girlfriend_broke_up_with_me_after_i_told_her/",
            "Aswer": "Some people can't handle big emotions and would rather kick you when you're down.\n\nIt sucks, but at least you now know her true colours and won't waste any more time on her.",
            "A_score": 71
        },
        {
            "Question": "Need advice, I am faced with a slow death (without medical or professional help), How do i make the most of the last month's of life, living under terminal illness and suffering terribly?\nI am suffering from 5 \"rare and untreatable\" terminal illnesses, the worst two are heart and autonomic illness, both of wich have hit thier final stages. 100% mortality rate, Im suffering to the point of deciding if I should go my way or go the highway, (LOL!) by letting the illness run its final course.\n   \nAnyways, i don't care about that part, my problem is I'm out of good advice and old addages to help me through, knowing it'll  be ok, walk without fear and such.\n\nJust need some other serious voices with their advice and opinions of how to make the most of life and walk forward without fear",
            "Q_score": 196,
            "Id": "12r0fgw",
            "Url": "https://www.reddit.com/r/Advice/comments/12r0fgw/need_advice_i_am_faced_with_a_slow_death_without/",
            "Aswer": "If you have a terminal disease or 5 then you should qualify for hospice care when you are ready. Be sure to set that up. They can help manage your pain. \n\nI would get everything settled on paper with a lawyer and do what makes me happy as long as I was able. \n\nIs there any peace you want to make? Any place you want to be?",
            "A_score": 147
        },
        {
            "Question": "Best friend's (28F) wedding is the same day as my close friend's (28M) burial. Don't know what to do.\nHey everyone. Writing this as I'm traveling to my hometown to attend one of my best friend's wedding this weekend. A few hours ago, I heard news that one of my closest friends, who I met through gaming eight years ago, has passed away due to health complications. They are not in the same friendship circle but both know about each other.\n\nI'm part of the wedding entourage. And the location where the wake is taking place is in a different city, in a  small province, in a different island (no airport, no direct sea port from my town to theirs). It's physically impossible to attend both. \n\nFor context in order to travel between the wedding location and where wake will take place:\n-One hour bus from hometown to sea port\n-Boat from island A to island B (4hrs fastest)\n-Three-fours hours bus from port to the town\n\nIt's honestly tearing me apart.",
            "Q_score": 84,
            "Id": "12r1xtg",
            "Url": "https://www.reddit.com/r/Advice/comments/12r1xtg/best_friends_28f_wedding_is_the_same_day_as_my/",
            "Aswer": "Go to the wedding. It may be a harsh thing to say but your friend who has passed away will not be hurt by your absence. Funerals are for the survivors, to grieve. I'm sorry you will not be able to grieve at your friend's funeral. But you can visit his place of rest later and have your own time to say goodbye.",
            "A_score": 182
        },
        {
            "Question": "Girl who I'm supposed to go on a date said she has fungus\nWell, basically I have been talking to a girl for some weeks and we have been having a nice time talking to each other, but two days ago she said she had fungus . She said she got it because she used to play in dirty places or racetracks when she was a child or something like that and she needs to get her medication forever.\n\nShe said she takes or was taking Prednisone. Also, she said this fungus was spreading into her organs and she could die, but she survived. Something like that. I'm not sure. She said that the Prednisone and some ointment help her with the itching and some spots. Also, she said you can't infect others with fungus, but it seems that's not true. I'm not really sure of she's just ignorant or...\n\nWell, I'm nervous and feeling extremely insecure because she said she doesn't even remember the name of the fungus and blahblahblah. \n\nPlease help. 😳",
            "Q_score": 657,
            "Id": "12qdrer",
            "Url": "https://www.reddit.com/r/Advice/comments/12qdrer/girl_who_im_supposed_to_go_on_a_date_said_she_has/",
            "Aswer": "If she’s had since she was a child and has to take it forever you would know the name of it, maybe she’s lying😭",
            "A_score": 1224
        },
        {
            "Question": "Ghosting someone who only wants sex\nI 23F am thinking about ghosting 25M because all he ever asks for from me is sex. Background on me is that I already have two kids under 3, and I have been trying to work things out with my children’s dad (both have same dad.) I think it would be irresponsible to be out here having sex and potentially creating another life with a different person that I don’t even like. Plus he keeps saying he wants to meet my children but only AFTER we have sex first. I think this is a major red flag, but he’s been trying to tell me that it isn’t all about sex. However his actions show me that it is. What would you do?",
            "Q_score": 102,
            "Id": "12qt7bo",
            "Url": "https://www.reddit.com/r/Advice/comments/12qt7bo/ghosting_someone_who_only_wants_sex/",
            "Aswer": "> I think it would be irresponsible to be out here having sex and potentially creating another life with a different person that I don’t even like.\n\nWhy are you dating someone you \"don't even like\"? Break up with him. Just let him know you aren't feeling it. No need to ghost.",
            "A_score": 170
        },
        {
            "Question": "Should I tell my mum about my grandfather touching my thighs?\nBasically, whenever I got to my grandparents house, my grandfather starts talking to me and while he does that, he puts his hand on my thighs. It makes me VERY uncomfortable but I can't really tell him because it would make everything really awkward. I told a friend about it and they suggested that I tell my mother about it. I don't really know if I should because it could make things in my family very awkward, considering that my grandfather has always been there for me when I needed him. This has been happening for years and every time I just feel really bad. \nEdit: I'm currently 15 and my grandfather is abt 70",
            "Q_score": 88,
            "Id": "12quzey",
            "Url": "https://www.reddit.com/r/Advice/comments/12quzey/should_i_tell_my_mum_about_my_grandfather/",
            "Aswer": "You could try telling your grandpa first, in a very subtle manner. Or maybe just move away to prevent him touching / act subtly but clear that you are sensitive and you don't like being touched.  I don't think these would ruin your relationship with your grandpa  *given*  he has no bad intention.     \n\nIf he does, well,  maybe you shouldn't consider your relationship with him anymore and have a talk with your mom first.",
            "A_score": 91
        },
        {
            "Question": "How do I tell someone I’m not interested without hurting their feeing?\nOk so their is this girl. She is a regular customer where I work and every time she comes in she says something about when am I going to ask her out. I’m personally not mentally healthy enough to be in a relationship. I’ve tried hinting to her that I’m not interested but today she gave me her number so I guess she didn’t get the hint. Am I going to have to make it obvious that I’m not interested.\nAs a guy I’m more used to getting rejected then having to reject someone so I  don’t know how to do it. Any advice would be appreciated",
            "Q_score": 24,
            "Id": "12r78x9",
            "Url": "https://www.reddit.com/r/Advice/comments/12r78x9/how_do_i_tell_someone_im_not_interested_without/",
            "Aswer": "You can let her down easy by saying you're flattered, but you like someone else.",
            "A_score": 31
        },
        {
            "Question": "How can i force myself to wake up in the morning?\nI have an early class, and that means i have to wake up 6:50. But despite many attempts such as putting my alarm in another room to force myself to go turn it off, i always find myself giving excuses to go back to bed. It getting out of hand lately as it has been happening almost every day. Any advice?",
            "Q_score": 81,
            "Id": "12qr3d4",
            "Url": "https://www.reddit.com/r/Advice/comments/12qr3d4/how_can_i_force_myself_to_wake_up_in_the_morning/",
            "Aswer": "Dude there is no magic here. Your body is tired. Go to bed earlier.",
            "A_score": 165
        },
        {
            "Question": "My teenage son (15) is sexually active and I don’t want him to be\nToday I (42M) found out my son (15M) had unprotected sex with a female friend. It was consensual but apparently she told her parents for whatever reason and they called the school who called me.\n\nI’m kind of in shock. I was going to give him the talk when he turned 16. I’m a single dad so I always shy away from these things because I don’t know how to fill the role of a mother as well, I don’t know what’s appropriate to discuss with him or not, etc. He’s locked himself in his room and won’t talk to me and I know that when he does this, even if I broke the door down and threatened every privilege he wouldn’t talk. So I’m waiting for him to come out on his own because I don’t want to force him. I can tell he’s embarrassed and I am too, for him.\n\nI know all of the comments are going to tell me to give him the talk and give him condoms or something but he’s so young! He’s 15! I don’t want him to be having sex at all. I know I’m going to get comments that I can’t control him and that I’d be restricting his sexual freedom but he. is. 15. I didn’t even have my first KISS until 17. Of course I’d rather he be having safe sex than unsafe sex but I’d feel so so weird giving my 15 year old son condoms.\n\nI know I can’t just constantly watch over him and it scares me. He’s too young to know this stuff and handle it reasonably. I just don’t know what to do. I can’t outright prevent him from doing anything. I’ve seen people on here tell parents their younger teens having sex was fine as long as it was safe, so am I just crazy for thinking that that’s way too young?\n\nI don’t know what to say to him. I’m probably gonna bomb it. I’m not good at this stuff. I hope he won’t hate me after.",
            "Q_score": 27,
            "Id": "12r0zy4",
            "Url": "https://www.reddit.com/r/Advice/comments/12r0zy4/my_teenage_son_15_is_sexually_active_and_i_dont/",
            "Aswer": ">  Of course I’d rather he be having safe sex than unsafe sex but I’d feel so so weird giving my 15 year old son condoms.\n\nThat's really all that matters here, in my opinion. You can try to stop him all you want, but if you punish him for having sex then he will likely find a way to do it any way and additionally will take steps to hide it.",
            "A_score": 73
        },
        {
            "Question": "Ex (22F) reached out after a year of leaving me (25M). I don’t know how to feel or where to start.\nBasically, I dated this girl for about 8 months. I cared about her deeply, she meant the world to me, we had been friends since I was 18. I was head over heels for this girl and she just left me one day, saying she wasn’t ready to settle and wanted to explore more life as an individual but that she loved me deeply and would be down to try things again in the future. I said I wasn’t interested and went no contact. \n\nShe broke my heart when she did this. She was going on dates with some guy I know a week later and I saw her kissing some other guy a month later at a restaurant (small town). I cried, spent every day in the gym, focused on myself, found new hobbies and friends and eventually became at peace with the whole thing, but it was one of the most difficult things I’ve had to experience.\n\n\nShe texted me 2 days ago saying she can’t stop thinking and dreaming about me, exactly a year after the day she ended things between us. I asked why she’s reaching out and she said she’s depressed and suicidal because her life isn’t going according to plan and she keeps dreaming and thinking about me. I told her I was finally happy and at peace. I don’t know what to do. I still love and care for her deeply, i think about her all the time, I wish she never would’ve left. But it’s too late now. She’s a year too late. She left me, and I don’t know if it’s wrong of me to feel this way. She technically didn’t do anything wrong. I still love her, I don’t know. Do I talk to her? Do I just keep moving on? She destroyed me and I barely feel recovered.",
            "Q_score": 68,
            "Id": "12qgymg",
            "Url": "https://www.reddit.com/r/Advice/comments/12qgymg/ex_22f_reached_out_after_a_year_of_leaving_me_25m/",
            "Aswer": "So you are telling me she left you to follow her dreams, and then when things blew up in her face THAT'S WHEN she remembered you exist and came crawling back because she needs someone to help her back up.\n\nNo. Don't you dare take her back. You didn't spend a year struggling just to take back someone who came back to you only because their plan A didn't work out.",
            "A_score": 168
        },
        {
            "Question": "I have adhd and autism yet my dad wont believe it even with test results, he always reads random stuff like \"too much screen time causes symptoms of adhd\" which annoys me. Anyone have something to say back?\n",
            "Q_score": 30,
            "Id": "12qnfnb",
            "Url": "https://www.reddit.com/r/Advice/comments/12qnfnb/i_have_adhd_and_autism_yet_my_dad_wont_believe_it/",
            "Aswer": "You can't argue with people who decide things with bad information.\n\nBeing annoyed is a choice.  Stop engaging with him on the topic.",
            "A_score": 32
        },
        {
            "Question": "I lost family and a whole friend group when they took the side of my ex stalking me and I can't get over it, nobody has reached out to me, they didn't believe me\nmy ex was stalking me, befriending everyone I knew, going everywhere I was, joining every discord server, playing every game\n\nhe joined my family's discord and got to know everyone. my family didn't listen to me twice that he was making me uncomfortable and stalking me.\n\nI left the server, and haven't talked to my family since. nobody has reached out to see how I am. \n\nI feel like none of them cared about me. he's still there, hanging out with them every day.\n\nthey didn't believe me\n\nspeaking out does nothing. he stalked me, pressured me for nudes, controlled everything I did, was verbally bad to me and befriended everyone I knew to control me .\n\nI can't get over it, I don't know what to do",
            "Q_score": 131,
            "Id": "12q2ogh",
            "Url": "https://www.reddit.com/r/Advice/comments/12q2ogh/i_lost_family_and_a_whole_friend_group_when_they/",
            "Aswer": "I think it would be a good idea for you to reach out to your family and let them know what exactly happened between the two of you. They may like the person that he is showing them, but that is not who he truly is. You may have to pull the wool from their eyes so they can see who he truly is.",
            "A_score": 76
        },
        {
            "Question": "I might get fired. What do I do?\nI'm on the edge of the seat right now and I don't really know what to do. Recently I missed a few deadlines (2 I think) and today I got an ominous e-mail from my boss which just had the subject \"Talk\" and a date and time. This got me thinking. Will I get fired? I know this could be anything and the most likely thing will be that he'll talk to me about the missed deadlines and why. I can give a reason as to why. I always get hung up about the small things and then go down a rabbit hole instead of trying to fix it from another point of view (this has to change, I know). I also get distracted pretty easily and I sometimes have task paralysis (when the task is really stressful I just stop functioning for a while and I don't know why. I honestly suspect it's ADHD).\n\nWhat do I do now?\n\nEdit: Wording",
            "Q_score": 27,
            "Id": "12qfw9m",
            "Url": "https://www.reddit.com/r/Advice/comments/12qfw9m/i_might_get_fired_what_do_i_do/",
            "Aswer": "Email your boss back and ask for the general topic of discussion (say it's in case you need any data/slides etc.) for the discussion. Either your boss will tell you what it's about (setting your mind at rest) or you'll look proactive, which can only be good!",
            "A_score": 60
        },
        {
            "Question": "I just found out my “friends” made a different group chat\nWe have a gc called the four lokos. They basically stopped talking in the one we had and today one of my “friends” was helping me with a problem when I noticed a notification from her phone from a group titled hozier fan club. The thing is we were all supposed to go see hozier but idk what happened with that all I Know is I’ve apparently been excluded. \n(Background):\nMy roomate who is one of the people from the gc started acting weird recently. Usually we’ll talk but recently she only talks to me when it’s convenient for her but when I try to start convos her tone makes it seem like I’m bothering her. I decided that I would just stop trying to talk since it’s apparently bothering her.\n\nHow should I proceed with this new info? Should I ask about it or just block them all",
            "Q_score": 251,
            "Id": "12pnr47",
            "Url": "https://www.reddit.com/r/Advice/comments/12pnr47/i_just_found_out_my_friends_made_a_different/",
            "Aswer": "I'd only confront them if you feel like you'd get something positive from it. If not, just ghost them and move on with your life.",
            "A_score": 325
        },
        {
            "Question": "My bf\nSo like my bf and I have been together for over a year and we both enjoy playing games. The issue is, we like to play the same games but he’d rather play them with his friends and always refuses to play with me. We’ve talked about several times and his answer is, I just don’t like playing games with you. Is this a big concern?\n\n\nUPDATE: we talked it out and it kinda ended with him saying he doesn’t like to do a lot of things that I do and that I don’t notice how hard he’s trying in the relationship",
            "Q_score": 23,
            "Id": "12qbda2",
            "Url": "https://www.reddit.com/r/Advice/comments/12qbda2/my_bf/",
            "Aswer": "nope. either he feels awkward playing with you or he thinks your bad at the game and doesn't wanna play. admittedly a little annoying but not a big concern. do other stuff together with him",
            "A_score": 49
        },
        {
            "Question": "A girl who I thought wasn’t a sex worker texted me asking for money after we had sex - what should I do?\nSo I met this girl in Central America - she seemed super sweet and we really clicked. No sign of her being a sex worker - we texted back and forth for a day and a half after meeting, with nothing sexual.\n\nThen I see her again last night, and I get a hotel room for us to have sex. We have it, and after that we go our own ways cause I’m leaving town since I was just there on vacation.\n\n\nThen I wake up the next morning, and she texts “for sex $200”. I feel she’s trying to scam me but I’m not sure if I should pay. For now I blocked her but not sure what should I do? What are the repercussions if I block and don’t pay?",
            "Q_score": 516,
            "Id": "12pa60a",
            "Url": "https://www.reddit.com/r/Advice/comments/12pa60a/a_girl_who_i_thought_wasnt_a_sex_worker_texted_me/",
            "Aswer": "Reply saying \"That's very kind ,thanks\" And then send her a request for $200 from her account :)",
            "A_score": 1606
        },
        {
            "Question": "I told my husband “no” to getting a second dog and want to make it up to him somehow.\nMy husband wanted a 2nd dog but I told him no because I’m 4 months pregnant. I didn’t think the timing was right and I broke his heart. I made the mistake of not saying something sooner so he was really, REALLY excited about getting this dog. Yesterday I had to firmly tell him no and he’s been understandably upset. I want to do or get him something that could help show him I still care about his happiness. Any ideas?",
            "Q_score": 112,
            "Id": "12pq6ht",
            "Url": "https://www.reddit.com/r/Advice/comments/12pq6ht/i_told_my_husband_no_to_getting_a_second_dog_and/",
            "Aswer": "Is it your first baby? Congrats! Your husband will thank you in a few months time, you've made the right decision.",
            "A_score": 222
        },
        {
            "Question": "Went to Bachelorette party where the AirBnB was covered; but got venmoed for $350 for other expenses by the MOH. Help!\nHi. I just went to a bachelorette party where I knew the airBnB would be covered by the brides mom. The maid of Honor (MOH) organized the trip, where we would go to dinner, and rented a car for us to drive to a hike. She also picked up some food for snacks over the weekend and one dinner.\n\nBackground: I just graduated from grad school and got a job (yay) but it doesn’t pay amazing and I am still by no means rich. \n\nWe went to very nice dinners when we were there but I figured, hey since I wasn’t paying for the Airbnb I would be ok. \n\nSo when I got a venmo request for $350 I was a little stunned. It was for the rental car, gas, food + alcohol, and a $70/day pool heating fee I didn’t know I would be on the hook for. If I knew about it I would have told her i wouldn’t pay for it. Also she charged us for the decorations she put up. \n\nAlso We ended up leaving over half the snacks and liquor she bought in the Airbnb and a steak we didn’t cook. Also I’m a pescatarian so I didn’t eat any of the steak she did cook!!\n\nI am going to pay what she asks I think and I learned a HUGE lesson about asking about costs up front. That is my main takeaway from this. \n\n\nMy main ask for advice is if I should say anything to her? Is it worth asking to not pay for the steak at the very least? Not to mention the pool heating fee and rental car stuff. Will that make more problems later on down the line? \n\nI want to talk to the bride about it but I idk if that is a good idea either… \n\nAny advice is welcome on what I should do next. \n\nThanks\n\nEdit:\n\nApparently I did not make this clear but this is NOT including the dinners + lunches we went to which were VERY fancy ($88 one night for me + $114 the other night. Including me helping pay for bride)\n\nSo for rental car + gas + Airbnb pool+ decorations + groceries for 2.5 days she is saying she spent $1400. Which she is splitting amongst 4 of us.",
            "Q_score": 25,
            "Id": "12q5nd3",
            "Url": "https://www.reddit.com/r/Advice/comments/12q5nd3/went_to_bachelorette_party_where_the_airbnb_was/",
            "Aswer": "Nah. She should’ve mentioned and discussed this with you prior. If you genuinely can’t afford it then ask about removing the steaks you didn’t eat. I personally would pay it but I think it’s hella tacky the way she went about this. I’ve been a MOH 3 times and at no point have I been even slightly unclear about costs. Everything is arranged according to everyone’s budget and I collected money upfront. People that didn’t pay, couldn’t come. And when someone couldn’t pay. The price went up for everyone else. And I was very very clear about that every step of the way. Next time, make sure they know if they want money from you, they need to figure out how much and by when. They can’t just go on a Willy Nilly spending spree and send you the bill.",
            "A_score": 37
        },
        {
            "Question": "[tw sa] it just keeps happening\nMy life is so fucked rn I’m 15 and pregnant from sa and it’s far from the first attack I had to endure. It happened when I was 6, 9, 10 and 13 all by different men. I don’t understand why the world hates me so much, I don’t dress in revealing clothes, I always have pepper spray on me and I rarely go out alone and yet it still happens. This time I had to sleep at a friends house because my parents were fighting and I slept on an air mattress in his living room. I woke up to that “friend” on top of me and I was too scared to move or scream. A few weeks later I was feeling sick and had a bad feeling about it so I took a test and it was positive. I don’t know what to do, I’ve gone to the police every time in the past and it only resulted in the 3rd guy getting arrested. The court process is very emotionally hard for me and I don’t think I have the strength to do it a 5th time. We live in Texas so an abortion won’t be easy to get and I’m scared to give birth. How can I help this situation and stop myself from being attacked like this in the future",
            "Q_score": 269,
            "Id": "12paedt",
            "Url": "https://www.reddit.com/r/Advice/comments/12paedt/tw_sa_it_just_keeps_happening/",
            "Aswer": "Oh hun, you’ve lived so many lifetimes already. I can’t speak on elective termination because I don’t have any experience with it. I can speak on being a recurring victim of SA. First, it’s not your fault. And as a child it was not your job to keep yourself safe. Read that again: it was not your job to keep yourself safe. \n\nOften, and certainly in my case all the women in my family had been SAd as children. So with each generation we were not able to seek information, learn, and change anything  Until my mother. As an adult she started going to therapy and changed the trajectory of every woman in our family. It is because of all the things she learned that when my own teenagers go out for the evening I know they will most likely be able to save themselves. \n\nYou have the ability to be the chain breaker. \n\nBut that is for the future you. The now you needs some help. It’s time to tell your parents.  They are your best chance for literally surviving this. It won’t be easy, whatever comes next. But I know you can do it.",
            "A_score": 242
        },
        {
            "Question": "I'm 15. I have a job, but I'm not saving for anything in particular yet. Might save for a car when I turn 16. Is it a waste of my money to spend it on things that don't benefit me in the long run, like video games?\n",
            "Q_score": 644,
            "Id": "12ot3me",
            "Url": "https://www.reddit.com/r/Advice/comments/12ot3me/im_15_i_have_a_job_but_im_not_saving_for_anything/",
            "Aswer": "You're 15 and the world isn't getting much better. Enjoy all the little things while you can. It's not a waste if it brings you joy.",
            "A_score": 1657
        },
        {
            "Question": "Is it normal to pay to go to a wedding and if so, how much is too much?\nMy family member is having a wedding and invitations are 175$ per guest. She is also taking cash gifts. I have never gone to a wedding before where you have to pay. Is 175$ too much or is that a usual average?",
            "Q_score": 307,
            "Id": "12ovy58",
            "Url": "https://www.reddit.com/r/Advice/comments/12ovy58/is_it_normal_to_pay_to_go_to_a_wedding_and_if_so/",
            "Aswer": "No one should be charged to attend a wedding. That's incredibly tacky. I would decline the invitation and send them a Congratulations card.",
            "A_score": 914
        },
        {
            "Question": "I love my boyfriend but I just can't afford to help him with money anymore. I am a student myself with college loans to pay. I don't know how to bring this up with him. Should I break up?\nFirst, some context: We are both college students in India. Here it's uncommon for students to work part time. No one in our college does.  Our parents give us allowances till we start earning on our own. It's completely normal and we will do the same for our children. \n\nThe thing is, I come from a financially comfortable family. He.... doesn't. \n\nI get my fixed amount of  allowance at the start of every month, positively. His family sends him money when they can, not even a fixed amount. \n\nSo most of the time, he's completely broke. \n\nSo I'm the one who pays for his coffee, his lunch, our dates.. everyday I'm spending money for the both of us. He does \"try\" to pay me back when he gets his allowance.. but his allowance is just too less. \n\nToday, on his birthday, our friend circle went out for dinner. Since it was his birthday, the dinner was supposed to be on him. It is the way things work here. But since he had no money, ofcourse, I had to send him money for the dinner. It was pretty expensive. \n\nAnd now I have no money for the rest of the month. \n\nI have not been able to save up any money at all, eversince we started dating. If anything, I end up spending money from my savings. I have had to lie to my parents about my expenses to accomodate his. I can't even afford my own requirements now.\n\nIt is not his fault that he is poor. He always makes it clear that he has no money when I suggest going out. But... I like watching movies, eating out etc. I end up telling him that its going to be on me, because I want to go on a date so bad... and then I have to pay for both of us and I regret it later on. \n\nI also spend small amounts of money on him everyday for lunch and coffee and such... and it's just too much now. I don't know how to deal with this.\n\nI am considering breaking up. But I love him so much. \n\nWhat do I do? \n\ntl;dr: i am broke because i am carrying my bf's expenses on top of mine, and i am considering breaking up with him. But I feel horrible that I want to break up with him only because he is poor.",
            "Q_score": 23,
            "Id": "12pgatt",
            "Url": "https://www.reddit.com/r/Advice/comments/12pgatt/i_love_my_boyfriend_but_i_just_cant_afford_to/",
            "Aswer": "Is he dating you for your money, or for you? \n\nIf you break up with him, he will not have your money and he won't have you.\n\nIf you tell him you can't afford to pay for him, he will still have you.\n\nYou know him best. What is he dating you for?",
            "A_score": 20
        },
        {
            "Question": "My best friend wants NSFW pictures, what do I do?\nI (16F) have known my best friend (16M) for 7 years and we are really close. Recently, he's been hinting at his sexual attraction toward me. He tries to grope me, constantly asks for nudes/revealing pictures and won't relent. I don't want to block him because he means a lot to me, and I can't lose him on top of everything I've lost over the past 3 years. What do I do?\n\nedit: thank you guys for all your support and advice, I didn't realize people would actually respond. he was being too aggressive so I blocked him. thank you for getting me out of this situation :)",
            "Q_score": 26,
            "Id": "12pbpw8",
            "Url": "https://www.reddit.com/r/Advice/comments/12pbpw8/my_best_friend_wants_nsfw_pictures_what_do_i_do/",
            "Aswer": "If he doesn't respect your boundaries, he is not your friend. Don't send him pictures.",
            "A_score": 70
        },
        {
            "Question": "“Are you his mom or his girlfriend?”\nGirl. So my boyfriend (24M) and I (24F) walking downtown after dinner and are randomly stopped by a man who asks my boyfriend, “is that your mom or your girlfriend?” We were both like, what? No response, just walked away. But it’s HAUNTING ME. Bf says i dont look old. I dont think so either. Was he trolling us or is this some joke I know nothing about?? I can’t get it out of my head. Does anyone know what he might have implied or if he was just being rude?",
            "Q_score": 108,
            "Id": "12owz20",
            "Url": "https://www.reddit.com/r/Advice/comments/12owz20/are_you_his_mom_or_his_girlfriend/",
            "Aswer": "He was being an asshole. That's literally all this was.",
            "A_score": 318
        }
    ]
}