{
    "Posts": [
        {
            "Question": "Is it normal to be attracted to masculine women?\nGuys I don't know if this is normal. I'm definitely a straight male. I have no attraction whatsoever to men. But women who are somewhat muscular and have short hair really seem attractive to me for some reason. Even better if I feel like they might stand up for me or protect me.\n\nWhat does this mean? Does this make me less of a man?",
            "Q_score": 131,
            "Id": "11lk8b9",
            "Url": "https://www.reddit.com/r/Advice/comments/11lk8b9/is_it_normal_to_be_attracted_to_masculine_women/",
            "Aswer": "Attracted to women, somehow thinks that's gay. Just... think about it for a second lol",
            "A_score": 340
        },
        {
            "Question": "Little sister took over 60 of my multivitamin gummies. I’m scared to tell my parents.\nI was watching two of my non-verbal autistic siblings like I do everyday and everything was fine until I went in my room for a bit to go on my computer . I have my computer to where I can see my door in case my sister walks out her room. I do this because she steals everything and either rips it or puts it in her mouth so she has to be monitored 24/7\n\nI guess I didn’t see her take my men’s multivitamin case but when I checked on her later there she was eating two of them. I had her spit it out and I took the case and quickly counted how many were left. In total there’s 150 gummies, I had taken 10 so far and when I counted there was 76 left meaning she supposedly ate 64 gummies because I couldn’t find any in the room, Your suppose to take 2 a day. \n\nI don’t understand how she opened it because it’s child locked but she did and I’m freaking out because my parents will kill me if I tell them. She’s overweight and the multivitamins are for men but she seems fine and normal, it’s been an hour already. I don’t know if I should tell them because everything seems fine. What do I do?\n\nUPDATE: I called poison control and they said she should be fine since their gummies but to just give her lots of water.",
            "Q_score": 543,
            "Id": "11l6l4a",
            "Url": "https://www.reddit.com/r/Advice/comments/11l6l4a/little_sister_took_over_60_of_my_multivitamin/",
            "Aswer": "Seconding calling a poison control hotline to confirm if this is an issue or not.\n\nEven if she'll be fine, let your parents know. They may not be aware that she can get through childproof packaging and eat things that she shouldn't.",
            "A_score": 636
        },
        {
            "Question": "27M my girlfriend is leaving me because I don't have money\nBasically I'm 27m unemployed for 3 years and I cant find a job, I liked this girl and we started dating, I didn't wanna feel small to her so I'd usually spend money from my savings on dinners and gifts etc, now Im literally broke so when we hang I take her to cheap places or the park or just a car ride and yesterday she got upset when I said I don't have money to go to the movies and said \" you're the man you should be able to take care of me \". It honestly broke me to pieces and almost cried and idk what to do, I'm an engineer but I am having an extremely hard time finding any job even one not related to my field, my bank balance is 0 and all the cash I got is around 40$\n\nWhat do I do?",
            "Q_score": 26,
            "Id": "11ls1cg",
            "Url": "https://www.reddit.com/r/Advice/comments/11ls1cg/27m_my_girlfriend_is_leaving_me_because_i_dont/",
            "Aswer": "You need to worry less about dating and more about the fact that you have no money to support yourself.",
            "A_score": 114
        },
        {
            "Question": "Confused about my sexuality and in the process of losing the one person I was ever comfortable with.\nI'm having trouble finding a subreddit this fits in, but am desperate to send it off somewhere!  It just mysteriously never showed up on the other ones I've tried, so I wonder if the mods just quietly deleted it, or never let it through.  I hope this is okay to post here.\n\nI don’t know what I hope to get out of this post.  Maybe advice, or information that seems relevant to any of it, or just your own stories if you’ve been through anything like this or find any of my problems relatable.  I want to know it isn’t just me. There’s a lot to unpack here, and I don’t know how to organize it all, so here we go! It’s going to be incredibly hard to follow, and I’m sorry for that.\n\n---\n\nI seem to be broken.  The hardware is all there, but the software was never installed,  Maybe the software is in there, but too buggy to work.  I don’t know.  All I know is I’m 25 and have never had sex, and don’t really have desire to.  I mean… I want to try, now, sort of, but haven’t always.  I want someone to appreciate my body.  I wish I had let someone appreciate it when it was younger and stronger and tighter.  I age, and lose my opportunity to explore, to be desired.  I am not religious; it is not that Catholic Shame that prevents me from sex.  It just horrifies and disgusts me.  I evolved for multiplying, and the sex that is a necessity for it.  Sexuality is a big part of being a mammal, of being a human.  Why why why do I lack it?  I can enjoy looking at a man, generally don’t enjoy looking at women the same way, and tend to be more comfortable when the view excludes the genitals.\n\nMy external sex organs feel uncomfortable and creep me out a bit, but not as bad as they used to.  I have not been a victim of sexual abuse.  I am not transgender.  I feel like a woman, and would be unhappy with a penis.  (Any ideas what could be up with me here?)  Physically and mentally, I am a woman; however recently I have come to wonder if it is possible to be psychologically one gender but *socially* the other, if that makes sense.  The way a man treats a male friend is very different than a woman treats a woman, a woman treats a man, or a man treats a woman.  There is a specific kind of friendship and interaction I have only ever observed between men, and it saddens me that it is unlikely I will ever fully experience that type of bond.\n\nBesides this lack of sex drive and such, I am not much of a people person.  I have my one good friend, and that was all I needed, but I’m losing him through no intention of either of us.  I have made a few work friends, even having gone to parties with some and out to a restaurant for drinks with another, but find it hard to be with people.\n\n---\n\nWe were originally “pen-pals” (keyboard pals).  I was in university and heavily struggling.  It turns out I had some wild anemia that should have left me completely incapable (but somehow didn’t quite) and some fucky hormones that were making it hard to function, but I didn’t get those answers when I needed them.  I felt very overwhelmed and alone, ended up on a penpal-finding site, and he messaged me.  At first, I was annoyed by his comment that he, too, knew how it felt, to feel like one was getting left behind in a world that was moving on too fast, but kept that thought to myself and kept the conversation going.  Turns out, he really did know, better than I.\n\nWe became great friends.  We could tell each other anything.  I learned he was ill, lost most his friends because of it (when he couldn’t party, the partiers left; when he couldn’t work, those relationships dissolved; when he couldn’t play cricket, his teammates were no longer teammates).  He left home at 17 to escape an abusive alcoholic father, worked so hard on his education, got his degree, and I imagine life was finally becoming okay.  He only got to work a few years at the career he fought for before he became ill, and eventually couldn’t physically perform regardless of how hard he pushed.  He and I found each other and became pen-pals a few years later, at which point he was mobile within his home and usually managed to get outside a little bit once every few days.\n\nHe was (is?) fun and upbeat, charismatic, witty.  I was surprised to eventually learn that he had gone through some sexual and emotional abuse/trauma that left him with body dysmorphia, feeling worthless and unlovable, on-and-off suicidal with several botched attempts.  Even before this came out, we were very close, and it made me more comfortable with being open about my own struggles with the idea of sex.  Our problems here were very different, but somehow also very much the same.\n\nYears of phone calls and photos and daily text-chats went by.  He’d often express his regret that I wasn’t from somewhere closer (“shame you’re not local”); we’d talk about how nice it would be if I could just pop in for a cup of tea and a visit, sometimes.  We’d discussed the possibility of me coming to meet him, someday.  Perhaps that amount of long-distance communication is odd and unhealthy.  What do you think?  Can someone really be friends with a person they’ve never met?  Were we too co-dependent?  \n\nAnyway… a couple years went by, and I ended up going traveling through a few countries that were close together.  At the last country, I ended up on his doorstep.  He didn’t know I was coming, and I had found a few accommodations (hostels and campgrounds) nearby that I’d intended to check out and check into one of once I arrived.  I thought he’d probably chat with me on his doorstep, and if things went well I would come back and spend more time with him other days.  To my surprise, this beautiful, generous, vulnerable human who had no idea I was coming *trusted* me, opened up his little home to me, and made it clear that I was welcome to anything in it.  Though he is just renting one room in the house, I ended up there at a point where 3 others had just left and a fourth was in the process of moving out and no longer lived there, so we had privacy and the run of the house.\n\nWe watched movies together and played a board game he ordered.  We sat around and drank tea and listened to music and chatted and were our odd selves.  I had recently joined a cricket team in my home country, and he helped me practice his sport a bit outside.  He wanted to make sure I explored and did some touristy things, and would find me maps and send me off on adventures he couldn’t follow on.  As I walked out the door, he’d be grabbing me my the backpack to stuff in snacks and juice and the like.  He told me what foods I should try and where to get them, and once when I got home from a hike, I found he had made me a big pot of pasta.  I know that took a good bit of effort with his limited energy.  I felt so cared about.  I loved so well, and was so well-loved.  But, of course, I had to go back to my own country.  Those were a happy 10 days that I’ve been chasing ever since.\n\nWe continued chatting via text and phone call, sharing photos and videos.  A few months later, we planned for me to return the next summer.  We thought I might get a YM Visa down the road, so I could live and work out there for a couple years, but I’m getting older and trying to start a career, and am only eligible for that visa until I am 30, and I can’t see this being a possibility in the next few years, so I guess that’s that, then.  Yet another thing the pandemic ripped from me.\n\n After I left that first time, I kept becoming even fonder of him.  I loved him; I knew that for a long time.  He felt like a cool older brother, sort of, and I loved him that way.  But also I was discovering it was a versatile kind of love.  I *could* love him like a sibling.  I could love him as if he were my son, and I were ferociously maternally protective.  I could love him as a friend.  I felt a sort of attraction I’d never felt, before, too.  I could love him romantically, if I so chose.  So I did, and once I spilled my guts out to him, he eventually came around to the idea as well.  I didn’t push him; he just grew into the idea on his own.  We we became even closer, in this strange new way.  Eventually, I felt willing –– excited, even –– to try to explore some physical intimacy and sexuality with him.\n\nThe pandemic started getting attention a couple weeks before my flight would have left, and he urged me to cancel my ticket and try again when it was sorted out and safer in a few weeks.  Boy, if we knew then what we know now…\n\nIt’s been 4 years since I’ve seen him.  He’s gotten gradually sicker the whole time, which was somewhat expected.  Most days he’s not really well enough to chat back-and-forth, but will still text me to let me know he’s okay.  On lucid/focused/better (never “good”) days we chat and I see his old self peek out from time to time.  He is vaccinated, but caught COVID a while back, which also did not help things. I thought that post-covid would be a good time to slip in a visit, during the window which he had the antibodies from fighting off the infection and would be protected by both the vaccine and natural immunity.  He said he was too sick to visit (I think he’s self-conscious about his situation; things must be unravelling over there) and too scared, and I watched that little window where I could visit without putting him in danger slowly close.\n\nI know I won’t see him again, now.  I’ve tried to come to terms with that for the last few years, but keep finding myself picking up scraps of hope.  I wish I could move on.  I’ve tried.  I have a hard time finding people I can make connections with, and he was one of the precious few.  I don’t know if I’ll ever experience a romantic connection again.  I don’t know if I’ll ever feel ready to explore intimacy again.  I don’t want to die a virgin, but I can’t bring myself to even consider touching anyone else, yet.  Maybe the right person will come along, and be patient enough to stand by me for years as a friend, until I feel safe and secure and emotionally connected/intimate enough to try.\n\nI just can’t stop thinking of all those little pockets of happiness we’ve had, and all the happiness I never got the chance to have.  I imagined getting home from work and crawling into bed behind him, or making dinner while he kept me company.  I thought about the movies and music I wanted to share with him, all the cups of tea I wanted to drink with him.  I think about wanting to wake up to that bright face and its absurdly mobile eyebrows (he emotes with these in the most adorable, exaggerated way, lol), that beautifully rough voice and its prickly accent.  I never met his mum, but we sort-of interacted, and we somewhat communicated through him.  Early on, when we were just starting to get close as keyboard-pals, I guess he told his mum and sister about me.  They asked about me a few times over the year, and supposedly expressed fondness.  I’ve asked about them some, too, and get the impression that I would get along with his little family very well.  As creepy as I’m sure this is, I looked forward to meeting them, and am sad I will not.  I always thought I’d bring his Mum a little pot of zinnias to first meet her, and we’d probably end up drinking tea and talking about bits and bobs and…\n\nanyway, I’m rambling.  It’s just a weird thing.  I always knew this relationship was a long shot and could never actually last, but I wanted to steal a few more happy moments in this life, and thought I could help supply some better moments to him, too, and it’s hard watching that opportunity become an impossibility and not knowing whether I will ever feel such a connection again, or if I even want to feel such a connection with someone else.  I know this whole thing has been absolutely absurd from the beginning, but kind of wonderful, too.\n\n---\n\nWas this relationship always unhealthy?  Was it weird?  How do I get over it?  How do I move on?\n\nAny idea what's up with my sexuality?  What can I do about that?  I don't want my broken sexuality.  I want to be able to explore.\n\nWhat about my thought of being \"socially male\"?  Any idea what that might be?  Is there a term for it?",
            "Q_score": 30,
            "Id": "11lrkeh",
            "Url": "https://www.reddit.com/r/Advice/comments/11lrkeh/confused_about_my_sexuality_and_in_the_process_of/",
            "Aswer": "1. This sounds like a good relation where two people with similar, but not exactly the same issues support each other. Without toxicity. That is rare. \n\n2. Regarding your sexuality, maybe lurk on the r/asexual and r/asexuality sub.  You may be demisexual or graysexual. Or asexual. \n\n3. This can happen if you want a relationship where you are not wanted for your body or for sex. This may stem from number 2. \n\nI hope you two can keep on supporting each other. It seems that you have a special friendship.",
            "A_score": 6
        },
        {
            "Question": "[F 21] Dad stole $4200 from me to \"make a point\"\nOur bank is Navy Federal, and he's the veteran, so unfortunately, he's the sponsor who oversees my bank account.\n\nI had gotten 5000$ as a refund for not living on campus anymore. I live at home bc it's cheaper and because it's only 30 minutes away.\n\nI did spend money on small things, like lunch or dinner, bc I don't have a meal plan at college anymore.\n\nMy parents got pissed that I wasn't home by 9 pm last night due to a literary magazine meeting that ended at 9:30. Normally my curfew is 10. \n\nAs a result, my dad took $4200 out of my account, left me with no money in my checkings, and left me with only $600 dollars in savings. Keep in mind that I have to pay for college next semester, so that's not going to work at all. \n\nI have a job that pays $11.75 per hour, and I live in AL, so that's not bad ig. The thing is, I planned on not only paying for next sem bc my grandma's money wouldn't cover it, but I also planned on moving out to an apartment to get out of this abusive household. \n\nMy parents said that I'd get the money back \"when I can prove that I'm mature\" or something. But since I can never get their approval on anything I do anyway, I know that'll never happen. \n\nThis feels incredibly wrong to me. Most of that money was the refund from college that my gma is paying for, and some of it I even earned. My dad did give me a generous amount at one point but I can't remember how much it was.\n\nWhat can I do to get that money back? I feel like he just stole everything from me. Or what should I do now, when I can't pay for next semester and can't pay to move out?",
            "Q_score": 241,
            "Id": "11l9unk",
            "Url": "https://www.reddit.com/r/Advice/comments/11l9unk/f_21_dad_stole_4200_from_me_to_make_a_point/",
            "Aswer": "You’re 21 and your parents control your bank account and have a curfew for you?   Time to take control of your finances and your life and move out!   Find a bunch of roommates if need be, but living under that kind of control at 21 is not right and not fair!   You’re an adult and have every right to be treated as one!",
            "A_score": 485
        },
        {
            "Question": "Husband’s request\nMy husband has asked me on several occasions to wake him up with a blowjob, which would be fine, but he has narcolepsy. \nHe is the hardest person to wake up. \nHe’ll sleep through alarms, being shaken, etc. I’ve told him that I’m concerned that if I tried to do what he asks, that he it won’t wake him up. \nHe was unbothered by it and said that he for sure would wake up. What should I do? I don’t want to put myself or him in an uncomfortable position, but this is something he really wants.",
            "Q_score": 26,
            "Id": "11lm00g",
            "Url": "https://www.reddit.com/r/Advice/comments/11lm00g/husbands_request/",
            "Aswer": "If you try it and he doesn't wake up, just stop. No big deal.",
            "A_score": 81
        },
        {
            "Question": "I’m on a deployment overseas, and I know of several soldiers cheating on spouses/partners. Should I stay in my lane or expose them? What is the right thing to do here?\n",
            "Q_score": 542,
            "Id": "11kw6qf",
            "Url": "https://www.reddit.com/r/Advice/comments/11kw6qf/im_on_a_deployment_overseas_and_i_know_of_several/",
            "Aswer": "I used to do marriage counseling when I was in the Army. With  each couple, I would meet with the partners individually, with EVERY SINGLE COUPLE I would ask about  infidelity.  Each and every time both would say NO. Then I asked:  \" When you and your spouse were apart for deployment,  did you have sex with someone else?\"\n\n100% at least one partner said YES. \n\nI never understood it. I still  don't.",
            "A_score": 1021
        },
        {
            "Question": "My girlfriend is pregnant - we decided not to keep it, now she says she would only abort it “for me”\nI feel awful. My girlfriend (27f) and I (29m) have known each other for 7 years. We finally became a couple 3 months ago. Now she’s pregnant (yes we did use protection)\n\nWe’re both still dependent on our parents financial aid and I don’t think we could manage a child let alone offer a good life for them.\n\nI’m a trained actor and work two jobs to support myself alone. She just started an education in illustration and works part time as a call agent. \n\nOn top of that I struggle with some mental issues and have just started therapy.\n\nWe initially decided against the child but today my girlfriend said that she would only abort it “for me”. \n\nI don’t know what to do. I love this woman and definitely want to have a family with her. But right now seems too irresponsible and honestly impossible. The more we talk, the more I feel like she definitely wants to keep the baby.",
            "Q_score": 144,
            "Id": "11l2crz",
            "Url": "https://www.reddit.com/r/Advice/comments/11l2crz/my_girlfriend_is_pregnant_we_decided_not_to_keep/",
            "Aswer": "Remind her to think about the child's perspective. I was born to parents who didn't plan it, and it was awful. I'm estranged from one parent and I am low contact with the other.  I wish they had waited to become parents. \n\nEvery child should be born to parents who have prepared, saved, matured, achieved their goals, and are ready to sacrifice their money, sleep, time, hobbies, and social lives for the kid. \n\nIt's her choice. Tell her you aren't ready to be a proper father.",
            "A_score": 174
        },
        {
            "Question": "Post got taken down in another sub! I’m really just desperate for help!\nDesperately needing suggestions for home.\n\nHello, I’m F(21) and my dad is 67. We’ve always lived in the same house, but since mom passed in ‘09, the quality of our home has completely went to hell. Never cleaned, etc, and was never forced to pick up or have a daily routine. I recently got on new meds to help w depression and to overall motivate me to live a better life while I do counseling and other things. Dad and I both are severely mentally ill, but he has never got treatment. He is retired now, but does nothing all day. The state of our house is completely unlivable at this point, mold to where one room is completely closed off and I can’t breathe (I have asthma and severe allergies), it is also just filled with trash bags, etc. We have carpets in every room but kitchen and bathroom, all of which are completely destroyed, so much clutter to where it’s unbearable and there is no living space (house is only 800 sqft). Dad sleeps on the nastiest couch with the dogs (we adopted before mom passed). I want to completely tear down the house and build a new one. He just wants to start on fixing the house by “expanding the closed off bedroom”. We don’t have any appliances replaced because even if someone would come inside to help install, how would we even get around things. PLEASE, I am desperate for tips to start this project and I am young and clueless how to, I cannot live like this anymore. If all goes well, I will potentially have a job making $70,000+ soon (fingers crossed). We are well below poverty line, so all I can think about is how I want to tear down this place, as I think it is well beyond saving, and build our new home. Thank you all. A few comments I had previously suggested first getting a dumpster to empty out the trash of the home, but then what next..?",
            "Q_score": 34,
            "Id": "11ld9qy",
            "Url": "https://www.reddit.com/r/Advice/comments/11ld9qy/post_got_taken_down_in_another_sub_im_really_just/",
            "Aswer": "Are the both of you open to throwing things away?",
            "A_score": 22
        },
        {
            "Question": "Should I call CPS on my bff and his wife? She attempted suicide at home while child was home. Idk wtf to do.\nMy bff and is wife have a 4 year old.  Suspected neglect,the child super small and developmentally way behind, kind of always dirty.   Dads a gamer and is always gaming.  Mom has a bunch of mental illness and depression.   I don’t think either can care for him.  Anyway, mom attempted suicide in the house while dad and child were home.   Mom is I guess in the hospital.   Dad is home, but he says his 4 year old is staying with family until Mom comes home. I don’t know why.  \nHow safe is it going to be for that kid to be in the house with a Mom who just attempted suicide?   I mean, the care for the child prior to suicide was questionable.   \nWill anyone from the psych ward worry about the kid?   \nI mean, he’s my bff.  Do I call cps?  We don’t know what to do.  Super worried about this kid.",
            "Q_score": 29,
            "Id": "11l93uf",
            "Url": "https://www.reddit.com/r/Advice/comments/11l93uf/should_i_call_cps_on_my_bff_and_his_wife_she/",
            "Aswer": "Yes. Call CPS. Sounds like there’s some very valid concerns for the kid’s health and safety. You could save the kid’s life. This is so sad",
            "A_score": 36
        },
        {
            "Question": "I recently found out I’m pregnant and the father is calling me selfish and won’t talk to me\nI (21F) just found out I am 12 weeks pregnant. \n\nFor a little background information, I’m 21 and the baby’s father is 22. We are not dating. We have been in kind of a situation ship for the past 1.5 years. I was using birth control and he always used protection. I’ll call him “L” for this story. \n\nWhen I found out I was pregnant I knew immediately that I would be going through with the pregnancy and keeping my baby.  I had decided to tell L pretty quickly. I didn’t think he would react the way he did. After telling him, he immediately asked what I was planning on doing. I told him I wanted to keep the baby. He got kinda angry and told me it’s unfair for me to make that decision. He told me he’s not ready for nor wants a child right now. I had tried explaining my feelings on ab**tion, and why I made the decision I did. L didn’t want to hear my reasoning or talk about it whatsoever. He had told me I was being selfish. \n\nI completely believe the father should be able to have some opinion on these things. But on the other hand, it’s also my body and half my child as well. I feel terrible over the way things went with L. He now refuses to talk to me and I’m not sure what to do now. I know I want to keep my baby. \n\nWith all that being said, I’m hoping to get some outside opinions on this. Am I being selfish? Has anyone else been through this? Thanks in advance!",
            "Q_score": 536,
            "Id": "11kia1t",
            "Url": "https://www.reddit.com/r/Advice/comments/11kia1t/i_recently_found_out_im_pregnant_and_the_father/",
            "Aswer": "Your body your choice. But you also can’t expect him to be happy about it. If you want to keep the baby, fine. But plan on being a single mom.",
            "A_score": 2091
        },
        {
            "Question": "I want to break up with my girlfriend, but...\nMy girlfriend isn't the nicest to me. She likes to hit me, hurt me, and say stuff to me that mentally hurts me. I want to break up with her, but she said that if I do, she will kill herself. WHAT DO I DO?? Do I endure the pain, or save myself, but live with the grief knowing that its my fault someone died?",
            "Q_score": 172,
            "Id": "11klhdd",
            "Url": "https://www.reddit.com/r/Advice/comments/11klhdd/i_want_to_break_up_with_my_girlfriend_but/",
            "Aswer": "She won't do it.\n\nBreak up and call that police telling them what she said. \n\nIt's just manipulating you to stay",
            "A_score": 541
        },
        {
            "Question": "I’m starving and my mom won’t feed me. Is there anything I can do?\nI’m 16 years old and I live with my Mom, her ex, and my sister.\n\n2 1/2 - 3 months ago, my mom stopped going grocery shopping, and only on some days would her ex go out and buy ingredients to cook with. Meaning that I go most days with no food at all, with my only form of sustenance being my school lunches. On weekends, I’m shit out of luck. Originally, I thought it has to do with a bad financial situation, until she told me outright that she was simply too lazy.\n\nI tell her that I’m hungry, and she replies to me saying “You’re always hungry.” I’m rapidly losing weight. I’m 5’10-5’11 and I used to be 170 lbs, I’m down to 150 now. I’ve never felt more weak in my entire life, and recently, I’ve started feeling dizzy and lightheaded, some times even short of breath. How get through to my mom?",
            "Q_score": 2165,
            "Id": "11jx4dw",
            "Url": "https://www.reddit.com/r/Advice/comments/11jx4dw/im_starving_and_my_mom_wont_feed_me_is_there/",
            "Aswer": "There are times in life when asking for help is the wisest path.  This is one of those times.  Talk to an adult you trust about what is happening, perhaps teacher, an aunt, an uncle, a minister, or somebody who can help you.  Ask for help.",
            "A_score": 2847
        },
        {
            "Question": "My (50F) son (15M) has become a far-right extremist and I have no idea what to do\n \n\nThrowaway account because this is too embarrassing.\n\nFor some context, my son is on the spectrum and has difficulty forming relationships with people as a result, although he still has a few in person friends. He's extremely intelligent, and knows many things, especially when he puts his mind to it. I also know he uses a lot of social media, since it's easier for him to make friends that way, however I did not monitor them which I regret doing.\n\nThe first red flag was when he was 13 and he began talking to me about various statistics which he said proved that the races were not equal, like crime and IQ, and when I pointed out there are societal reasons for this, he went on a rant and said that that these are actually biological (I still don't know what his sources are). At that time I just chalked it up to him not understanding the world very well and assumed he would grow out of it, but it has only gotten worse in every way.\n\nHe ordered a copy of Mein Kampf to our home. Fortunately, I saw the package and threw it away before he could get his hands on it, but when I confronted him about it, he started screaming and telling me that all his online friends and he started a reading group where they would read books together and they started with Mein Kampf, and that now he would be left out. I asked him if any of his friends at school were reading Mein Kampf, and he said that they were \"normies\" who didn't understand reality. I asked him if he thought I was a \"normie\" too, and he went on an incredibly misogynistic tirade against me saying that I was a \"whore\" and a \"roastie\" (I looked up what it meant later and I was horrified) for pursuing my career (which has provided our family with lots of money, including that he benefits from!) and for openly talking about my past relationships before I met his father, and also because his father and were never married and now separated. He told me he hated me for ruining his life by waiting \"so long\" to have children which is why he was on the spectrum and had difficulty talking to people (many of my friends had children at my age and they did not have children on the spectrum, not that it's a problem anyway). And that was only the beginning, I do not wish to go into more detail, but I couldn't even say anything to him as I broke down crying. I loved my son and we were so close until that point and never before had anything so mean ever been said to me. I couldn't handle it. I didn't understand why he would say such horrible things to me, or how he could have learned such ideas. I am a progressive, and especially feminist, and I thought I was raising our son to hold the same values, but he became the complete opposite of what I wanted him to be.\n\nIn the aftermath of this, I confiscated his computer and phone, although I did let him send one last message to his horrible \"friends\" since he wouldn't stop screaming to us about how he couldn't just abandon them without saying anything. However, this did not help in any way. He began spending more and more time outside the house, which I thought was a good thing and that maybe he was socializing with his peers who didn't accept this sort of thing. I also noticed over the next few months that he was getting more and more muscular, I was proud of him, but I also did not want him to believe he had to prove his \"manliness\" by getting big muscles, he then cursed me out and told me I was trying to make him a \"soyboy\" (a term I did not know and had to look up) so he didn't care what I had to say. Eventually I find out he somehow managed to find a skinhead gang after school and they workout together... after I saw him with them, I screamed at him and then at them that they as grown men should stop trying to manipulate a teenage boy and there was no reason for him to spend time with strange men in their 20s and 30s.\n\nAfter that, I was very strict about everything he was doing. I would pick him up and drop him off, even though it meant I needed to take off time from work to do so. When I dropped him off at home, I locked the doors to make sure he could not escape before returning to work. However, this did not work either, and eventually I was called by the school principle who let us know that he and his school friends (who he has also convinced to become Nazis now!) had beaten a group of POC boys up and that he and his friends would receive a suspension as a result. I was so livid. I could not imagine the fact I was raising a future criminal, and he told me that I was a traitor for not being proud of him for being stronger than them and for beating up \"murderers of our people, rapists of our women, and invaders of our lands\". No reason can get to him, and no discipline can get to him. And now I AM SUFFERING THE CONSEQUENCES TOO, all my friends now assume I must be a racist because of my son, and don't want to spend time with me anymore. The other parents at the school avoid me. People who used to be friendly are now cold. I have no idea how to deal with this situation, can anyone here on Reddit give me good advice?",
            "Q_score": 331,
            "Id": "11kf43s",
            "Url": "https://www.reddit.com/r/Advice/comments/11kf43s/my_50f_son_15m_has_become_a_farright_extremist/",
            "Aswer": "Inpatient therapy. Check him into a psychiatric hospital for everyone's safety. This is way above your pay grade. He is obviously not ok, and he needs a professional or six. Especially considering that he's already become violent, it shouldn't be hard to get him admitted. Be prepared to call law enforcement to get him into the facility. You cannot handle this on your own, and the time for outpatient therapy has passed. He'll likely be even more abusive to you in the short term, but in the long term it will be good for all of you.",
            "A_score": 577
        },
        {
            "Question": "My Girlfriend is hanging out with people that she knows openly have a crush on her, as well as people that actively try to ruin our relationship, she refuses to listen to me when I protest.\nMy girlfriend has an issue with disconnecting with people, I’m aware of this and I don’t push her about it. However, we recently haven’t been spending much time together because of how often her friend is staying at her place. They’ve known each other since they were kids and I have no right to step in between them, the problem I have is she is fairly sure that he has a crush on her, at least a mild one. Even though it’s something I’m not quiet about disliking, they wouldn’t stop talking to them even if I really tried (which I have.) the reason I tried wasn’t because of the crush, it was because he’s a extremely rude person, as well as a raging racist even though it’s (Just a joke.) Which bothers me due to the fact I am African American. He’s tried to ruin our relationship and she gossips with him about me as well, I love her but I’ve found myself not showing it as much because of how uncomfortable I felt when I learned all of this. On top of all that, she’s just now telling how many of the people she talks or talked to recently (Like a couple months) have a crush on her that she’s aware of. She out right refuses to stop talking to any of them, I don’t want to break up with her but I don’t know what else to do.",
            "Q_score": 66,
            "Id": "11kr71h",
            "Url": "https://www.reddit.com/r/Advice/comments/11kr71h/my_girlfriend_is_hanging_out_with_people_that_she/",
            "Aswer": "If she likes the attention more than the comfort of her partner, I feel like you should set her free to pursue this attention-seeking on her own.",
            "A_score": 111
        },
        {
            "Question": "Should I send my ex the necklace he gave me with his name on it?\nMy ex broke up with me a few months ago. It wasn’t a messy breakup, I took it hard and sent a few lame texts but thats about it. I’ve stopped trying to contact him so I can heal but I have a necklace he gave me with his name on it. I think it would be best for me to get rid of it but I feel weird about throwing it out. Would it be weird to send it to him and let him deal with it?\n\nAlso, any advice on how to get over said ex? He was my best friend and first love, all my friends were his friends so im kinda just alone now lol.\n\nA lot of people are saying he’s weird for giving me a necklace with his name on it, but I asked for it, I thought it was cute lol.",
            "Q_score": 90,
            "Id": "11kl8wc",
            "Url": "https://www.reddit.com/r/Advice/comments/11kl8wc/should_i_send_my_ex_the_necklace_he_gave_me_with/",
            "Aswer": "Toss it. Don't send it to him, it's like contact. No contact.",
            "A_score": 187
        },
        {
            "Question": "my sever admins are trying to make my discord server lgbtq+\nOk the title sounds a bit strange this might need some context then I'll do the advice part (this is my first post so I don't exactly know if I'm doing it right)\nBasically I have a discord server focused around gaming and technology and we needed a name change science we all decided the current name didn't represent the server but the admins have been trying to push a name involving lgbtq+ things. I'm not homophobic or anything and i support the lgbtq+ community but at the end of the day it's just not what the server is focused on there are other servers out there focused around that. I've changed the name for now as for some reason I'm finding this whole thing pretty stressful but I really don't know how to handle this situation\nIf people need more information just tell me as this is my first post.\n\nEdit:good news situation is sorted thanks for the help",
            "Q_score": 30,
            "Id": "11ks5gb",
            "Url": "https://www.reddit.com/r/Advice/comments/11ks5gb/my_sever_admins_are_trying_to_make_my_discord/",
            "Aswer": "\"Sorry but this community is about games and technology so i don't feel having LGBTQ in the name would represent it well.\"",
            "A_score": 68
        },
        {
            "Question": "I’m 18 and haven’t left my house in 2 years.\nI left school at 16 with 0 GCSES and since then I’ve been living with my parents doing nothing but playing games and watching stuff. \n\nI have no friends, no goals or passions, I havnt left the house since I stopped going to school, there has genuinely been times I’m unsure what month it is. \n\nI don’t know how to speak to people, the only face to face conversations I have are short and occasional talks I have with my brother. \n\nI want to start having a life but I don’t know where to begin or if it’s seriously too late for me. I don’t even know if I can get a job when I have no GCSES, experience or people skills for an interview. \n\nHow do I make friends at the very least or have a relationship? Like I don’t understand how it’s possible at this stage. Google says just talk to people and you’ll learn with practice, but who would want to talk to someone who doesn’t know how to talk? \n\nI’ve literally spent my whole life just drifting along with no one and nothing being babied by my parents to the point I’m convinced I have a disability they’re not telling me about.",
            "Q_score": 168,
            "Id": "11k6g4v",
            "Url": "https://www.reddit.com/r/Advice/comments/11k6g4v/im_18_and_havent_left_my_house_in_2_years/",
            "Aswer": "Your parents have failed you and you are failing yourself as well.  You get out of life what you put into it.  If you put nothing into it then you'll get nothing out of it.  I would recommend finishing your education then getting a job.  Once you have a job you will meet others and you can work on your social skills.",
            "A_score": 235
        },
        {
            "Question": "How do I tell my sister I don’t want to share a space with her when we travel?\nMy family (husband and 5 kids) are invited to my nieces graduation party in another state. Because of our family size we prefer to get an Airbnb and while we’re visiting we will also take our kids to do some touristy thing. Well my younger sister, Layla was  also invited and suggested we get a place to share so that her kids can hang out with mine and we could save a bit of money by splitting cost.. In most circumstances/ with most people ( or Layla solo) I wouldn’t mind but I really do not want to spend any amount of nights with her kids.. I love them. I truly do. I just can’t handle how naughty they are.. The younger one isn’t that bad but the older child, Keith (8),who I suspect is neurodivergent, does not listen, he is very rude, has little to no manners, and is mischievous in scary ways. Part of me wants to support her because she’s a single mom but the other part of me doesn’t want to ruin this time away from me, my husband or kids.. Because of the last trip we took together where Keith was caught stealing, set a garbage can on fire, and wouldn’t listen to Layla at all; My husband was a firm no. so, that’s what we’ll do but I don’t know how to tell my sister without this coming off really bad.. She is super sensitive and always feels like the world is out to get her and her kids. They literally do no wrong in her eyes until it’s really bad. I don’t want her to feel picked on and I don’t want this to cause rifts between us.. how do I let her down easy?\n\nEdit: I just ripped the bandaid off and used a combination of being clear about why we don’t want to share a space but made it less about them and more about us.. I just told her we plan staying with a friends one night ( which is true) and that I think it would be best for all of us to have separate spaces to unwind since our kids will all be a bit more cranky from traveling.. I also said it would probably be best so none of us have to deal with each others kids different sleeping patterns and such.. \nI appreciate the input. It helped me find a way to be kind and direct about my families needs. The only think I didn’t do was write it in a away that was absolutely firm so if she come back with a “ oh I don’t mind” I’ll have to add a bit of spice to make sure she understands it’s nonnegotiable. ( I text her since we have very different schedules and half the time she doesn’t answer her phone anyways)",
            "Q_score": 23,
            "Id": "11kl4iw",
            "Url": "https://www.reddit.com/r/Advice/comments/11kl4iw/how_do_i_tell_my_sister_i_dont_want_to_share_a/",
            "Aswer": "\n>Because of the last trip we took together where Keith was caught stealing, set a garbage can on fire, and wouldn’t listen to Layla at all; My husband was a firm no.\n\nOof!\n\nThis is a **rough** situation! I can totally understand why you wouldn't want to vacation with Baby Satan, but I have no idea how you communicate that to your sister without hurting anyone's feelings.\n\nMy suggestions: \n\n1. Maybe see if he can visit his Dad during the event?\n\n2. If he can't, maybe go the other way hard and get your sister in with a family counselor who specializes in behavioral therapy. They can do wonders. Costly, but you can't realistically avoid your nephew forever and he's a little boy who needs help.",
            "A_score": 13
        },
        {
            "Question": "I didn’t take my placebo pill during my period and didn’t tell my BF. I understand he’s angry and I should have been more considerate but there are many more factors that should have weighed into his feelings.\n1. We have been together almost 9 years. Of those 9 years, I have never had a pregnancy scary, have always either taken pills or had an IUD AND my BF still wears condoms most times we do have sex. \n\n2. I did not take my placebo pill during a week I was already on my period. We are not usually sexually active during my period.  And were not this time. \n\n3. DIRECTLY after the week of placebo pills of this pack, I got an IUD inserted. \n\n4. BF still uses a condom almost every time. \n\nNow he’s incredibly upset with me and telling me he could never trust me again. I’m not sure what to tell him. I understand he’s upset but given all these added factors, I don’t think this should be relationship ending. Am I wrong?\n\nETA for context: we actually already had this fight about a month ago and we agreed it was his right to know about my birth control decisions. HOWEVER. The placebo is the placebo. I know it does nothing whether I took it or not. What he’s upset about is my decision to not take it without telling him. What I don’t understand is why this is such a big deal given all the previous factors AND it being a placebo pill.",
            "Q_score": 511,
            "Id": "11jlwqd",
            "Url": "https://www.reddit.com/r/Advice/comments/11jlwqd/i_didnt_take_my_placebo_pill_during_my_period_and/",
            "Aswer": "Do you both realize the placebo pill is literally *a placebo*? It doesn't have any medication, it's just there to keep you in the habit of taking a pill every day while you have your period. It doesn't change anything. It does nothing.",
            "A_score": 1811
        },
        {
            "Question": "Is it controlling to ask your bf to stop watching porn ?\n",
            "Q_score": 32,
            "Id": "11k48vg",
            "Url": "https://www.reddit.com/r/Advice/comments/11k48vg/is_it_controlling_to_ask_your_bf_to_stop_watching/",
            "Aswer": "Human relationships are far more complicated than black and white statements, so it’s often dangerous to a relationship’s longevity to take in advice that is so absolutist. (Notions to some of the replies) \n\nI personally don’t believe it’s controlling to ask your boyfriend, because your boyfriend also has a choice in agree or disagreeing based on his personal boundaries. \n\nI would say, if you want a partner to not watch porn, communicate that to them, and see what they think. If they don’t agree, look inward and decide if this topic is a large enough issue to be a potential breaking point. There’s no right or wrong morality in finding your personal boundaries, and there’s nothing wrong with saying to someone, “we’re not totally compatible.” Just take note when you find these boundaries, and see if you want to find a partner that reflect them too.",
            "A_score": 178
        },
        {
            "Question": "How to go to a bar by myself and hopefully meet someone?\n(20F) I'm new to drinking. I don't have much friends and I'm very socially awkward. But I am brave enough to go out and try new things. I havent experienced a relationship yet and it's not like I'm desperate or whatever but I'd like to know how to behave in such an environment alone. The last time I went to a bar, it was really crowded and I was in a corner by myself not knowing what to do. I think I'm okay looking but I feel like guys my age want nothing to do with me as every guy that walked in didn't even throw a glance my way lol. I just need some advice.",
            "Q_score": 21,
            "Id": "11k2lyy",
            "Url": "https://www.reddit.com/r/Advice/comments/11k2lyy/how_to_go_to_a_bar_by_myself_and_hopefully_meet/",
            "Aswer": "Going to the bar with the specific intention of meeting someone special is almost always disappointing.\n\nGoing to the bar to without reservations and have conversations is much more rewarding.  I go to the bar TO TALK to other people that don't work with me or live in my house.   There are dozens of people I talk to at our local bar.  There are several friendship groups that occasionally invite me to stuff because I know them through the bar.\n\nThis is difficult for introverted people.  Not only do you have to put yourself out there, some people won't always like you or want to talk to you.   That's life.   Its also difficult if nobody is up there.  If no one is there, I have just one or two and chat with the bartender (all of whom I know.)   This is more difficult in packed clubs with a hundred people.\n\nEvery serious relationship I've ever had happened when I wasn't \"trying\" to meet someone.  Its almost like trying too hard messes everything up.   Just be yourself and be open to making friends and talking to other people.  The rest will happen eventually",
            "A_score": 46
        },
        {
            "Question": "A child I’m babysitting has very large bruises\nHi guys, I’m new to this sub but I don’t know what to do. I [18F] am currently watching two siblings (both under the age of 4), the oldest is still napping, but the youngest is a little girl and I just changed her diaper. When I went to wipe her, I saw a green and purple bruise spread across her entire bottom. It’s very large. Could this be from spanking? I babysit for their best friends every other week as well, should I mention this to them? This is the first time I’m sitting for them, the mom seemed very anxious but I just chalked it up to me being their first sitter ever. I was abused as a child but being in the situation of the grown up, I don’t know what to do. Please help me. Do I take pictures of the bruise? What if nobody believes me without proof? Is that wrong?? I’m going to check the oldest’s bottom once he wakes up while I’m changing him and see if there’s something similar.\n\nUPDATE: The oldest’s entire bottom and legs are bruised too. I have been able to take pictures of JUST their backs and the backs of the oldest’s legs, as they have bruises all the way up their spines as well. Nothing from the photo could be taken as pornographic. I have looked at Mongolian Spots and didn’t know about them prior to this issue, so thank you for those that have educated me. I did call the parents friends who I am very close with and trust, and they said they will help me out. I doubt that it’s those though, they both have the same marks in the exact same spots and they’re purple and look like bruises. I can see blood vessels. I’ll keep y’all updated. Thanks everyone.",
            "Q_score": 236,
            "Id": "11jkzno",
            "Url": "https://www.reddit.com/r/Advice/comments/11jkzno/a_child_im_babysitting_has_very_large_bruises/",
            "Aswer": "If you have even the slightest inkling that there is child abuse going on, you should report it to the police.\n\nIt their job to investigate, find proof, etc - not yours.\n\nDon’t ignore your instincts, if gut tells something is wrong, it probably is.",
            "A_score": 212
        }
    ]
}