{
    "Posts": [
        {
            "Question": "My mom (40) opened a credit card in my name name (18) and I did not know until recently, she doesn’t want to close the account or give me the card. She did this worth the excuse that it will help me, but Ik that’s it’s cuz she has bad credit and the bank won’t approve her for a home loan. Help\n",
            "Q_score": 371,
            "Id": "125jmdx",
            "Url": "https://www.reddit.com/r/Advice/comments/125jmdx/my_mom_40_opened_a_credit_card_in_my_name_name_18/",
            "Aswer": "OP this is not a joke your mom is committing a crime here i do see the fact that you are dependent on her but the fact that she is using you for her purposes as she has a bad credit score is not a good thing you should immediately file a police complaint and get a job stop being dependent on her she will ruin your life before it starts",
            "A_score": 596
        },
        {
            "Question": "How do I make the public aware that my school doesn't take shooting threats seriously?\nSERIOUS TW JUST IN CASE: I'm currently a senior in high school, but this is a serious problem that really concerns me, more so after the recent shooting. There's this kid (Over 18, plays a huge part in this) that has been threating to shoot up the school, how to specifically off someone in very detailed ways, how he'd r*pe people, and so on. Most of these threats have been made towards me specifically. The school & the district wants nothing to do w/ it because he has special needs. The Board Of Education won't do anything either. He even has child p*rn on his phone, but they don't seem to care. I don't want anything horrible to happen, but nobody is taking this seriously, what do I do?!",
            "Q_score": 44,
            "Id": "125mk9v",
            "Url": "https://www.reddit.com/r/Advice/comments/125mk9v/how_do_i_make_the_public_aware_that_my_school/",
            "Aswer": "Press",
            "A_score": 39
        },
        {
            "Question": "Whole office is mad at me coz I told a colleague’s spouse that she’s cheating on him\nBasically everyone at the office knew she is cheating except her spouse. I didn’t give shit until her spouse approached me then I told him everything.\n\nNow entire office is mad at me telling me that I should have minded my own business. This includes those simps who once tried to rape her when she was drunk at a party. Like wtf I did wrong?\n\nI’m out of office now but will go back in few days and idk how to counter everyone? Any advice?",
            "Q_score": 1060,
            "Id": "124oimq",
            "Url": "https://www.reddit.com/r/Advice/comments/124oimq/whole_office_is_mad_at_me_coz_i_told_a_colleagues/",
            "Aswer": "\"This includes those simps who once tried to rape her when she was drunk at a party\"......I feel like this is the bigger issue here!",
            "A_score": 1710
        },
        {
            "Question": "How did you survive the lowest point in your life?\nI’m a 24f and life has been progressively getting worse for me over the past 4 years and I’m struggling so much. I’d love to hear about how others have handled their worst moments and managed to keep going and not give up.\n\n(I’m very new to Reddit and I don’t know if I’m supposed to say helped in every comment so I’m sorry if I’m doing this wrong haha)\n\nThank you so much for taking the time to leave these comments! I appreciate it a lot",
            "Q_score": 123,
            "Id": "1253aaq",
            "Url": "https://www.reddit.com/r/Advice/comments/1253aaq/how_did_you_survive_the_lowest_point_in_your_life/",
            "Aswer": "Identify 1 negative aspect of your life that you have the power to remove from your life then remove it.\n\nIdentify 2 short term goals and 2 long term goals then identify what needs to happen to obtain them then obtain them. Rinse and repeat.\n\nThis is the exact blueprint that turned my life from “single unemployed criminal dropout alcoholic” to “sober married gainfully employed homeowner with a master’s degree” in 5 years.",
            "A_score": 86
        },
        {
            "Question": "How do I get my ex to leave the gym I work at?\nSo my ex girlfriend is currently a member at the gym I manage at. The kicker is she was secretly married the entire time we were dating and once I found out I ended things. The problem is that every week Monday to Friday at 7:30am to 9am I see her and her new boyfriend that she cheated on me (and is currently cheating on her husband with) at the gym. I thought I could handle it but I can't. I flat out ignore them both but hearing their voices first thing in the morning almost every morning is painful. I just need advice on how I can get them to switch gyms? \n\nI can't leave this job, I was so broke for so long after covid. Lost my cafe and my house. And now I'm finally working again earning a very good salary and building my life back up. I just moved to this new town mid last year as well so I have no where else to go. Any advice please help",
            "Q_score": 540,
            "Id": "124ongs",
            "Url": "https://www.reddit.com/r/Advice/comments/124ongs/how_do_i_get_my_ex_to_leave_the_gym_i_work_at/",
            "Aswer": "Greet them both warmly and ask her how her husband is doing.",
            "A_score": 1986
        },
        {
            "Question": "my parents dont let me shower\nmy parents only let me wash myself every 3 days. and no showers, only baths. im a teen and i have pimples all over my body, i sweat a lot and i feel gross. my parents think i will get a cold if i shower daily. how do i convince them to let me?",
            "Q_score": 374,
            "Id": "124s6s6",
            "Url": "https://www.reddit.com/r/Advice/comments/124s6s6/my_parents_dont_let_me_shower/",
            "Aswer": "You should try and arrange a doctor's appointment where they can ask the doctor about their superstitious beliefs.",
            "A_score": 768
        },
        {
            "Question": "Neighbor upstairs is an animal abuser, what should I do\nI found one of the cats with a bloody nose, and when I touch it’s leg, it meows as if its in pain(i hope its not a broken rib). That guy basically throws firecrackers to scare cats outside. There’s no denying who did what, all my other neighbors know about this guy.\n\nCalling the cops won’t work, they “wont have enough evidence” just as always, and he can easily find out who reported him to the cops. Last thing I need is to feel in danger because of some drunkard",
            "Q_score": 86,
            "Id": "124yxyq",
            "Url": "https://www.reddit.com/r/Advice/comments/124yxyq/neighbor_upstairs_is_an_animal_abuser_what_should/",
            "Aswer": "I don’t care if my account gets banned for this but I’d like to see someone put him 6 feet under for attacking a cat",
            "A_score": 128
        },
        {
            "Question": "Would it be weird if I made a friend some oat milk?\nI have a new friend who is vegan. They recently came over to my home so our kids could have a play date. I didn’t have any plant based milk in the house so they brought a container with a little bit of oat milk in it so they could have a cup of tea here. They accidentally left that container and the milk went bad so I threw it away and washed the container.\nWe were chatting about oat milk and they mentioned how expensive it is. I know that it’s fairly easy to make your own and was wondering if it would be weird if I gave them their container back with some homemade oat milk in it? Or is that too odd? I’m like 80% sure they would appreciate it but the 20% is shouting loudly that it’s too weird so I’d love some opinions please!",
            "Q_score": 72,
            "Id": "124xpeu",
            "Url": "https://www.reddit.com/r/Advice/comments/124xpeu/would_it_be_weird_if_i_made_a_friend_some_oat_milk/",
            "Aswer": "I’m vegan, I’d think it was super thoughtful and sweet",
            "A_score": 83
        },
        {
            "Question": "Fast ways to make money besides s*x work, I'm already selling everything I own\nI have listed most things I own for sale on Facebook market place and Kijiji. Even my tv, couch, dresser, my collectable cars that I adore. I am behind by a lot of money but right now I am in urgent need of about $300. I can usually do food delivery to catch up but my car needs a small repair first (I can do myself just need the part) and I have a negative account balance. I am looking for cash jobs as well as regular jobs. It's very hard to find a strictly daytime job as a single mother. I have had people reach out online to offer me cash jobs usually in construction or something of the like, but when they meet me and find out I'm a woman they doubt my strength and don't call me back. I am in Ontario, Canada. I did s*x work before but it was really scary and bad and they make me bleed all the time and I rather die than do that again. Maybe that is what I have to do but I want to know if there's other ideas.",
            "Q_score": 88,
            "Id": "124v7y4",
            "Url": "https://www.reddit.com/r/Advice/comments/124v7y4/fast_ways_to_make_money_besides_sx_work_im/",
            "Aswer": "Another idea. Contact your local nuclear power plant and ask to be trained as a firewatch for the next outage. You can even get sent to operations school if you have a general education diploma. No worries if you do not though, firewatch pays well.\n\nBy the way, if you are curious. This kind of basic job nets about 1k dollars per week for about 2-3 months. And if you choose to stay and they send you to the nuclear operator academy you'll be making roughly 80 thousand dollars per year. It requires 18 months of training and they will ship you most likely to the capital of your country. But I'm sure there are on campus accommodations for parents with children.",
            "A_score": 155
        },
        {
            "Question": "My (33m) girlfriend (29f) isn’t paying rent. Should I break up?\nI (33m) have been together with my gf (29f) for nearly 4 years now. She comes from a wealthy family. Well, her extended family is wealthy. Her parents are somewhere in the low 7 figures. But she never had to worry about money. Therefore she never really had a job. Sometimes she would work for her dad’s company. But that would only be minor tasks. I never really worried about that because it was made clear she would take over the business and thought she’d get everything together by then. At one point I got a bit annoyed that she was always at home and I never had a second for myself and helped her getting a job through a friend of mine where she works a few hours per week. \n\nI kind of became suspicious when she didn’t finish her degree and confronted her about it. But she shrugged it off and told me it wasn’t any of my business as long as she was able to pay rent and contribute financially to our life. Since communication is very important to me I was a bit alarmed. \n\nDuring the last year things got rocky. For reference: We split rent and costs for our dog 50/50. Since I’m using her car sometimes I give her half of the leasing rate + gas. Other spendings are all from our own accounts.\nLast summer we went on a roadtrip where I paid for everything. Afterwards I told her the total, expecting her to pay me back. She told me she couldn’t afford it, which I thought was weird. First of all because I know she got a huuuuge cheque from her dad the year before and I thought it was a bit unfair not to clarify beforehand. Since then she only paid rent sporadically. When I confronted her about it and asked her when she was gonna contribute again to our shared life I barely got an answer or she told me she couldn’t afford it. \nTo be clear, it’s not about the money in the first place but more about the way of not communicating about this issue. Am I expecting too much? How could I address this better? Or is this a major red flag?\n\n\n\n\nUpdate: to address a few comments\n\nCommunication about finances: I was very upfront when she moved in about all costs, what and how I plan to cover/split. We discussed it multiple times. She’s a passionate cook but at one point grocery spendings were getting out of hand (1k/month). We agreed on a limit. \nBut I also think there should be common sense about spending. Why would I need to clarify that I don’t pay for a full vacation? Doesn’t make sense to me in a relationship. In my previous relationships my partner always offered to pay her half or contribute whatever she can.\n\nCommunication emotionally: My girlfriend is a very insecure person. She’d rather listens to others instead of doing the talking. In my opinion that’s rooted in lack of self esteem. That’s why it’s hard to talk about emotional or uncomfortable things with her. I can see her trying though. \n\nIn her defense: She’s not overall lazy. As I mentioned she’s a passionate cook and kinda turned into a SAHP, likes to make everything nice at home, having guests over etc. It’s just… I never asked her to do any of that. I want my partner to tell me what she’s thinking about, what her goals are, difficulties, etc. Wich I told her. \nBut she totally locks me out. Guess that’s why the rent thing is bothering me so much. It would have been fine for me if she would have come to me before and would have told me that she can’t pay rent, why that is and what her plan is.\n\nI did talk to her about it multiple times. But I also wanna support her and not being a douche to her. And yeah, maybe I’m bad at addressing this properly, because I don’t wanna be too harsh.\n\nAnd no, I’m not after her money. My only goal is to be financially stable and independent. I like my job which won’t make me rich but I’ll won’t struggle. But I do like her family. We get along very well. Which is important to me.",
            "Q_score": 84,
            "Id": "124t8ts",
            "Url": "https://www.reddit.com/r/Advice/comments/124t8ts/my_33m_girlfriend_29f_isnt_paying_rent_should_i/",
            "Aswer": "Massive red flag. She is very obviously hiding *something* from you.",
            "A_score": 144
        },
        {
            "Question": "Red wine spilled at a party who’s responsible\nI was sitting next to a friend at a small party and she was drinking red wine. She stood up abruptly and my hand bumped her red wine glass. It spilled all over her dress and splattered on the light grey couch and carpet. She was able to get the wine out of her dress. The host of the party had hired someone to help with drinks and cleaning during the party. At that time she acted quick and tried to scrub the wine out of the cushions. She confirmed to me she was able to get the wine out. The following day the host of the party said he was angry with me due to the red wine spill which apparently has not fully come out of the cushions or the carpet. The guest who was actually drinking the red wine confirmed she was able to get the red wine out of her dress. My question is, who is responsible for the red wine stained on the cushions and carpet? I said the person he hired confirmed to me she was able to get the stains out of the cushions at that moment. The host is insinuating that I should pay to replace the cushions, which are apparently not even available for purchase anymore. Who is responsible?",
            "Q_score": 170,
            "Id": "124lgne",
            "Url": "https://www.reddit.com/r/Advice/comments/124lgne/red_wine_spilled_at_a_party_whos_responsible/",
            "Aswer": "The host. Their party, their responsibility. You were an invited guest and unless you purposely set a few small fires or tore plumbing out of the walls, the host bears all responsibility.",
            "A_score": 541
        },
        {
            "Question": "Daughter fell for scam. Need advice on what to do next.\nSomeone contacted her on SnapChat saying he's looking for a sugar baby. My poor daughter fell for it. She sent him $30 via Cashapp so he can start \"processing\" a payment of $5k. He supposedly sent the $5k but there was a holding fee or transaction fee or something so she needed to send more money to release it. Well, she ended up sending $225 via Apple Pay. He claimed he didn't get any money and that she needs to fix it or else. That's when she finally came crying to me because she knew she got scammed. Shortly after, she gets this text on her phone from the \"FBI\". It was a pic of a guy holding a badge saying that they received information she was scamming someone and that she had to reach out to him to fix it or else they were coming after her and her family. Get this, the badge he was holding up was of MOULDER from the X-FILES!! LOL\n\nAnyways, is there anything she needs to do on her end now? Like, close out CashApp or Apple Pay accounts? Close out her accounts tied to CashApp and Apple Pay? Do you guys know what they do with her info? I was so pissed I exchanged some unpleasant words with him via text and he's threatening her now, says he has her pics and knows where she lives. He even saved the messages and screenshotted them. Any advice you can give is much appreciated.\n\nEdit: She called the bank. They froze her acct and will be sending a new card. They said to check back once it’s posted so she can dispute it. We had a talk. I was calm and was not harsh. Thanks guys.",
            "Q_score": 445,
            "Id": "1245gzr",
            "Url": "https://www.reddit.com/r/Advice/comments/1245gzr/daughter_fell_for_scam_need_advice_on_what_to_do/",
            "Aswer": "Stop engaging with him completely. Report his accounts. File a police report; make sure to include his picture. Unless she gave him her log-ins or linked the accounts so he could pull money out, the accounts themselves are fine. If he’d had access, he would’ve already pulled out all the money.\n\nSeparately, have a conversation with your daughter about safety on the internet.",
            "A_score": 574
        },
        {
            "Question": "How do I tell my new doctor I can’t go to work bc I have to shit so much ( in a professional way ) ?\n",
            "Q_score": 63,
            "Id": "124jcwf",
            "Url": "https://www.reddit.com/r/Advice/comments/124jcwf/how_do_i_tell_my_new_doctor_i_cant_go_to_work_bc/",
            "Aswer": "\"I have to move my bowels so frequently that it is impacting my ability to work\"",
            "A_score": 163
        },
        {
            "Question": "My roommate is openly stealing from me and doesn’t seem to understand that it’s wrong. What am I supposed to do\nSo the other day she went through the kitchen without asking me and took all of my cast iron pots and pans and took them to goodwill without my knowledge. I was furious but didn’t say anything. I have found out that she didn’t give it all to goodwill and actually gave a bunch of it to her boyfriend.. I have asked her to get it back from him and she is refusing because she’s not going to take back a gift.. I tried explaining to her that my cast iron stuff doesn’t belong to her even though I have let her use it in the past but she doesn’t seem to understand. What am I supposed to do?\n\nEdit: my parents own the condo I’m renting from. I have told them and my mom is checking on the legality of evicting her from the property as they’ve never had to evict someone before.. hopefully that will work.. also I think I will try and go to her boyfriend about this I’m hoping he will be more reasonable about this..",
            "Q_score": 1223,
            "Id": "123ppeu",
            "Url": "https://www.reddit.com/r/Advice/comments/123ppeu/my_roommate_is_openly_stealing_from_me_and_doesnt/",
            "Aswer": "Options:\n\n1) Police report.\n2) Lock all your stuff in your room.\n3) Look for another place to live.\n\nYou should probably do (3) regardless.  She knows exactly what she’s doing and understands why it’s wrong.  You aren’t going to get her to change.",
            "A_score": 1300
        },
        {
            "Question": "Is it weird to semi-regularly talk to your sister’s boyfriend?\nI’m tired of explaining this but again tonight my boyfriend said it was weird “how much” I talk to my sisters boyfriend, we’ll just say K for brevity. First off, we talk like 2-3 times a week and it’s a few texts that he usually leaves on delivered for days.I’ve known K for like 6 years at this point, even rented an apartment with him and my sister for a bit last year. And I have never, literally never thought about him in any more than a platonic way. I just don’t see him that way. And the thought of doing anything w him makes my skin crawl. Yet my mother, sister, and my boyfriend have acted suspicious and insinuated I liked him multiple times over the years. I don’t want to cut someone off that I genuinely enjoy talking to, but I also don’t want to make my sister or boyfriend uncomfortable by making them feel like I’m doing something shady.\n\nPossible solutions: Block him, don’t block him, talk even less than we already do. But I feel the problem would remain and I’d lose a good friend",
            "Q_score": 32,
            "Id": "124exol",
            "Url": "https://www.reddit.com/r/Advice/comments/124exol/is_it_weird_to_semiregularly_talk_to_your_sisters/",
            "Aswer": "He's your brother-in-law, I'd day it's wonderful you get along and are friends.",
            "A_score": 51
        },
        {
            "Question": "Friend is mad because my husband complimented her?\nA good friend of mine broke up with her boyfriend of 6 years after she discovered he was cheating. She has recently decided to get back into dating, but she wanted the first date to be a double-date for her own comfort. Her date was completely on board and they invited my husband and I. We met at a restaurant. My husband and I arrived first, and my friend showed soon after. Before her date arrived, my husband made a comment to her:\n\n*“That dress looks eloquent (edit: ELEGANT) on you. The color is unique.”*\n\nHere’s the thing about my husband and his family: They give compliments. It’s never sexual or over-the-top, but they all will **occasionally** give nice comments to people they know/trust, regardless of gender, and they do it sensibly, in my opinion. And it’s not always about appearances. It’s one of the things that attracts me to him. \n\nThe dinner went well, we thought. My friend’s date seemed to hit it off with her. But the next day, my friend texted me this:\n\n*“You need to tell _____ to stop making comments about other women. That’s how affairs start.”*\n\nI told her I disagreed. She responded:\n\n*“As someone who was cheated on, trust me, I know. I can’t believe you are okay with _____ looking at my dress. I was pissed off for you.”*\n\nI told her that if she is uncomfortable with him complimenting her then she can tell him herself and that he’ll respect her boundary/wishes. She replied with, *“🙄 Don’t come crying to me when you catch him with another woman. 🚩 🚩 🚩 ”*\n\nI’m at a complete loss for how to approach this.",
            "Q_score": 162,
            "Id": "123y6qi",
            "Url": "https://www.reddit.com/r/Advice/comments/123y6qi/friend_is_mad_because_my_husband_complimented_her/",
            "Aswer": "Sounds like her defenses are up. From what I gather, getting cheated on can really knee-cap a person's trust in other people. She's probably still reeling from the aftermath of being cheated on, herself... \n\nSuppose I'd say just tell your husband that she's not taking well to compliments from men right now, unfortunately, because she's still on edge from her prior relationship. I'd then see if it could become water under the bridge, but if she starts being nasty toward your husband, then that'd merit a more stern talk that she can't be treating people poorly like that.",
            "A_score": 233
        },
        {
            "Question": "i genuinely don’t know what to think or do\nMy girlfriend of six months always brings up her dead boyfriend who died two years ago. she never takes off his dog tags, and she always has his hanker-chief next to her, and smells it every ten minutes. last week she sent me a photo of her in his shirt. any advice??",
            "Q_score": 21,
            "Id": "124c6sa",
            "Url": "https://www.reddit.com/r/Advice/comments/124c6sa/i_genuinely_dont_know_what_to_think_or_do/",
            "Aswer": "sounds like she’s still in mourning and shouldn’t be in a relationship",
            "A_score": 86
        },
        {
            "Question": "Wife cheated at the school she works in, with the janitor. What would you do?\nAs the title says, my wife of 14 years cheated on me with her schools janitor. His occupation has nothing to do with this, just that I am not naming him here.  \n\nI was devastated when I found out that this had happened. One, it happened within a couple days of meeting each other, two I learned of this relationship from my step son the day they were planning on getting a hotel room. My step son had happened to have her iPad, which gets the same messages her iPhone gets, when Janitor guy was sending duck pics to her. My step son is 14 and brought “inappropriate” texting to my attention, and when I saw what he saw I dove in and read everything they said to each other and every photo. I took photos of every text. 3 days is all it took to destroy 14 years. \n\nUpon further investigation she had lied about the day prior which would only have been day 2 where she said she was having to work late to complete a couple reports and a board. That day she had given the guy a hand job at the very least in the school library. I say at the very least because I can prove that with texts and what she confessed to in texts. This happened later in the day after kids have left, but it is an elementary school, middle school and high school all in one. They were in the elementary school if this matters. \n\nMy dilemma is , I am vengeful over this and can’t let it go. We are getting a divorce, but this guy has been unharmed emotionally and physically. I feel I need to have him hurt to make up for my hurt and the hurt our 3 kids are going to go through because of this. This is also something I would say both of them need to stay out of places christen could be present doing this crap. After school activities happen there frequently. I am not sure if there was anything happening that day.\n\nAlso his dick has effected my step so. To the degree he runs from school at the bell and refuses to stay if he thinks he might encounter this man. He has caught his mom texting him still and has asked her to stop. He shouldn’t have to deal with this. \n\nI want to turn him in for having sexual relations in a school. Or for adultery even. I can handle the fact this has happened and I need a divorce. I cannot handle the fact this will be part of the kids lives and my life and this guy gets to walk away. He needs to pay for this.\n\n*****Edit\nThank you all for the advise. I will be seeing a lawyer tomorrow to figure out what options I have. Revenge in any way would most likely cause me more issue. I’m focusing on getting toxic thoughts out of my head and making sure the kids end up in the best possible situation. Which is the only part that scares the shit out of me.",
            "Q_score": 146,
            "Id": "123u2gb",
            "Url": "https://www.reddit.com/r/Advice/comments/123u2gb/wife_cheated_at_the_school_she_works_in_with_the/",
            "Aswer": "You should alert the school to what they did on school property solely for the reason that it happened around children. In regards to wanting him to hurt though, this guy isn't responsible for your failed marriage. He has nothing to do with it. Your soon to be ex wife wouldve cheated with someone else if not him.its not his responsibility to make sure the two of you are being faithful to each other in any way, nor is it his responsibility to make sure your son doesn't see messages between him and your wife. That's completely on you and her.",
            "A_score": 275
        },
        {
            "Question": "nobody wants my father's cats\nmy (14f) father died almost two weeks ago. i guess i'm fine, really. \n\nbut that's not the point. \n\nmy father had two cats: a red one (who he adopted with my mom to give to my aunt, who then gave him back to the as he was always a troublemaker and fell from the sixth floor while playing), who's already old and who he took in after the divorce with my mom (he lived at mom's house before), and a stray one. we adopted her a few years ago. the red one is almost sixteen, and since he comes from a norwegian forest cats cattery he's probably not going to live for many more years, sadly. \n\nwe initially thought to give the cats to my aunt (the same one as before): she already has four cats, and her house is pretty big. she had also told my mother that she was more than happy to help. and obviously it wasn't true. even if it was, however, there would've still been a problem: my aunt's boyfriend. he's unemployed, has two kids who don't want to see him and lives with my aunt and two cousins without paying any money (which is normal, but since he's a literal failure he doesn't even do anything to help around the house. h  literally just likes to sit there and drink wine). when my aunt told him about welcoming two other cats into HER household, he complained about six cats being a big number of cats to take care for (which is also reasonable, but it's important to note that my mom had explicitly told my aunt she was going to help her buy the cats food, and other than that, again, it's not like HES the one taking care of the cats)\n\nmy aunt told my mom that my uncle (her husband) would've been more than happy to take the cats in. the problems with this are so many i don't even know where to start. first of all, my father absolutely hated my uncle, they had never gotten along  for so many reasons that aren't important right now. second of all, he's w ok known for being arrogant, and even after more than eleven years of my mom and dad taking care of it, he still considers the red cat to be his. lastly, the main reason why it would've been great to have my aunt keep the cats us that we live very near to each other, and  i go and come back from school  with my cousins: if the cats were at theirs, i could see them anytime i want (and my brother as well). \n\nthen there are my father's first wife (and my half brother) and his girlfriend. despite having declared themselves animal enthusiasts many times before, they'd just straight up said no, which theres nothing wrong, but acting like you love animals to the point where you feel like it's appropriate to tell two kids (me and my brother) are they're going to abandon their pet turtle in the pond at the park because you think they're  not able to look after it (an actual thing that my dad girlfriend said) and then decline such an offer is kind of hypocritical. \n\nmy grandma was also initially an option, but she hasn't wanted a pet ever since her cat died more than 15 years ago. \n\nat this point you're probably wondering why WE can't keep the cats (even though i'd love to). the reasons are two: \n1. my mom has a deep hatred for cats after taking care of two (red one + his late companion) troublemakers for more than ten years \n2. her boyfriends allergic to cats, and although he doesn't live sixth us he wouldn't be able to even come inside our home.\n\nas of now, the cats are still at my father's house and my father's first husband goes there to give them some food. \n\ni feel really bad because i know the only person that REALLY loved these cats was my father (although my mother has always done her best and i know taking care of two cats isn't easy and she would have to take care of them alone)\n\ni really want to have those cats near me. does anyone have any advice on how to act? i really need that right now.",
            "Q_score": 30,
            "Id": "1245b3a",
            "Url": "https://www.reddit.com/r/Advice/comments/1245b3a/nobody_wants_my_fathers_cats/",
            "Aswer": "Wanting a pet is different than having to take care of ones already within your family. The adults should step up no matter what and care for these animals. If not only to help them but to honor your father. Sorry for you about your loss and obviously the cats' loss too.",
            "A_score": 13
        },
        {
            "Question": "Someone here gonna have to explain what I said wrong?\nSo Prom was a few days ago and I starred talking to this girl and we rly got along and we’re genuinely having a good conversation and it was going well, one of her friends even came over and said they were going and she responded back to her friend “give me a few more minutes” and we continued talking for about 10 more minutes then Prom ended and I got her snap\n\nWe were snapping back and forth for a few days with just random pics then I texted her “Hey” and she texts back “Hi” and then asked her “So what type stuff u into” and then checked my phone a few minutes later and she had blocked me, ima need someone to explain what happened here because I clearly missed something, because I thought things were going pretty good and that we both liked each other",
            "Q_score": 432,
            "Id": "123c6ph",
            "Url": "https://www.reddit.com/r/Advice/comments/123c6ph/someone_here_gonna_have_to_explain_what_i_said/",
            "Aswer": "She obviously thought you ment what sexual shit she's into. And honestly, by how it's written here, I would have too.",
            "A_score": 1348
        },
        {
            "Question": "Brother(20) just had baby girl and doesn't know our dad has SA'd me\nEDIT: securing a new place to stay so I can be safely out of the house in a place my father doesn't know about. Once it's confirmed I can stay I'll be moving my things and meeting with my brother to tell him. I'll edit again once I've moved and told him about how it all goes. Thank you all for your concern and encouragement.\n\nMy brother just had a baby a few days ago and I've been think alot about it and if and how I should tell him about our father. \nAs a child I was the only kid to love with our father and for a few years he would sexually assault me. I want to tell my brother because I feel since he has a little girl he deserves to know so he can make the decision he thinks is best for his daughter but I'm not sure how to tell him, or when. Due to a rough year I had to move back in with our father so I'd have to leave before I told him or it might become a dangerous environment for me and I just don't know what to do about it. Any help would be greatly appreciated, thank you.",
            "Q_score": 110,
            "Id": "123kvar",
            "Url": "https://www.reddit.com/r/Advice/comments/123kvar/brother20_just_had_baby_girl_and_doesnt_know_our/",
            "Aswer": "If the roles would be reversed, and your brother was in your shoes and you in his. Would you want to know?\n\nDamn sure you would! When questioning if the truth should come out....it always should in these cases.\n\nAnd please move away from you father, how old are you?",
            "A_score": 156
        },
        {
            "Question": "my parents are making me feel bad about going to the mental hospital\nI’ve (16) recently been having thoughts about harming myself and told my teacher yesterday, then the police came to my house to do a welfare check and they told us to go to the hospital. My parents were VERY mad at me and were like ‘you know that’s wrong’ ‘don’t do that again’ ‘why did you do that?’\n\nbut is it my fault for feeling this way? why should I feel guilty about thoughts I can’t control or how I feel towards myself and my life?",
            "Q_score": 28,
            "Id": "123s6b5",
            "Url": "https://www.reddit.com/r/Advice/comments/123s6b5/my_parents_are_making_me_feel_bad_about_going_to/",
            "Aswer": "You did the right thing by opening up to the teacher and the teacher did the right thing to report this. Your parents were probably taken by surprise and will need time to get used to the situation. If they manage to think seriously about this, then they will realize that they might have lost you forever if you hadn't spoken out about your thoughts.\n\nYou did the right thing! Now the process of healing can begin for you!",
            "A_score": 25
        },
        {
            "Question": "I (25m) got into a physical fight with my roommate (23f) last night. Need advice on what to do next\n\nGot into a physical fight with my roommate last night. Feel like shit today and idk what to do\nSo I (25m) have a couple roommates living in a house that I bought. One of them is always at his girlfriends house and we barely see him. The other (23f) is always home when I'm home and has been having mental health issues lately.\n\nShe often has LOUD crying fits in her room after work. She's been awful to be around and is always down and cranky. I feel horribly sorry for whatever she's going through and I want to help her but I'm just becoming so exhausted.\n\nA couple nights ago I came home and she had broken a lamp in her room and left the shards all over the carpet. She said she didn't care enough to clean it up.\n\nLast night, I found her self harming by jabbing the blunt end of a skewer into her thigh over and over and she had bruises everywhere. My first instinct was to grab her arm to try and take away the skewer. So I grabbed her wrist and I admit I had to grab it very hard because she was fighting me.\n\nAnd then she started screaming at me to let go so I did. She came at me and started hit my head saying I need to fuck off and mind my own business. So I was grabbing her arms again trying to calm her down. I got away and left and stayed the night with my other roomy and his girl.\n\nToday she texted me pictures of the bruises I left on her arms. And was basically threatening me not to touch her again.\n\nI don't think she would contact the police but I'm super on edge. Im at work right now and I don't wanna go back home. I don't know what to do next...",
            "Q_score": 22,
            "Id": "123tmr9",
            "Url": "https://www.reddit.com/r/Advice/comments/123tmr9/i_25m_got_into_a_physical_fight_with_my_roommate/",
            "Aswer": "Your next step is to move out and never speak to her again. Not because you did anything wrong per se, but because you won't be able to win under any circumstances.",
            "A_score": 43
        }
    ]
}