{
    "Posts": [
        {
            "Question": "My cousin is asking for sexual favors\nI’m 17F and he’s 27M. My entire family is kinda fucked up, so I like to stay away from them but when we go on trips he’s always there, and my parents allow him and his family to visit us. \n\nOver text and phone calls he’s always asking me if im interested in having sex, I usually brush it off cause wtf… who says that? But last night he sent me over $100, asking if I’d send him nudes. I said no, and he sent me a pictures of his nudes. ( he’s also in the army)\n\nHe also has said he likes that I’m skinny, because I’m “easier to bruise and hurt”. I’ve since blocked him but how can I explain this to my parents, I don’t want to be around him ever again and I’m not sure how to tell them, or if they’d think I’m being dramatic or lying.\n\nUPDATE: I told my dad, he’s extremely pissed, he spoke to his dad, and his dad said this isn’t the first time he’s done this. His dad kinda brushed it off, we’ll see where we go from here\n\nThanks In advance.",
            "Q_score": 606,
            "Id": "11ny2md",
            "Url": "https://www.reddit.com/r/Advice/comments/11ny2md/my_cousin_is_asking_for_sexual_favors/",
            "Aswer": "Tell your father and show him the texts.",
            "A_score": 540
        },
        {
            "Question": "Wife’s Friend Is Cheating.\nAs the post says, we learned that my wife’s friend is cheating on her husband. We’ve all known each other for years. We want to tell him, but her friend says she will tell him when she’s ready. What should we do?",
            "Q_score": 475,
            "Id": "11ntiri",
            "Url": "https://www.reddit.com/r/Advice/comments/11ntiri/wifes_friend_is_cheating/",
            "Aswer": "I dunno, I sure wouldn’t want to have to answer the question “You knew? Why didn’t you tell me?” You’re supposed to tell on the person doing the shitty thing, not protect them. And that’s exactly what you’re doing.",
            "A_score": 704
        },
        {
            "Question": "My client is “openly racist” to white people, how do I deal with her?\nAccording to my boss (who is black) she warned me that she is “openly racist to white people”, and it’s quite obvious. Anyone on our team that is white she constantly belittles, insults, and blames. She has used cuss words when speaking to us, she gives me attitude every time I open my mouth, and has made multiple people have panics attacks and cry due to her extreme rudeness. \n\nShe will not allow my white boss to be on any communications with the them even though shes been on the account for years and if she is accidentally included, she questions it and gets mad. She does not act like this to any of our black employees. Not sure if you can call it racism cause I know people say that can’t be experienced by white people, but damn she’s making my job hell.\n\nI’m constantly stressed and anxious because I know if anything bad happens, even if it’s HER FAULT, she will somehow blame me or my white boss. I feel like I can’t talk or ask questions because she will get mad. Our bosses know about this and we all hate her but they are trying to get them to resign our contract so they won’t say anything. \n\nAny advice or suggestions on how to deal with this? I feel terrible especially for my white bosses who take constant insults and rudeness from her and have continuous panic attacks over it.",
            "Q_score": 387,
            "Id": "11nu94t",
            "Url": "https://www.reddit.com/r/Advice/comments/11nu94t/my_client_is_openly_racist_to_white_people_how_do/",
            "Aswer": "Document everything. Get everything in email or writing and save printed copies. Any time there is a question, email for confirmation. \n\nAny time she does anything racist in writing, email, etc, document it and save a copy. Have others do the same.",
            "A_score": 647
        },
        {
            "Question": "Was I groomed by my teacher at 15? My therapist says I was. I’m now 24 and the teacher is suddenly emailing me.\nThis is my first time using Reddit, so apologies in advance if i’m doing anything incorrectly and sorry if this is too long.\n\nI was very close to a teacher at school when i was 15/16. She was a woman (29) and so am I. I suffered badly from panic attacks, anxiety, grief and depression. She would always comfort me and help me through it. She was caring and very good at teaching her subject. But some of her behaviour left me feeling very confused and uncomfortable. \n\nShe would discuss her personal life with me, including details about her relationship with her boyfriend and her sex life. She’d say to me that i was one of her favourites, compliment my appearance sometimes and touch me often - like cradling my face or stroking my hair. She’d often stare at me intently during class/around the school and mistakenly say my name when talking to another student or compliment me to other students.\n\nI found all of this really overwhelming and her intimidating. This led to me getting palpitations around her, feeling sick, weak/shaky or like i’d pass out in her class. I couldn’t eat my lunch before her lessons because i was afraid of how her behaviour made me feel. I always thought I just had a crush on her because she was a great teacher, attractive, and young. It made me question my sexuality at the time. \n\nAfter I left school in 2015, we stayed in touch for a few years through her school email very occasionally. I then found out that she’d left the school and heard nothing from her for 4 years.\n\nI’m now 24 and suddenly a few days ago, she emailed me through her personal email and I was shocked. I got the same feelings of nausea, shakiness and breathlessness that I got in her class. She said in the email that because it was International Women’s Day, she thought of me and wanted to check how I am (odd?). She told me that she’d left the school and also left teaching and she hopes i’m “continuing to be amazing”.\n\nWhen i told my therapist about this all, she said that I had been groomed by my teacher at 15 and I was made to feel special by her, which then made me feel like I had a crush on her. \n\nI’m finding it difficult to process because i thought this teacher was a good person and someone i missed, looked up to and loved. Am I in denial that I was groomed? Did she take advantage of me? I feel like what if I’m making things up and the lines are blurry. The idea of “being groomed” makes me feel very upset, angry, almost ‘dirty’ and traumatised :(",
            "Q_score": 47,
            "Id": "11oagaf",
            "Url": "https://www.reddit.com/r/Advice/comments/11oagaf/was_i_groomed_by_my_teacher_at_15_my_therapist/",
            "Aswer": "I would listen to the therapist.\n\nWhat the teacher did while in school was not right. Yeah, she was there for you when you had panic attacks, anxiety, and grief, but she crossed the line and wasn't professional. She rook advantage of her position.  The one thing some of these people like to do is cause confusion so they can be in control. My suggestion is to ignore her, but whatever the therapist says or thinks.  Whatever you decide to do is up to you, but I would stay away from that woman.\n\nYoi have come a long way since that time, and you don't need a relapse. You're strong.  Don't be sorry for how long your post is. Look at how long my comment is. I wish you well, and have a wonderful weekend. Trust your therapist.",
            "A_score": 52
        },
        {
            "Question": "Came across my son's internet browsing history and I feel disgusted\nI am a 37 year old single mom to a 15 year old son. I was an orphan and was raised by my aunt and uncle who I didn't have a great relationship with and ended up running away at the age of 16. For 6 years after that I had been involved in a series of bad relationships and bad decisions and once my son was born, I promised myself that I would raise my son in a proper manner.\n\nI inculcated in him the idea of being open and sharing even if he he did something wrong. I never believed in punishment and always openly spoke and discussed things if he did something wrong. I worked as a waitress and for a while as a  stripper and have been subject to harassment quite often.  I was really disgusted with some of the men and I made sure that I thought my son the importance of respecting the human body. Growing up I was comfortable being nude around him till around a couple of years back where I started being a little conservative. I still pretty  comfortable being in underwear around him or walking around the house with no bra under my clothes.\n\nLast week, my laptop wasn't working, so I decided to use my son's computer. He wasn't home that day and I tried calling him to ask him if it was ok to use his computer. He didn't answer and I desperately wanted to get some work done, so I decided to use it anyway. Luckily I knew his pin and I was able to login. A part of me knew that as a teenager, he probably would be seeing porn, so I kept myself ready not to be judgemental and I even went to the extent of opening up an incognito window. I didn't realize that even in incognito, the auto suggest showed history. I was appalled when I saw my son has been watching incest themed porn, specifically mother and son.\n\nI don't know what to do and how to confront him. One one hand I don't want to show that I broke his trust and accessed his personal computer. I've personally done some research and also found out that this sort of porn  was not really uncommon . Ever since that day, I've been feeling uncomfortable about being around my son and feel a little violated . I want to talk to him about it, but I'm unsure how to go about it .\n\nEdit: Thank you for your advice, I've decided that I will see a therapist for myself first. Some of you pointed out that I shouldn't be roaming around in my underwear in front of my son , but do you think that is really something that has gotten inside my sons head? For e.g. How do we define what is appropriate or what is in appropriate? \n\nIt could be that I am over thinking things. My biggest fear is losing my son. He has been a constant in my life and it scares me knowing that I might push him away.\n\n&#x200B;\n\n&#x200B;",
            "Q_score": 22,
            "Id": "11oct81",
            "Url": "https://www.reddit.com/r/Advice/comments/11oct81/came_across_my_sons_internet_browsing_history_and/",
            "Aswer": "Do nothing it’s actually really common and by no means means wants to have sex with you. A persons fantasy’s are private and there is absolutely no upside to mentioning it.",
            "A_score": 80
        },
        {
            "Question": "Need advice. Is this cheating?\nI feel so broken. My husband of 15 years, been together 25 did something that really upset me a month and a half ago, and instead of apologizing, he has been acting like I don't exist..(which is the cycle in our marriage, it happens almost every month) not talking to me, acknowledging me..just spending all of his time with our kids until there a huge blow up and we rencile after months and months of this treatment.\n\nWell, one of our daughter's friends mom is a widow. My husband has jokingly said in the past that if anything happens to me that she can be his sugar mama as she has a full time job and a house and I'm a stay at home mom with no income coming in.\n\nWell, we're at a soccer game the other day and our daughters (mine and the daughter of widow )are playing in the gym. I'm sitting next to my husband on the bleachers and we're not talking. I look over and he's texting the mom asking if she was able to make it (she wasn't there yet). I flipped out, demanded to see the phone and its a bunch of texts.\n\nSome background..our daughter went over for a playdate a couple weeks ago and my husband picked her up. They didn't come home for an hour, even though they live 10 minutes away. When I asked my daughter why it took so long, she said that the girls didn't want to stop playing and that my husband and the mom were in the kitchen talking.\n\nA week after that, we had her daughter here for a playdate. That night, husband texted a picture of our dog in the snow as he was taking her for a walk saying \" See, this is what you have to deal with when you have a dog lolol\" and then they were texting about that.\n\nThere were like 15 texts back and forth that I could see and a smiley a face from her that seemed to be in response to something he said that I think he quickly deleted before handing me the phone. I was SO upset and in the middle of a crowded gym so I really couldn't absorb everything. I know there was nothing sexual.\n\nI am so upset about this as I consider it cheating, but he is saying I'm crazy. He hasn't spoken to me in months, he's sitting next to me on the bleachers texting this woman as I'm sitting there. I feel so hurt, emotionally violated and disrespected.\n\nAm I being crazy or is this completely unacceptable behavior?",
            "Q_score": 86,
            "Id": "11o3b56",
            "Url": "https://www.reddit.com/r/Advice/comments/11o3b56/need_advice_is_this_cheating/",
            "Aswer": "Like, whether this is cheating or not, are you happy in this relationship? It sounds *super* lonely.",
            "A_score": 314
        },
        {
            "Question": "Bullying in kindergarten teachers and principal are powerless to address it, help!\nHi All, begging for some advice here.\n\nLong story short my daughter is getting bullied and on occasion, pushed and shoved around by a bully in her class.  There have been 4 occurrences within the last 6 weeks of bullying to the extent that my daughter is throwing up before school due to anxiety and has now missed a number of days.  This is Kindergarten for Christ's sake.\n\nWe have sent 4 emails detailing each occurrence.  The teachers and principal are involved, and after the 3rd occurrence, the parents of the bully were informed.  After this 4th occurrence we again sent an email and the principal essentially responded with \"all we can do is inform the other parents\".\n\nThis tells me that the school cannot address bullying.  They have told me they have \"safety plans\" but won't go into detail what those plans are, except that they are designed to address bullying etc.  Clearly these plans are not working.\n\nI'm really thinking that either the school is trying to protect itself, or that the teachers and principal have had their wings clipped to the extent that they can't actually use discipline etc.  I'm at a loss as to what to do here.\n\nI'm thinking of either escalating to the school board and / or engaging the media at this point.  Is this advisable or can anyone think of a better alternative?  I really don't want my daughter to switch schools.\n\nThanks",
            "Q_score": 260,
            "Id": "11nr53y",
            "Url": "https://www.reddit.com/r/Advice/comments/11nr53y/bullying_in_kindergarten_teachers_and_principal/",
            "Aswer": "This happened in our school. The parents of the bullied child threatened restraining order. This action alone made the school change the bullied child's classroom. The special ed dept had been trying to manage the situation internally but after the restraining order threat, they sent the bully to be outplaced.",
            "A_score": 264
        },
        {
            "Question": "I am really scared of zombies\nSo i am 14 years old and i am extremely afraid of zombies, every night i fear one of them somehow might get in my house or something like that and it usually keeps me up, i feel really bad about it because i am too old to be scared of such nonsense and i myself know they’re not real, but something about them is uncanny enough to scare the living shit out of me every time i see them in pictures/movies/shows, i try my hardest to stay away from any kind of content related to that but they are so popular i usually still catch a glimpse of them before going to sleep, do you have any advice to get rid of my fear?",
            "Q_score": 81,
            "Id": "11nmanh",
            "Url": "https://www.reddit.com/r/Advice/comments/11nmanh/i_am_really_scared_of_zombies/",
            "Aswer": "Good news: there have been zero zombie- related deaths or injuries in the last 14,000 years.",
            "A_score": 410
        },
        {
            "Question": "My bestfriend sends me (a guy) a D pic and now idk what to do.\nHi I'm a guy and this has never happened to me before, I'm also not the best in social situations being autistic and awkward. This morning my best friend where chatting like normal, even making the few innuendo jokes like most guys do, just a bit of banter, when he started talking about having a hard on and sent me a d pic. I didn't appreciate this, I'm straight and seeing another guys private parts does make me feel a bit sick, I tired to ignore it and made more banter and told him to not do it again, he apologised and we continued talking like usual, but I can't help but think why, is this normal behavior around guys? Or is it something else that I don't know about, as far as I know he's straight so I'm just confused, anyone got any advise?",
            "Q_score": 69,
            "Id": "11nlgxs",
            "Url": "https://www.reddit.com/r/Advice/comments/11nlgxs/my_bestfriend_sends_me_a_guy_a_d_pic_and_now_idk/",
            "Aswer": "Its certainly not classy behavior. He's potentially not entirely straight or just somewhat the clown. If he's under 18 he just sent you child porn and I would make it clear in text that you never what to receive that again and delete and empty the trash on the phone.",
            "A_score": 78
        },
        {
            "Question": "Hey guys, how do I get myself not to talk too much?\n",
            "Q_score": 43,
            "Id": "11noeky",
            "Url": "https://www.reddit.com/r/Advice/comments/11noeky/hey_guys_how_do_i_get_myself_not_to_talk_too_much/",
            "Aswer": "Ask people questions, then they will talk more",
            "A_score": 75
        },
        {
            "Question": "EX GF spread false allegations that I'm an abuser and it cost me my dream job.\nTitle says it all. My ex (as of 19 months ago) contacted me about a month ago about a kitchen utensil she wanted back. I told her I would get it to her but was busy with my job, and wouldn't be able to get it to her until the next week. When I returned from my trip, she had made an account on social media impersonating me and making fun and slandering my name. I told her to take it down or that I would get the authorities involved and she called me an abuser and asked me to leave her alone.\n\n2 hours later my friend calls me and tells me about a video on her story that states that I'm an abuser. I go to the police and do the legal stuff.\n\n3 weeks later (yesterday) I received a message informing me that I was no longer employed, and was wished the best of luck. This job was my DREAM. It was the perfect job for me, the one I'd grew up wanting. I called a coworker and they agreed that it was because of her messaging my boss and telling him i abused her when we dated and am still now. Now I'm in debt, can't pay bills, and feel lost and defeated. I'm blown away that this whole thing got this far, and I don't know what to do.\n\nTLDR: Ex gf accused me of abuse back when we dated. Now I've lost my dream job, have rumors effecting my work and life, and am financially in a bad spot.",
            "Q_score": 105,
            "Id": "11niu6f",
            "Url": "https://www.reddit.com/r/Advice/comments/11niu6f/ex_gf_spread_false_allegations_that_im_an_abuser/",
            "Aswer": "Did your boss actually hear your side of the story, or did they just decide for themselves what your ex is saying is true?\n\nIf they fired you without hearing you first, you could get yourself some legal help (something you should anyway for suing your ex).",
            "A_score": 166
        },
        {
            "Question": "Our mom is out of town and we want to take some pictures of us being unsupervised kids that are up to no good, we are in our 30's, any ideas?\n",
            "Q_score": 814,
            "Id": "11n0dvn",
            "Url": "https://www.reddit.com/r/Advice/comments/11n0dvn/our_mom_is_out_of_town_and_we_want_to_take_some/",
            "Aswer": "Big snack piles, marker to the wall, an R rated movie. Just think of all the things you wanted to do as a child lol \n\nThis is hilarious I love this idea.",
            "A_score": 851
        },
        {
            "Question": "I found 10,000 in my buildings parking lot.\nI just moved in. 10,000 in an envelope that i can tell has been in someones pocket. A ton of people live here and multiple buildings. Im hesitant to give it to management bc i dont want it to not get delivered to whoevers money it is. What would you do? No this is not a joke lol",
            "Q_score": 1154,
            "Id": "11muxxf",
            "Url": "https://www.reddit.com/r/Advice/comments/11muxxf/i_found_10000_in_my_buildings_parking_lot/",
            "Aswer": "Just hold it and wait.  \n\nAnyone you give it to is going to potentially keep it.  EVERYONE.  Cops, management, etc ... if you're set in your heart to do good, HOLD IT, say nothing, and listen like a doormouse.  Someone will talk about losing it.  \n\nBUT if you talk about finding it ... you are most assuredly getting assaulted, robbed, or accused.",
            "A_score": 3814
        },
        {
            "Question": "My partner split up with me, 6 months later texting me about dental bills\nWhen I lived with my partner I paid for a discounted dental plan for both of us through my employer's scheme. He insisted it wasn't working between us and I needed to move out. I texted him a month later to say I needed to take him from my insurance. He asked if he could pay to keep me on it. I said I'd look into it, I did and it was pretty clear that it was a plan for me and my partner so I notified HR who changed all of my policies to be me only. I didn't tell him as I was trying to move on and not have too much contact.\n\nA few months later he asked if he was still on my insurance. I said he wasn't and he texted me back saying I didn't tell him and now he has dental bills. I did tell him but I also told him I'd look into keeping him on and didn't update him.\n\nSome time later he texted me about how his energy bills are going to bankrupt him.\n\nToday he asked me again if he was definitely not on my insurance. Of course I said no and then he told me he'd got a £3k bill to pay. I told him when we broke up he was no longer eligible for cover. He texted back \"oh dear\", then suggested I could move in until he's paid for dental work. \n\nI just feel incredibly guilty about it. If he was still with me the insurance would cover some of the expenses. Just the idea of him struggling with everything is eating away at me. I almost want to just send him a cheque to cover his bills.",
            "Q_score": 147,
            "Id": "11n1h4y",
            "Url": "https://www.reddit.com/r/Advice/comments/11n1h4y/my_partner_split_up_with_me_6_months_later/",
            "Aswer": "Please don't do that. He was the one who ended things, not you. You owe him nothing.",
            "A_score": 458
        },
        {
            "Question": "How can i explain to my gf that adding a bathroom to a new home isnt a priority?\nMe and my gf are in the final stages of purchasing a new home and we have all kinds of ideas to improve and customize an already renovated  home to our liking.  It’s a single family 2 bathroom 4-1/2 bedroom house. In the top floor where we are going to have our master bedroom does not have a bathroom. My gf always wanted a third bathroom to be added which isnt a problem to me, because the two bathrooms are in the middle and basement floor respectively. \n\nUpon getting the house inspection done, it has been revealed that the water heater, and hvac system is 3-4 years past its  life expectancy and i would like to have that replaced before all other improvements are made. To me, it takes more of a priority over a bathroom because #1, a third bathroom isnt absolutely needed, Its more of a want imo and #2, the other two bathrooms have been renovated and look very good aesthetically. \n\nMy gf doesnt look at the hvac situation as seriously as i do and is dead set on this bathroom. She doesnt seem to be budging on this. What do you guys think? Btw, i would do both repairs/additions at the same time, but money plays a factor. The price to add a bathroom could be the same or more as the hvac system. We haven’t moved in or gotten proper estimates yet.",
            "Q_score": 221,
            "Id": "11mstbg",
            "Url": "https://www.reddit.com/r/Advice/comments/11mstbg/how_can_i_explain_to_my_gf_that_adding_a_bathroom/",
            "Aswer": "I will add, that I can see her point about wanting a bathroom on the same floor as your bedroom.   It will be a pain in the ass to go up and down stairs when you have to pee in the night.   I would really hate that.   \n\nHowever, working AC and water heaters are necessities.",
            "A_score": 598
        },
        {
            "Question": "How do I ask school admins to change playground rules?\nI have a really great 10 year old 4th grader. Smart, funny, kind and helpful. I may be biased but overall a mature and lovely person. She attends a newer public school, part of the inaugural kindergarten class so there for 5 years now. The school just put in a playground a few weeks ago and obviously the kids are all very excited. \n\nApparently, the admins have decided to put some rules in place, which makes sense in general. However, they have also assigned a group of students to be the \"safety committee\" to make sure the rules are being followed. These kids walk around during recess with clipboards and write names down. This doesn't sit right with me to begin with, but I'm having a hard time articulating why.\n\nI have not received a copy of the rules, but my kid says things like no running (um ok, shouldn't kids run and play outside?), 2 kids on the bars at a time, 5 \"tricks\" on bars (like flipping over), 20 swings on the swings. So the safety committee stands around with clipboards and write down names of rule violaters and if your name gets on the list 3 times you go to the principal. \n\nThis by itself just sounds so stupid to me so I'm looking for advice on how to approach this with the school. \n\nAdd to it that it seems no one informed the kids about the safety committee so all of a sudden there's just a bunch of narcs floating around giving kids anxiety about the threat of being in trouble.\n\nTop it all off with the fact that one of the kids on the safety committee was bullying my kid last year (nothing major but it was a friend that was jealous my kid was starting to spend time with other friends and bad enough that the bully was moved to a different class). So this bully is now targeting my kid and basically standing there watching them specifically every day. My kid tried to speak to admins without bringing up the bully specifically, just the rules and committee in general, and was basically told these are the rules and to deal. \n\nToday the bully told my kids teacher that they are watching closely since my kid breaks rules often. My kids teacher said that doesn't seem fair but didn't do much about it and suggested my kid write a letter to the admins. \n\nAny advice on how to approach this and make strong arguments against a safety committee of kids and general dumb playground rules?",
            "Q_score": 21,
            "Id": "11n6f7p",
            "Url": "https://www.reddit.com/r/Advice/comments/11n6f7p/how_do_i_ask_school_admins_to_change_playground/",
            "Aswer": "This is definitely something I feel you could raise a lot of very valid concerns about to the school. It is *an adult's* job to supervise children. What are their teachers doing during recess? Why aren't they able to supervise? Giving kids little jobs like Line Leader or Table Cleaner is a normal thing to do, but you have the kids switch out jobs every day or so, so everyone gets a turn, and you don't give some kids authority over other kids. There's no way that doesn't lead to bullying. I can almost guarantee that your kid isn't the only one getting unfairly targeted, so if you ask around the other parents you could get a whole group together to bring this up at a PTA meeting or something.",
            "A_score": 32
        },
        {
            "Question": "Should I break off the wedding? Fiancé hates my dad to the point of hurting me\nEdit: explaining what fiancé did to provoke dads behavior-he was having a bad day at work and yelled and was cussing not really at me-but in general. He also threw a drawer straight down on the floor because of how worked up he was. Once again none of it was at me or directed towards me in any way. But my dad felt like you shouldn’t talk to my daughter in that way-“she’s a lady.” When he confronted my fiancé my fiancé said “I shouldn’t have acted that way BUT-I was mad. My dad blew up because he felt since my fiancé had to throw a BUT in there-he wasn’t actually that sorry.\n\n\nI was raised by a single dad. My dad has a lot of faults-one of him is the way he talks to people is disrespectful and he has a temper. He never physically hurts anyone but he’s not afraid of cussing someone out. I know he has wrongs but I also see the damaged side of him and what he went through after mom left. So I still love him for all the years he was hurt and raised me. \n\nAbout 2 months ago my dad got in a huge fight with my fiancé. My fiancé was initially in the wrong. Dad got to the point where he went to my fiancés work and cussed him out in front of his boss. And then went and told my fiancés parents all his issues he has with me marrying my fiancé. \n\nI called my dad and yelled at him and told him he went way to far and didn’t talk to him hardly for like 2 or 3 weeks. But I still love dad. As wrong as he may be. My fiancé has not dropped it since. He brings it up about once a week how much of a jerk my dad is and how much he hates him. After I told him he needed to let it go because it was causing us to fight he stopped talking about it as much. But still brings it up occasionally. I try to let him get his temper out but then he will say something like I never want your dad at the house again. If you want to see him it can’t be on my property. And I think to myself he hates my dad so much that he’s willing to hurt my relationship with my dad because of what he did? Like I feel at that point he’s ok with hurting me. \n\nI try to explain to my fiancé that I know my dad did a bad thing but I feel he doesn’t care about my feelings when he’s making me take half the punishment by saying I don’t want your dad to ever come over and see our new house. But he sees it as me defending my dads behavior. I’ve tried to make him see my perspective for months. And I’m also trying to register how much my dad embarrassed him and of how my fiancé is acting is justified in any way…..\n\nShould I break this or not?",
            "Q_score": 305,
            "Id": "11mfd2v",
            "Url": "https://www.reddit.com/r/Advice/comments/11mfd2v/should_i_break_off_the_wedding_fiancé_hates_my/",
            "Aswer": "ESH? Wrong sub, but I stand by it.\n\n1. Your fiance throwing a drawer because he was mad about work is a major red flag.\n\n2. Your dad *going to your fiance's work and his parents* is WAY overstepping.\n\n3. Both these men seem to have serious anger issues, and need therapy. I think you could use a break from both of them.\n\n4. I strongly recommend you seek therapy, too, because growing up with your dad's anger issues seems to have normalized it for you, and that can set you up for making excuses for romantic partners with anger issues, too.",
            "A_score": 1201
        },
        {
            "Question": "I am dying, I don’t want people to know. What should I do?\nI just started therapy so Reddit is not the only place for this but I am feeling alone. I don’t want to tell people I have less than a year to live. I’m so fucking exhausted. Chemo is horrible. My body is failing me. I have nothing left to live for and I don’t want to be around my crying family and friends. I don’t want anything anymore but to just hurry up and die. Sorry I know it’s morbid but it’s how I feel. Can barely type this. The hospital is depressing and I feel like I’ve done nothing in life worth anything and I’m only in my twenties. How do I feel better again and does it even matter if I do if I’ll be dead soon anyways? Idk anymore",
            "Q_score": 188,
            "Id": "11mi3go",
            "Url": "https://www.reddit.com/r/Advice/comments/11mi3go/i_am_dying_i_dont_want_people_to_know_what_should/",
            "Aswer": "I understand how you feel. I was a terminal cancer patient with no options. I had cancer before but was stage 3, then 10+ years later it came back much much worse. \n\nMy doctors were fantastic and called all over the country to see if they could find anyone with my specific diagnosis. They found a hospital that had done an experimental procedure 3 times. Out of those one worked, the others passed.  I had 4-6 months left or try this experimental procedure which could be deadly. \n\nMy family and friends were completely sympathetic but I alone had to deal with my decision either way. \n\nI decided to do the experimental procedure. I was scared shitless and consistently depressed. I was heavily medicated for anxiety and panic attacks. I couldn’t get out of my own head for a long time. Fortunately I’ve been in remission for 2 years. The other person who had the procedure and lived has now died. I don’t know how long I have months to 20+ years. I’ve been where you are and I could be again. It’s all a mystery. \n\nPlease don’t give up and find just one person, even another terminal patient, to talk with. Having a horrible situation in common can be cathartic. \n\nPlease feel free to message me if you would like to talk. I’m sending you healing and peaceful vibes.",
            "A_score": 173
        },
        {
            "Question": "My boyfriend (23m) is a dealer and won’t get a legal job what do\nHello everyone, I (22f) am having a hard time with my bf (23m). We have been together for almost 6 years, as the title states he is a dealer. I have been trying to encourage him to get a job for years, and he acts like a complete man child about it, he has a temper problem when it comes to any kind of authority over him. Other than that we really don’t get into disagreements so it makes this harder for me. When we started dating we only did it because it was what we had to do if we wanted food or shelter, but now he’s became lazy. He just wants fast easy ways to get rich (y’all don’t even know how many crypto scams I have prevented him from giving our savings to) and not put in effort for anything he wants in life. Obviously I can’t just change him and make him work, but idk what to do anymore and I’m tired of it. To make things worse I’m a very introverted person and don’t have any near friends I could just move in with if I decided to leave. I hate saying I’m with him only for financial reasons because I do really love him, but ultimately if I had the money I would have been gone long ago. He just keeps saying he’s going to get a job as an “entrepreneur” but as I said he wants everything handed to him with no effort.  Anyways what can or should I do?",
            "Q_score": 358,
            "Id": "11mb9g6",
            "Url": "https://www.reddit.com/r/Advice/comments/11mb9g6/my_boyfriend_23m_is_a_dealer_and_wont_get_a_legal/",
            "Aswer": "Stop trying to change his life, and start focusing on changing yours so you can work towards leaving him.",
            "A_score": 690
        }
    ]
}