{
    "Posts": [
        {
            "Question": "How can I stop masturbating for 10-12 hours a day?\nHow can I stop masturbating for 10-12 hours a day? Yes, this is a serious question and not a troll even though it may sound like one. I know, it's weird. I've been addicted to masturbation, edging, and porn since I was 12 years old, and my addiction has never been worse than it is right now.\n\nTo break it all down for you, I typically edge to porn for around 10-12 hours a day, sleep for 4-6 hours a night, and then spend the remaining 6-8 hours of my day getting my priorities done (going to class, studying, and doing my homework). I'm still doing well in all of my college courses, and I enjoy learning and feeling successful by getting stellar grades. So at least that hasn't changed for me. \n\nBut besides that, I just masturbate for 10-12 hours a day and sleep for a little bit. I can't even remember the last time that I slept for more than seven hours in a single night. It's probably been around two months now. I wish that I could stop, but I don't really have a reason to at the same time. I don't have a girlfriend to make love with or anything. \n\nSo, how can I stop? At the end of the day, I do realize that this is really unhealthy and that I need to get rid of this addiction.",
            "Q_score": 453,
            "Id": "11rj1j7",
            "Url": "https://www.reddit.com/r/Advice/comments/11rj1j7/how_can_i_stop_masturbating_for_1012_hours_a_day/",
            "Aswer": "This is above Reddit's pay grade, right into professional help territory.",
            "A_score": 1787
        },
        {
            "Question": "am I (19) silly for giving money away to the homeless?\n\nI (19) have moved to a city with a big homeless population and walk by homeless people everyday on the way to school, mall, whatever. i always feel super bad and today i gave 20 dollar bills to 2 people separately, 40 dollars each because i just felt bad for them. one women was on the street looking sad and disheveled and she said god bless u which made me happy as someone kinda religious. the other guy had a sign saying he was in a fire and he looked it so i gave him a twenty after debating with myself (i was gonna give a five but felt bad and figured i didn’t need it). i know this seems like i’m bad with money maybe? i’m worried but i figured i would just spend that on weed so i was better off doing this. i don’t know if this is reckless spending but my parents gave me spending money and i’m worried they would disprove ig. also i heard “reckless spending” is a result of mental illness and i’m not sure if this qualifies?",
            "Q_score": 188,
            "Id": "11rlbzw",
            "Url": "https://www.reddit.com/r/Advice/comments/11rlbzw/am_i_19_silly_for_giving_money_away_to_the/",
            "Aswer": "Here's my point of view, as someone who was on the streets for 7 years. I was always grateful regardless if it was 50 cents or 100 bucks that someone would kick down to me. So I'm sure they are grateful and really do appreciate you helping them out. 20 bucks doesn't seem like a lot, but when you're on the streets you can make it go far. Sure I'd buy alcohol, and I was mostly honest about it, (Yo, can you spare some change for alcohol and I promise you I won't buy food) was my line, but most the time I'd buy food lol. \n\nSo they'll more than likely will be getting their fix or maybe they'll get food, but now when I give back, after the money leaves my hand to theirs it's really none of my business what they spend it on. I normally say \"Get whatever you need\" when I give people money. \n\nI personally don't think it's foolish, but at the end of the day you need to be sure you can take care of yourself. Sorry if this makes no sense, was a long day.",
            "A_score": 204
        },
        {
            "Question": "I Think My Husband Could Be Plotting To Kill Me\nTL;DR Discovered my husband has for a while been telling people I'm suicidal, and am generally mentally unstable. It's occured to me this could be part of an attempt to make it look like I commited suicide if I were to die suddenly. Am I being paranoid?\n\nI (26f) Have recently found reason to suggest my husband (29M) could be plotting to kill me and make it look like a suicide.\n\nYes, I realise how out there that sound, let me explain-\n\nMy reason for thinking is is because I discovered he has been secretly telling people we know, for a while, that I am apparently suicidal, along with other things to make me seem mentally unstable, as far as lying about having to call the police because I was a missing person. Recently the thought came to my mind, that this could be a way of making my death appear like a suicide, if he were to kill me, and I wanna share those thoughts to see what others think \n\nIt started after he one night told me not to go into the local store he works at, as he left early and had apparently used me as an excuse. Then not long after he happened to leave his messages open, and I noticed a conversation with his coworker about me, so curiosity got the better and I took a snoop. Turns out the excuse he'd used about me, was claiming that I'd gone missing and he needed to go look for me, adding the detail that I'm 'on suicide watch' even saying that he called the police. \n   \nOn another occasion, he said we can no longer go to his shop on Thursdays (It's the local store so we shop there regularly) because he'd told them he needed that day off as he takes me to therapy that day (This isn't true, we've never been to therapy)  \n\nMore recently we had similar incident, where he told me I couldn't go in the his shop as he'd used me as an excuse again. I Took another snoop and found he'd told them he needed to stay home with me due to my mental health. When he finally went back he told them that my brother is able to be with me now so he feels safe leaving me at home (I Haven't spoken to my brother in months)\n\nTo be clear, I have no history of mental health issues, never had to go to therapy, never been a missing person, nor has anyone ever had to call the police for me\n\nThis all also reminded me of a time a while ago, where he mentioned in casual conversation how he could get away with killing me, because no one would notice me missing. He explained how I don't talk to my friends or family regularly so they wouldn't realise I was gone, and he could just call my work and tell them I quit. This did creep me out at the time, but I brushed it off as a weird joke\n\nFor background, my husband is diagnosed with autism,  ADHD, and narcissistic personality disorder, he also has always had compulsive lying and anger issue. (I've Know of that since even before this) He also has a history of mistreating me, in a way some might call abusive. A lot of emotional abuse such as putting me down, both privately and in front of other,  being demanding and controling. He's never actually struck me physically, but has used threats of violence to get what he wants before\n\nAlthough all this concerns me, I also feel kinda silly for being concerned. Maybe I'm just paranoid, maybe I actually am as crazy as he's making me out to be? An outside perspective would be helpful.\n\nShould I do anything, or just ignore it and stop snooping?\n\nEDIT: Apologies for the way I've been replying to comments so far, I realise I've been acting kinda stubborn and it isn't helpful. I'm Gonna pause reading the comments for a bit so I can come back with a more clear head. Please do continue commenting if you have anything though as I will read them]",
            "Q_score": 1216,
            "Id": "11r6x69",
            "Url": "https://www.reddit.com/r/Advice/comments/11r6x69/i_think_my_husband_could_be_plotting_to_kill_me/",
            "Aswer": "Always go with your gut. When he goes to work grab images of emails and texts and make copies of any critical papers. Then go to the police and get a restraining order. Do you have someplace you can go where you’ll be safe?",
            "A_score": 1257
        },
        {
            "Question": "First sleepover with my daughter, ever. Advice?\nYou see, I never had a father growing up, so I’m winging it. My daughters 7. I missed her birth and the first 3 years of her life due to being locked up. Then I spent 2 years in recovery for drugs only seeing her maybe 2-3 times. I’ve been clean 2 years, and after a years worth of supervised visits I finally get to bring her home for a sleepover. Any advice? I’m so freaking nervous, I’m still new to this whole dad stuff, but I want it to be fun and go smooth. I don’t want her to feel like Im a stranger or she’s a guest in my house. What do we do all night? Movies, games? I have a PlayStation. We’ve had some unsupervised visits which just concluded of us going to McDonald’s or Wendy’s or to the park or beach. I just would like to get to know her and her to know me. I don’t want to mess this up, or make it boring and her not want to come back. I want to be the dad she deserves. Advice?",
            "Q_score": 69,
            "Id": "11rkvpn",
            "Url": "https://www.reddit.com/r/Advice/comments/11rkvpn/first_sleepover_with_my_daughter_ever_advice/",
            "Aswer": "Congratulations on continuing to make positive changes in your life and your family's life. \n\nA couple ideas of things that you could do: \n1. Make dinner together. Even if you can't cook and make only simple things, do you know how to make an ice cream sundae or make tacos together or make your own personal pizzas or nachos? Something where you get a chance to do an activity together. \n\n2. Go to Walmart (go with her) and pick out some arts and crafts supplies and draw pictures together. Even if you aren't good at art, doesn't matter, what matters is doing something together, maybe she takes your picture home and you keep hers. Or there are like craft kits for making little window/mirror decorations, just scrolling online there's like a paint your own unicorn, you could even give her a little sketchbook to draw in. Just stay away from things with small parts and beads and such. \n\n3. Does she have a designated place to sleep for her? Maybe you two can go pick out a blanket together that she keeps at your place, or stuffed animal, or pillow etc. Something that's hers for her sleeping spot to feel more comfortable. (sorry I'm thinking of a lot of purchasing ideas). \n\n4. Watch some movies together. Maybe some movies you liked as a kid if you have a streaming service that she hasn't seen before. Hell watch some star wars and make lightsabers out of cardboard boxes and such. \n\n5. If there's time when she visits and one near by, take her to the aquarium. They're excellent places. Also much better than the zoo. Maybe you go to the aquarium and afterwards you both draw your favorite fish that you saw while eating dinner? Or maybe you get her a little portable camera to take photos, or you let her take photos of the fish with your phone? \n\nProbably not the best ideas but hopefully inspire some other ones for you. Again congratulations on the progress in your life and good luck.",
            "A_score": 43
        },
        {
            "Question": "My mom wants me to contribute money for bills and I need advice\nI (15F) recently started interning in my school. I am in the planning committee and help with all the school events. I stay after-school for two hours on Mondays and Tuesdays to help one of my teachers (i help with things like organizing, printing papers, small things like that) My mom (35F) is asking me to contribute $50 to help with bills. I get paid $500 every two weeks. I do want to contribute, but I don’t know if nows the right time to. Should I contribute? Or should I tell her no and wait until I get a higher paying job when I’m older.\n\nEdit: Hello, I just woke up. Thank you for all the advice. Yesterday I asked my mom what the $50 was for and she said it was for if we ever needed it. We buy food (mostly on weekends) if there’s nothing at home and she said the money will go towards that or just anything that needs to be paid for. I realize now that I might have been a little misleading because I cannot confirm that I actually make $500. The coordinator of the program I’m in said we make $500 every two weeks, but I get my first check on Friday. I also said I was an intern, sorry about that I just checked my timesheet and it says im a teacher aide.",
            "Q_score": 91,
            "Id": "11rh2bp",
            "Url": "https://www.reddit.com/r/Advice/comments/11rh2bp/my_mom_wants_me_to_contribute_money_for_bills_and/",
            "Aswer": "I’m having a hard time believing this. $500 every two weeks when you’re just working four hours a week? Did I read that right? That’s $62.50 an hour. What “higher paying job” do you plan to get when you’re older that pays more than that?? You make more than most Americans *right now.*\n\n$1000 a month is *a lot* of income for a 15 year old. She’s definitely trying to get you to learn how to be responsible with money and not spend it all on dumb stuff. \n\nGive her the money. That’s only 5% of your monthly pay. Learn how to budget, save, and invest. Open a retirement account while you’re at it.",
            "A_score": 297
        },
        {
            "Question": "My boyfriend wont block the girl he cheated on me with…\nI am a 29F that is dating a 37M (lets call him Bob). We had been together for about 9 months before i found out that he had been cheating on me with a 20F, lets call her Karen, for the last two months. I broke it off after finding out. Within a week she moved into his place (her parents kicked her out). It has been 3 months and he told me he regrets it and he chose the wrong girl. He asked me what it would take for us to get back together. I said to stop sleeping with karen and have her move out would be a start. She moves out within two days. He says karen is moving to a different branch of the franchise they work for so he also wont have to see here there, but they are in a soccer league together that meets once a week for the next 5 weeks. I asked him to block karen and go no contact with her. He says no because they are still friends and he doesn’t plan on seeing her romantically (also that he doesn’t want to be told what to do and i should trust him). \n\nAITA for wanting him to not talk to her? How can the trust be rebuilt? I’m not sure if i should move forward with getting back together. I really love him but i don’t know how to get over this, and him still talking to her makes me uncomfortable, especially knowing Karen still wants to be with him, even if he dosent want to be with her.",
            "Q_score": 45,
            "Id": "11rlqo4",
            "Url": "https://www.reddit.com/r/Advice/comments/11rlqo4/my_boyfriend_wont_block_the_girl_he_cheated_on_me/",
            "Aswer": "Dude... why even get back together with him. Have a little self respect",
            "A_score": 448
        },
        {
            "Question": "I Have To Wake Up Early, Should I Sleep?\nBasically, I am going on a trip and I have to leave the house by 4:00 A.M., thus, I have to wake up around 3:00-3:30 to get ready and prepared. However, I usually feel tired and fall asleep around 12:00 A.M. and wake up at around 7:00 A.M. It is very hard for me to sleep earlier than 12 since this has already become my daily routine. I fear that if I sleep at 12, I would not be able to wake up on time (alarms won't work; I am a heavy sleeper). I feel that the only way would be for me to be on time is to stay up till 4:00 A.M. I am just looking for some advice on what would be the best course of action.",
            "Q_score": 68,
            "Id": "11rfadr",
            "Url": "https://www.reddit.com/r/Advice/comments/11rfadr/i_have_to_wake_up_early_should_i_sleep/",
            "Aswer": "Yes get off reddit and your phone and get some  rest",
            "A_score": 156
        },
        {
            "Question": "How do I tell my boyfriend that I am a CNA?\nI’m ashamed to tell my boyfriend that I work as a CNA bc I clean up shit and I am embarrassed about that and what if he’s grossed out by me but we’ve been together almost 6 months and he knows I work at nursing homes and such so idk how to tell him",
            "Q_score": 24,
            "Id": "11rnidp",
            "Url": "https://www.reddit.com/r/Advice/comments/11rnidp/how_do_i_tell_my_boyfriend_that_i_am_a_cna/",
            "Aswer": "There’s so much more than that as a CNA. Tell him the good parts of your job, how you help people, be the friendly face they see when some of the residents likely don’t even get to see family. You should not be embarrassed, we all have aspects of our jobs that aren’t great. \n\nI’m a manager at a mental health residential program and I still clean up feces and vomit too because I’m there to help the residents and support my staff.\n\nETA: if he thinks your job is gross and makes you feel ashamed, he’s not the one for you if he can’t be supportive of you.",
            "A_score": 87
        },
        {
            "Question": "(Please help me) How do I stop my mother from getting arrested for claiming to have a title in \"profession\" which is illegal because she doesn't have it, but be totally anonymous about it (because of retaliation)?\nI'm have already been severely depressed for a year, and I have to make some life-changing decisions in the period of 1 month, but I'm now I have this on my mind and it's just too much.\n\nMy mother and I have a complicated relationship. We get along well, but she tends to be reckless about many things and having to be saved by my grandfather. My grandfather is a very responsible person though he is a very serious one because he didn't really have time to be a teen because his father died early so he had to \"be the man of the house\" since he was 15 years old. \n\nMy mother recently said she wanted to start practicing another career (she hasn't worked for a while) , and that's okay because it's never late in life to find your passion. The problem is that she has started an account on social media advertising herself as having that title which is illegal. She has already been told to not do it by my grandpa, but because he is so serious she has become very hostile and evasive with him. And in the recent years the same attitude towards myself because I have called her out on a lot of stuff. \n\nShe is a good woman but is emotionally unstable because of past events and a really good mother in the many hardships me or my siblings have had. Now I don't know what to do because if she gets any clue that I'm involved she will not do it out of spite. \n\nI just want to help her because someone that doesn't like her finds out and files a complaint which will result in an arrest. We live on a non-rich country (that's why she thinks she can get away we it).",
            "Q_score": 32,
            "Id": "11rhlkn",
            "Url": "https://www.reddit.com/r/Advice/comments/11rhlkn/please_help_me_how_do_i_stop_my_mother_from/",
            "Aswer": "A sad lesson to learn in life, you can NOT save an adult from themselves.",
            "A_score": 66
        },
        {
            "Question": "My mom let a homeless guy live with her\nI don’t stay with my mom since I’m in college. But I do plan on going back over the summer soon. But my mom told me she let a old homeless man live with her. She says she’s familiar with him and felt bad for him because he lived in his car. She said she’d make him pay rent about $600 a month but he only gave her $375 to move in. I don’t feel comfortable knowing she’s living with a stranger… I told her this but I’m not sure if she’ll kick him out. I’m scared for her because he is armed. And I don’t know his mental status. What can I tell her to get him out?\n\nUpdate: He made sexual advances towards her and that made her uncomfortable so she took her key back and gave him a time frame to move out. Thanks to the realistic people giving the advice I asked for instead of their unwanted opinions. And btw I don’t care if he was homeless or not it’s still a random ass man she doesn’t know living with her. I’m just telling it how it was and what she told me over the phone that’s it!!! If it was a homeless person she knew and helped out before and probably got to know more I wouldn’t be so against him staying but that’s not the case here so please stop making it seem like I’m against homeless people. They are HUMAN BEFORE BEING HOMELESS. However in today’s society and depending on where you’re from people are dangerous and can come with issues.",
            "Q_score": 41,
            "Id": "11rckrt",
            "Url": "https://www.reddit.com/r/Advice/comments/11rckrt/my_mom_let_a_homeless_guy_live_with_her/",
            "Aswer": "An armed homeless person? Is she nuts? Do you have other family members who can also voice concern? He already underpaid, I bet he stops after this first month. She also needs to get anyone living with her to sign some sort of lease - getting rid of an unwanted person can be very hard if the person doesn’t want to leave and there is no signed agreement outlining circumstances for eviction. this needs to be done pronto, You can’t make her do anything, but I would express my concern very strongly, call her every day to check in, and enlist her friends or other family members. I am sure they will all tell her she is making a very poor decision, There is a reason he is homeless with no family or friends to take him in - that alone is a red flag.",
            "A_score": 31
        },
        {
            "Question": "My boyfriend said he’s not paying rent while he’s deployed…\nSo I just recently found out that my boyfriend will be getting deployed in a few months. He’s supposed to be leaving this month for pre deployment training and told me to pay his half for him and gave me his card info. So I guess being naive I said “will I be doing the same thing while your deployed?” To which his reply was “No, why would it be fair for me to pay rent for a place I’m not going to be living in for up to 6-9 months.” It caught me way off guard because I moved all the way to OK from NH because he told me he wanted us to live together, that’s 22 hours away. I have no family or friends down here and I even had to pay and drive a Penske truck just to get here… what am I supposed to do? I don’t want to be here all alone and I definitely don’t want to be financially responsible for an apartment that has the rent continuously increasing almost every month. My best friend and family keep telling me that I should leave him because the way he already treats me and then when I told them about this they lost their minds… Is there any other people that are dating a service member and have they left you solely responsible for rent while they where away?\n\nUpdate: \n\nThank you all who have commented with great advice and words of encouragement. My friends family and I have decided that it would be in my best interest to move out when our lease is up in June and my ex can either move his belongings back to his barracks room or into a storage until his family can come down and get it for him. I believe this is the best I can do given the situation, I don’t want to be a bitter person that causes him any trouble so, I will be removing myself from this situation as respectfully and considerately as I can.",
            "Q_score": 920,
            "Id": "11qqy9s",
            "Url": "https://www.reddit.com/r/Advice/comments/11qqy9s/my_boyfriend_said_hes_not_paying_rent_while_hes/",
            "Aswer": "Ya, that’s bullshit and he’s scamming you. If you both signed the lease to the place, you’re both responsible for your half of the rent. It doesn’t matter how often either of you are there. The man signed a contract and he’s obligated to hold himself to that contract. \n\nBased on the rest of your post, it sounds like the most straightforward solution would be to not pay your half of the rent because you left the douchebag.",
            "A_score": 1328
        },
        {
            "Question": "Should I try weed?\nI have never smoked weed my entire life. Should I give it a try or should I never start?",
            "Q_score": 34,
            "Id": "11r2auu",
            "Url": "https://www.reddit.com/r/Advice/comments/11r2auu/should_i_try_weed/",
            "Aswer": "It’s a very personal choice that no one here can make for you. But if you’re asking strangers then you may either feel pressured (directly or indirectly) by your friends or you are slightly interested but nervous. It’s not a hard drug - you won’t get physically or mentally hooked after a couple of hits. But it can be habit forming and many people get sucked into it that way.\n\nWe’ll speak only recreationally because medical is a whole other topic. First, I’d personally recommend not smoking before 25. I’m not sure how old you are but I have many friends who smoked in high school and ‘claim’ negative side effects like bad memory loss etc. it’s better to wait for your brain to fully develop. \n\nIf you do want to try it, start small. Don’t get pressured into doing more than your comfortable and give yourself some time to feel the effects before continuing. I usually find with smoking that 10-20 minutes after the hit I can feel it. Edibles are different and can take 30 minutes to 1.5+ hours.\n\nDifferent types of weed have different effects. You may not like what you smoke, but it could be the strain. You can always try another one later.\n\nYou may get paranoid. Just remember that it won’t kill you and take deep breaths. Be close to people you trust who can help keep you relaxed. A good environment means a good high.\n\nWeed can be a good way to relax and hang out with friends - like drinking can - but it can also help distress from a long day. Do what feels right for you but if you find yourself smoking from morning until night, or you feel a compulsion to smoke before every meal, consider taking a break.\n\nHope this helps!\n\nEdit: updated age to 25 per many recommendations. Personally I started at 20 as many do in college but I’m sure medically the recommendation is 25. If it’s occasional and small amounts I don’t think there’s significant side effects.\n\nEdit 2: as always anyone who is neurodivergent or has a mental illness should always be cautious about using substances. If you see a therapist or psychiatrist and feel comfortable with them try to be honest about your usage. It’ll help them help you and may impact what medications they recommend.",
            "A_score": 128
        },
        {
            "Question": "should I get my bf a gift for his birthday or should I listen to him?\nHis birthday is soon and I'm confused on what I should get him 😭😭\n\nHe told me multiple times over the last month and insisted that I don't get him anything because he doesn't like celebrating birthdays and such, BUT I really really want to get him a few gifts :( \n\nI found a pair of shoes that he always wanted online and I want to order him one and I also want to get him watch that has his favourite team's badge on it but I just don't know what to do. I'm afraid if I get him something he'll be mad at me and if I don't then he'll think I don't value him as much as he thought :( \n\n\nSo PLEASE any advice 🫶",
            "Q_score": 21,
            "Id": "11r3kh1",
            "Url": "https://www.reddit.com/r/Advice/comments/11r3kh1/should_i_get_my_bf_a_gift_for_his_birthday_or/",
            "Aswer": "As someone who has asked people not to give them gifts and meant it, I am inclined to tell you to take him at his word. Some people do say that while secretly meaning *get me things*, but it's best not to reward that kind of duplicity, anyway.\n\nHow about an experience instead? Tickets to a game, performance, movie, or fancy dinner together? Putt-putt or a trip to the arcade? Museum or art gallery? Scavenger hunt or a little planned getaway; picnic in the park?\n\nHis love language might just not be gifts (again, something I feel and relate to strongly), but everyone likes to feel appreciated in some way. Experiences are much more valuable to me than material things.",
            "A_score": 60
        },
        {
            "Question": "Is it normal to love your family but want to move far away and have nothing to do with them?\nI (23M) live with 2 parents and a younger brother. My parents are really great people and I love them to death. I would do almost anything for them if I they ever needed help, hope to financially support them if able and wish them the best in life. Same applies to my younger brother. However, I absolutely hate living together and being within touching distance where I have to interact and talk to them, or even see them for that matter. I would like to move as far away from them as possible and cut off frequent contact. I would not mind talking to them every once in a while to check up (once a month, let’s say). And going to see them for a couple of days a year. I want to live a life completely separate from them in which they are not involved. Am I lying to myself by saying that I love them ? Can both of my feelings coexist ? I feel guilty for wanting what I want.\n\nEdit: Thank you for the kind replies everyone! Helps to know I’m not actually a dick haha. I definitely agree with it being an autonomy thing. However, they come from a culture that is very interdependent family wise. That is probably why I felt like it’s such a ‘bad’ thing to not want the same.",
            "Q_score": 168,
            "Id": "11qpnsl",
            "Url": "https://www.reddit.com/r/Advice/comments/11qpnsl/is_it_normal_to_love_your_family_but_want_to_move/",
            "Aswer": "We all need to learn to set and maintain healthy boundaries with family. Watch youtubes to learn how. \n\nThe relationship you're describing is referred to as \"Low Contact\". \n\nWhen a person goes low contact with family, it's important to work on creating a FRAMILY (friends you choose who eventually become closer and more supportive than family), so you have support and connection in your life.",
            "A_score": 62
        },
        {
            "Question": "What is a good excuse to leave a vacation with friends and go home. I don’t want to say I have family in the hospital.\nThank you for each and everyone of you that responded. It is hard for me to tell the truth but it seems like that’s what I need to do. I do apologize if it sounds like I’m picking a part everyone’s answer,it’s just a really stressful situation and I don’t want to hurt anyones feelings. I’m either going to say that I’m sick or just tell the truth. Or maybe a combination of both. I just can’t wait to be home with my family.\n\nMorning all. I told them I was homesick and also felt like I was a damper and they were like “ok. Whatever”.  I’m disappointed and mostly relieved. I don’t think they will invite me to things in the future but also I don’t think this will affect the other friends in this group who are not on this vacation so I guess the best outcome happened. Thank you all for your thoughtful comments. Even thank you for your not so nice comments. It all helped.",
            "Q_score": 158,
            "Id": "11ql1m9",
            "Url": "https://www.reddit.com/r/Advice/comments/11ql1m9/what_is_a_good_excuse_to_leave_a_vacation_with/",
            "Aswer": "“I’d stay, but I don’t want to” and leave.",
            "A_score": 257
        },
        {
            "Question": "Do I tell my friend she dresses inappropriately for her age and size?\nI want to start this post by saying I’m not passing judgment on my friend, but I would want to know personally if my attire was considered inappropriate for my body or for the venue or audience. \n\nMy husband and I belong to a social organization for couples. A few months ago we recommended two married friends of ours who I will call Mark and Lisa for membership. We invited them for a meet and greet with other members one evening at an upscale lounge. \n\nLisa likes to dress very sexy and youthful. She is 60 years old, on the heavier side, and has very large breast implants that she can never seem to keep inside her clothes. She showed up to the evening wearing platform flip flops and a semi-see-through beach romper that left nothing to the imagination. When the evening was over, several members shared their feedback and gave her a hard “no” for membership. Some cited a “personality conflict” but others stated that they found her appearance and dress to be “trashy” and “inappropriate” and “contradictory to the public persona our group is trying to establish.”  Needless to say they did not become members. \n\nI love my friend. She is kind, funny, hardworking, and would give you the shirt off her back (no pun intended). I don’t judge her for her clothing choices but I do feel uncomfortable sometimes when we hang out, husbands in tow, and she has yet another (entirely preventable) wardrobe malfunction. Do I tell her how wildly inappropriate this is?  Or do I bite my tongue and accept her and her fashion choices?  Thanks.",
            "Q_score": 83,
            "Id": "11qlqcz",
            "Url": "https://www.reddit.com/r/Advice/comments/11qlqcz/do_i_tell_my_friend_she_dresses_inappropriately/",
            "Aswer": "Nah, don’t tell her. Let her be happy, she’s freaking sixty and living her life, she don’t need that club anyways.",
            "A_score": 406
        },
        {
            "Question": "A boy asked me (16F) out. What do I do?\nI feel like such a stereotypical teenage girl writing this, God. Long story short, a boy I know texted an offer to go on a date. He is an interesting guy - we haven’t talked that much but he’s fun to talk to. However, I’m pretty sure I don’t feel anything towards him romantically rn. I really hate to be a girl who friendzones, I do, but I think that’s what must be done, especially since I think I might be gay for unrelated reasons.\n\nHowever, you only live once, and maybe I will end up liking him, or at least, I will have gotten out of my shell for once. But I don’t want to be selfish and end up hurting his feelings.\n\nWhat do I do???",
            "Q_score": 64,
            "Id": "11qj9wb",
            "Url": "https://www.reddit.com/r/Advice/comments/11qj9wb/a_boy_asked_me_16f_out_what_do_i_do/",
            "Aswer": "Just go and have fun. It’s not a marriage proposal.",
            "A_score": 208
        },
        {
            "Question": "How do I get rid of 20 lighters?\nPlease don’t ask why I have 20 lighters. I need to get rid of these immediately.\n\nEdit: I’m 15",
            "Q_score": 31,
            "Id": "11qo2vm",
            "Url": "https://www.reddit.com/r/Advice/comments/11qo2vm/how_do_i_get_rid_of_20_lighters/",
            "Aswer": "Walk up to the first person smoking you see and say \"do you want these lighters\"?\n\nUnless they're dead. In that case just throw them away.",
            "A_score": 77
        },
        {
            "Question": "I feel like I missed my chance and now I’m to old for everything\nTo expand more on the title, I don’t know what to do anymore. I feel to old to do most things but to young for others. I feel like I’m stuck in the middle with no idea how to move forward. To be honest I never thought I would live this long so I never bothered to think of my future. I work two jobs and I don’t like either I just do them for money. I have a few hobbies but mostly I feel like I’m just daydreaming through life with no idea what to do next. I have things that in the last few years I have wanted to do but i feel like I’m past the age I can do them. It feels like I missed out building these kinds of thing when I was younger (not to sound even older than I am) but seeing young kids know what they want to do and work towards them or even do things I could never achieve. I feel like leftovers. I’m turning 30 this year, never been in a relationship, never really accomplished much personally or in my jobs. So does anyone know how to find motivation later in life? how to find joy in things again? how to have a new goal or dream? \n\nany words of advice would help.",
            "Q_score": 45,
            "Id": "11qfsld",
            "Url": "https://www.reddit.com/r/Advice/comments/11qfsld/i_feel_like_i_missed_my_chance_and_now_im_to_old/",
            "Aswer": "There’s no time like the present to start something new.  I’m 36 and have recently decided to finish my bachelor’s degree.  Yes, I wish I’d done it sooner, but I’m a procrastinator by nature and put it off long enough!  30 is still young anyway!  Find what you love and try it!  Put yourself out there if you really want to find a partner, lots of people use dating apps I hear nowadays.  \n\nDo whatever you want to do now because when you’re 36 37 38 you’ll have regrets, trust me.",
            "A_score": 18
        },
        {
            "Question": "My gf is being tracked.\nSo I’ll keep it brief. My gf has been getting notifications that an AirTag is following her car. We recently moved, and it travels with her everywhere she goes in her car. \n\nWe searched what we could. But where are some good places to look? It’s a 2016 Mazda 3 if that helps. \n\nYes, we’ve got in touch with the police. They said they can’t do much until we actually find a tracker. \n\nShe’s going to try to have a shop look for it asap.  Thanks for any and all help.",
            "Q_score": 444,
            "Id": "11pxwd8",
            "Url": "https://www.reddit.com/r/Advice/comments/11pxwd8/my_gf_is_being_tracked/",
            "Aswer": "My nasty fuckin ex gf put a android smart tag in my kid's backpack and I found it really easy but mostly because she previously was trying to record my conversations with a recording spy pen.There's an app called BLE Scanner. Download it and take it outside maybe 75 feet from her car and refresh the app. Take note of all devices that it picks up. Then got next to the car and refresh the app, if there is a tracker in or on the car you'll notice a new device appearing in the app. Look at the distance which is in meters, then walk around to different sides of the car, and look at the distance. The lower the distance means the closer you are to the Air Tag. The app should display Air Tag so it should be really easy to find in the app when looking at it. I'd also recommend maybe doing this search with her car at least 75 feet from all other cars and bluetooth device that are on phones and cars. It should be super easy to find. Good luck and keep us posted on the progress. Here's a [link for the app](https://apps.apple.com/us/app/ble-scanner-4-0/id1221763603).",
            "A_score": 577
        },
        {
            "Question": "My ftm trans friend is becoming misogynistic to me. Female.\nOkay so I have a friend and we’ve been friends for awhile. He has transitioned into a man and I fully support. However, I’ve noticed he’s started to become misogynistic. Sometimes he will make a kitchen joke or say “woman moment” and I’m just so confused on what to do? I feel like obviously he craves validation from cis men and is mirroring his cis male friends behavior so he can “fit in”. But I feel like it’s ruining our friendship. Any advice?",
            "Q_score": 699,
            "Id": "11ppaqn",
            "Url": "https://www.reddit.com/r/Advice/comments/11ppaqn/my_ftm_trans_friend_is_becoming_misogynistic_to/",
            "Aswer": "I'd call him on it like you would anyone else saying those things, \"Hey, not funny. No really, disrespectful and not cool.\"",
            "A_score": 1126
        }
    ]
}