{"Posts": [{"Question": "I recently found out I’m pregnant and the father is calling me selfish and won’t talk to me\nI (21F) just found out I am 12 weeks pregnant. \n\nFor a little background information, I’m 21 and the baby’s father is 22. We are not dating. We have been in kind of a situation ship for the past 1.5 years. I was using birth control and he always used protection. I’ll call him “L” for this story. \n\nWhen I found out I was pregnant I knew immediately that I would be going through with the pregnancy and keeping my baby.  I had decided to tell L pretty quickly. I didn’t think he would react the way he did. After telling him, he immediately asked what I was planning on doing. I told him I wanted to keep the baby. He got kinda angry and told me it’s unfair for me to make that decision. He told me he’s not ready for nor wants a child right now. I had tried explaining my feelings on ab**tion, and why I made the decision I did. L didn’t want to hear my reasoning or talk about it whatsoever. He had told me I was being selfish. \n\nI completely believe the father should be able to have some opinion on these things. But on the other hand, it’s also my body and half my child as well. I feel terrible over the way things went with L. He now refuses to talk to me and I’m not sure what to do now. I know I want to keep my baby. \n\nWith all that being said, I’m hoping to get some outside opinions on this. Am I being selfish? Has anyone else been through this? Thanks in advance!", "Q_score": 291, "Id": "11kia1t", "Url": "https://www.reddit.com/r/Advice/comments/11kia1t/i_recently_found_out_im_pregnant_and_the_father/", "Aswer": "Your body your choice. But you also can’t expect him to be happy about it. If you want to keep the baby, fine. But plan on being a single mom.", "A_score": 1102}, {"Question": "I’m starving and my mom won’t feed me. Is there anything I can do?\nI’m 16 years old and I live with my Mom, her ex, and my sister.\n\n2 1/2 - 3 months ago, my mom stopped going grocery shopping, and only on some days would her ex go out and buy ingredients to cook with. Meaning that I go most days with no food at all, with my only form of sustenance being my school lunches. On weekends, I’m shit out of luck. Originally, I thought it has to do with a bad financial situation, until she told me outright that she was simply too lazy.\n\nI tell her that I’m hungry, and she replies to me saying “You’re always hungry.” I’m rapidly losing weight. I’m 5’10-5’11 and I used to be 170 lbs, I’m down to 150 now. I’ve never felt more weak in my entire life, and recently, I’ve started feeling dizzy and lightheaded, some times even short of breath. How get through to my mom?", "Q_score": 2071, "Id": "11jx4dw", "Url": "https://www.reddit.com/r/Advice/comments/11jx4dw/im_starving_and_my_mom_wont_feed_me_is_there/", "Aswer": "There are times in life when asking for help is the wisest path.  This is one of those times.  Talk to an adult you trust about what is happening, perhaps teacher, an aunt, an uncle, a minister, or somebody who can help you.  Ask for help.", "A_score": 2709}, {"Question": "I want to break up with my girlfriend, but...\nMy girlfriend isn't the nicest to me. She likes to hit me, hurt me, and say stuff to me that mentally hurts me. I want to break up with her, but she said that if I do, she will kill herself. WHAT DO I DO?? Do I endure the pain, or save myself, but live with the grief knowing that its my fault someone died?", "Q_score": 91, "Id": "11klhdd", "Url": "https://www.reddit.com/r/Advice/comments/11klhdd/i_want_to_break_up_with_my_girlfriend_but/", "Aswer": "She won't do it.\n\nBreak up and call that police telling them what she said. \n\nIt's just manipulating you to stay", "A_score": 250}, {"Question": "My (50F) son (15M) has become a far-right extremist and I have no idea what to do\n \n\nThrowaway account because this is too embarrassing.\n\nFor some context, my son is on the spectrum and has difficulty forming relationships with people as a result, although he still has a few in person friends. He's extremely intelligent, and knows many things, especially when he puts his mind to it. I also know he uses a lot of social media, since it's easier for him to make friends that way, however I did not monitor them which I regret doing.\n\nThe first red flag was when he was 13 and he began talking to me about various statistics which he said proved that the races were not equal, like crime and IQ, and when I pointed out there are societal reasons for this, he went on a rant and said that that these are actually biological (I still don't know what his sources are). At that time I just chalked it up to him not understanding the world very well and assumed he would grow out of it, but it has only gotten worse in every way.\n\nHe ordered a copy of Mein Kampf to our home. Fortunately, I saw the package and threw it away before he could get his hands on it, but when I confronted him about it, he started screaming and telling me that all his online friends and he started a reading group where they would read books together and they started with Mein Kampf, and that now he would be left out. I asked him if any of his friends at school were reading Mein Kampf, and he said that they were \"normies\" who didn't understand reality. I asked him if he thought I was a \"normie\" too, and he went on an incredibly misogynistic tirade against me saying that I was a \"whore\" and a \"roastie\" (I looked up what it meant later and I was horrified) for pursuing my career (which has provided our family with lots of money, including that he benefits from!) and for openly talking about my past relationships before I met his father, and also because his father and were never married and now separated. He told me he hated me for ruining his life by waiting \"so long\" to have children which is why he was on the spectrum and had difficulty talking to people (many of my friends had children at my age and they did not have children on the spectrum, not that it's a problem anyway). And that was only the beginning, I do not wish to go into more detail, but I couldn't even say anything to him as I broke down crying. I loved my son and we were so close until that point and never before had anything so mean ever been said to me. I couldn't handle it. I didn't understand why he would say such horrible things to me, or how he could have learned such ideas. I am a progressive, and especially feminist, and I thought I was raising our son to hold the same values, but he became the complete opposite of what I wanted him to be.\n\nIn the aftermath of this, I confiscated his computer and phone, although I did let him send one last message to his horrible \"friends\" since he wouldn't stop screaming to us about how he couldn't just abandon them without saying anything. However, this did not help in any way. He began spending more and more time outside the house, which I thought was a good thing and that maybe he was socializing with his peers who didn't accept this sort of thing. I also noticed over the next few months that he was getting more and more muscular, I was proud of him, but I also did not want him to believe he had to prove his \"manliness\" by getting big muscles, he then cursed me out and told me I was trying to make him a \"soyboy\" (a term I did not know and had to look up) so he didn't care what I had to say. Eventually I find out he somehow managed to find a skinhead gang after school and they workout together... after I saw him with them, I screamed at him and then at them that they as grown men should stop trying to manipulate a teenage boy and there was no reason for him to spend time with strange men in their 20s and 30s.\n\nAfter that, I was very strict about everything he was doing. I would pick him up and drop him off, even though it meant I needed to take off time from work to do so. When I dropped him off at home, I locked the doors to make sure he could not escape before returning to work. However, this did not work either, and eventually I was called by the school principle who let us know that he and his school friends (who he has also convinced to become Nazis now!) had beaten a group of POC boys up and that he and his friends would receive a suspension as a result. I was so livid. I could not imagine the fact I was raising a future criminal, and he told me that I was a traitor for not being proud of him for being stronger than them and for beating up \"murderers of our people, rapists of our women, and invaders of our lands\". No reason can get to him, and no discipline can get to him. And now I AM SUFFERING THE CONSEQUENCES TOO, all my friends now assume I must be a racist because of my son, and don't want to spend time with me anymore. The other parents at the school avoid me. People who used to be friendly are now cold. I have no idea how to deal with this situation, can anyone here on Reddit give me good advice?", "Q_score": 134, "Id": "11kf43s", "Url": "https://www.reddit.com/r/Advice/comments/11kf43s/my_50f_son_15m_has_become_a_farright_extremist/", "Aswer": "Inpatient therapy. Check him into a psychiatric hospital for everyone's safety. This is way above your pay grade. He is obviously not ok, and he needs a professional or six. Especially considering that he's already become violent, it shouldn't be hard to get him admitted. Be prepared to call law enforcement to get him into the facility. You cannot handle this on your own, and the time for outpatient therapy has passed. He'll likely be even more abusive to you in the short term, but in the long term it will be good for all of you.", "A_score": 121}, {"Question": "My Girlfriend is hanging out with people that she knows openly have a crush on her, as well as people that actively try to ruin our relationship, she refuses to listen to me when I protest.\nMy girlfriend has an issue with disconnecting with people, I’m aware of this and I don’t push her about it. However, we recently haven’t been spending much time together because of how often her friend is staying at her place. They’ve known each other since they were kids and I have no right to step in between them, the problem I have is she is fairly sure that he has a crush on her, at least a mild one. Even though it’s something I’m not quiet about disliking, they wouldn’t stop talking to them even if I really tried (which I have.) the reason I tried wasn’t because of the crush, it was because he’s a extremely rude person, as well as a raging racist even though it’s (Just a joke.) Which bothers me due to the fact I am African American. He’s tried to ruin our relationship and she gossips with him about me as well, I love her but I’ve found myself not showing it as much because of how uncomfortable I felt when I learned all of this. On top of all that, she’s just now telling how many of the people she talks or talked to recently (Like a couple months) have a crush on her that she’s aware of. She out right refuses to stop talking to any of them, I don’t want to break up with her but I don’t know what else to do.", "Q_score": 22, "Id": "11kr71h", "Url": "https://www.reddit.com/r/Advice/comments/11kr71h/my_girlfriend_is_hanging_out_with_people_that_she/", "Aswer": "If she likes the attention more than the comfort of her partner, I feel like you should set her free to pursue this attention-seeking on her own.", "A_score": 23}, {"Question": "I’m 18 and haven’t left my house in 2 years.\nI left school at 16 with 0 GCSES and since then I’ve been living with my parents doing nothing but playing games and watching stuff. \n\nI have no friends, no goals or passions, I havnt left the house since I stopped going to school, there has genuinely been times I’m unsure what month it is. \n\nI don’t know how to speak to people, the only face to face conversations I have are short and occasional talks I have with my brother. \n\nI want to start having a life but I don’t know where to begin or if it’s seriously too late for me. I don’t even know if I can get a job when I have no GCSES, experience or people skills for an interview. \n\nHow do I make friends at the very least or have a relationship? Like I don’t understand how it’s possible at this stage. Google says just talk to people and you’ll learn with practice, but who would want to talk to someone who doesn’t know how to talk? \n\nI’ve literally spent my whole life just drifting along with no one and nothing being babied by my parents to the point I’m convinced I have a disability they’re not telling me about.", "Q_score": 142, "Id": "11k6g4v", "Url": "https://www.reddit.com/r/Advice/comments/11k6g4v/im_18_and_havent_left_my_house_in_2_years/", "Aswer": "Your parents have failed you and you are failing yourself as well.  You get out of life what you put into it.  If you put nothing into it then you'll get nothing out of it.  I would recommend finishing your education then getting a job.  Once you have a job you will meet others and you can work on your social skills.", "A_score": 221}, {"Question": "Should I send my ex the necklace he gave me with his name on it?\nMy ex broke up with me a few months ago. It wasn’t a messy breakup, I took it hard and sent a few lame texts but thats about it. I’ve stopped trying to contact him so I can heal but I have a necklace he gave me with his name on it. I think it would be best for me to get rid of it but I feel weird about throwing it out. Would it be weird to send it to him and let him deal with it?\n\nAlso, any advice on how to get over said ex? He was my best friend and first love, all my friends were his friends so im kinda just alone now lol.", "Q_score": 28, "Id": "11kl8wc", "Url": "https://www.reddit.com/r/Advice/comments/11kl8wc/should_i_send_my_ex_the_necklace_he_gave_me_with/", "Aswer": "Toss it. Don't send it to him, it's like contact. No contact.", "A_score": 89}, {"Question": "I didn’t take my placebo pill during my period and didn’t tell my BF. I understand he’s angry and I should have been more considerate but there are many more factors that should have weighed into his feelings.\n1. We have been together almost 9 years. Of those 9 years, I have never had a pregnancy scary, have always either taken pills or had an IUD AND my BF still wears condoms most times we do have sex. \n\n2. I did not take my placebo pill during a week I was already on my period. We are not usually sexually active during my period.  And were not this time. \n\n3. DIRECTLY after the week of placebo pills of this pack, I got an IUD inserted. \n\n4. BF still uses a condom almost every time. \n\nNow he’s incredibly upset with me and telling me he could never trust me again. I’m not sure what to tell him. I understand he’s upset but given all these added factors, I don’t think this should be relationship ending. Am I wrong?\n\nETA for context: we actually already had this fight about a month ago and we agreed it was his right to know about my birth control decisions. HOWEVER. The placebo is the placebo. I know it does nothing whether I took it or not. What he’s upset about is my decision to not take it without telling him. What I don’t understand is why this is such a big deal given all the previous factors AND it being a placebo pill.", "Q_score": 509, "Id": "11jlwqd", "Url": "https://www.reddit.com/r/Advice/comments/11jlwqd/i_didnt_take_my_placebo_pill_during_my_period_and/", "Aswer": "Do you both realize the placebo pill is literally *a placebo*? It doesn't have any medication, it's just there to keep you in the habit of taking a pill every day while you have your period. It doesn't change anything. It does nothing.", "A_score": 1805}, {"Question": "Is it controlling to ask your bf to stop watching porn ?\n", "Q_score": 27, "Id": "11k48vg", "Url": "https://www.reddit.com/r/Advice/comments/11k48vg/is_it_controlling_to_ask_your_bf_to_stop_watching/", "Aswer": "Human relationships are far more complicated than black and white statements, so it’s often dangerous to a relationship’s longevity to take in advice that is so absolutist. (Notions to some of the replies) \n\nI personally don’t believe it’s controlling to ask your boyfriend, because your boyfriend also has a choice in agree or disagreeing based on his personal boundaries. \n\nI would say, if you want a partner to not watch porn, communicate that to them, and see what they think. If they don’t agree, look inward and decide if this topic is a large enough issue to be a potential breaking point. There’s no right or wrong morality in finding your personal boundaries, and there’s nothing wrong with saying to someone, “we’re not totally compatible.” Just take note when you find these boundaries, and see if you want to find a partner that reflect them too.", "A_score": 157}, {"Question": "A child I’m babysitting has very large bruises\nHi guys, I’m new to this sub but I don’t know what to do. I [18F] am currently watching two siblings (both under the age of 4), the oldest is still napping, but the youngest is a little girl and I just changed her diaper. When I went to wipe her, I saw a green and purple bruise spread across her entire bottom. It’s very large. Could this be from spanking? I babysit for their best friends every other week as well, should I mention this to them? This is the first time I’m sitting for them, the mom seemed very anxious but I just chalked it up to me being their first sitter ever. I was abused as a child but being in the situation of the grown up, I don’t know what to do. Please help me. Do I take pictures of the bruise? What if nobody believes me without proof? Is that wrong?? I’m going to check the oldest’s bottom once he wakes up while I’m changing him and see if there’s something similar.\n\nUPDATE: The oldest’s entire bottom and legs are bruised too. I have been able to take pictures of JUST their backs and the backs of the oldest’s legs, as they have bruises all the way up their spines as well. Nothing from the photo could be taken as pornographic. I have looked at Mongolian Spots and didn’t know about them prior to this issue, so thank you for those that have educated me. I did call the parents friends who I am very close with and trust, and they said they will help me out. I doubt that it’s those though, they both have the same marks in the exact same spots and they’re purple and look like bruises. I can see blood vessels. I’ll keep y’all updated. Thanks everyone.", "Q_score": 231, "Id": "11jkzno", "Url": "https://www.reddit.com/r/Advice/comments/11jkzno/a_child_im_babysitting_has_very_large_bruises/", "Aswer": "If you have even the slightest inkling that there is child abuse going on, you should report it to the police.\n\nIt their job to investigate, find proof, etc - not yours.\n\nDon’t ignore your instincts, if gut tells something is wrong, it probably is.", "A_score": 209}, {"Question": "i’m being blackmailed\nyes i’m stupid as fuck i know but i’m being blackmailed over my nudes by an unknown person to send them money, i gave them 125$ but they just requested more and i was able to buy myself a week to figure out what the fuck to do they have the screenshots and are able to send them to everyone i know on instagram i don’t even know what to do i’m so embarrassed and just want to give up", "Q_score": 99, "Id": "11jlmao", "Url": "https://www.reddit.com/r/Advice/comments/11jlmao/im_being_blackmailed/", "Aswer": "Block them, lock down your social media, and move on. There is **no amount of money** you can send that will make them leave you alone, they will continue asking for more until you block them and move on. \n\nAlso watch out for anyone who messages you here and claims they can get your money back, they are also a scammer.", "A_score": 260}, {"Question": "14f here, my best friend is dating a 30 year old and I don't know what to do? any advice I feel like it is not normal.\nI (14f) have a friend (14f) who is dating a 30 yo dude and he talks so casually like nothings wrong like it is normal, and she acts like its completely normal and so do our other friends, and i feel like im going crazy i swear its not normal for him to do that??? is he wrong for this or am i crazy?????????????? also i think he might be abusing her? idk she said hes great but something is off", "Q_score": 876, "Id": "11iyfq9", "Url": "https://www.reddit.com/r/Advice/comments/11iyfq9/14f_here_my_best_friend_is_dating_a_30_year_old/", "Aswer": "He is a normal pedophile allright", "A_score": 1111}, {"Question": "Boyfriend cannot clean up after himself and drinks to the point of vomiting most weekends\nMy boyfriend(22) and I (22) moved in together and he is unable to clean up after himself. Typical problem right? I feel stupid writing this, I’ve spoken to him countless times about this and he just acts like i’m nagging him. He recently moved out of his mums house where he had everything done for him yet i had to move out at 18 from a toxic family situation. you’ve heard it all before\n\nmy problem currently is most weekends he drinks to the point of being sick (all over the bathroom) which is concerning. not only does he vomit all over the bathroom making it stink and unusable, he wakes me up when i work weekends, and sleeps for so long i have to clean up his sick or i’ll be stepping in it to use the bathroom and get ready for work.\n\nit’s also concerning that he is unable to control his drinking with his friends and gets himself into such state, and when i bring it is up he says “i haven’t been sick in a long time” when really it was a week ago.\n\ntoday, i heard him tear up the bathroom during the night and as i showered last night in preparation, i just got ready at work in the morning and i’ve just come home.\n\nit’s literally been 12 hours and there’s still liquid vomit everywhere,, i don’t know what to do.\n\ni’m in so much debt from moving out as soon as i could, i thought i could try and get rid of this debt and get a nice, safe place to live whilst becoming more stable.\n\ni can’t move out at this stage, any advice is appreciated\n\nUPDATE:\n\nthank you all for your kind comments, i just wanted to update you all.\n\ni was really upset when i wrote this and he wasn’t in a great way when he woke up,  but i spoke to him and told him the situation is unfair on me, having to constantly clean up after him and that it isn’t fair that i have to live in this kind of environment and worry about his well-being and the state of the house in these episodes.\n\ni’m going to speak to him again once he’s feeling normal again and reiterate this, i’ve also stopped cleaning up after him and am just cleaning up after myself.\n\ni did speak to him and say i was concerned about alcoholism and although he said he didn’t drink that much, it felt like denial because he later back tracked and was like “yesterday was a special event because it was a house party…” i don’t think it matters what kind of event it was and i could kind of see through what he was saying. i think he perhaps does have a problem but although i do love him, it’s not my duty to sort it out for him.\n\ni’ve been looking at places for me to stay in a city nearby that i think i’ll be a lot happier living in, kind of made a saving plan and am going to work towards getting my own place.\n\nwhether or not our relationship will continue after this, i’m unsure but i think getting out of the apartment is the best option.\n\nas many of you have suggested, i’m going to put my head down and work hard to get out. it’s a little disheartening because i had to do this a few times already (moving out of bad family situation, bad accommodation whilst i was in college) and i thought this was going to be a new stable fresh start.\n\na few of you asked about my family situation and without getting into too much detail my mother was a narcissistic manipulator who was physically abusive and my father was cold (he was abused by my mother) and uncaring and also drank. they were both neglectful of my emotional and physical needs.\n\ni do want to emphasise my boyfriend has never been physically abusive to me, and although we both have our issues, we have always tried to be open and honest about our feelings.\n\ni think maturity wise we are perhaps on two different spectrums and it may be beneficial for us both to work on ourselves separately for a bit.\n\nit’s been a tough ride and i have far to go still. i appreciate all of the comments and support. \n\ni hope you all have a wonderful evening and thank you for reading.", "Q_score": 339, "Id": "11j55tu", "Url": "https://www.reddit.com/r/Advice/comments/11j55tu/boyfriend_cannot_clean_up_after_himself_and/", "Aswer": "Pay off your debt as soon as possible and move out. \n\nYou cannot fix him.", "A_score": 407}, {"Question": "What should I do about my sister abusing my niece?\nSo when I was a little girl, I was heavily physically, sexually, and mentally abused by my older sister. It came out when I was about 11, but because my sister was a minor and my parents didn't want to deal with the situation, it lead to no apprehension on her part. Fast forward 17 years, I'm 28 now and my sister has two children of her own. Up until now, there's been no evidence of her abusing my nieces but my mom called me today and told me that the older of the two girls (10) was slammed up against a wall by my sister for \"mouthing off.\" For years, I've put off calling my sister in because it seemed that she was too scared of losing her social position to abuse the girls and that maybe she viewed her girls fundamentally different from me, and I figured that was at least better then a foster home. But now, I don't know what to do. I'm terrified for both of my nieces and feel deeply guilty that I haven't done anything until now, and feel like this has been going on for MUCH longer then we know if my sister was comfortable with casually bringing it up to my mom.", "Q_score": 59, "Id": "11je9hy", "Url": "https://www.reddit.com/r/Advice/comments/11je9hy/what_should_i_do_about_my_sister_abusing_my_niece/", "Aswer": "Contact CPS/DHS. Right away.", "A_score": 97}, {"Question": "Child’s Party\nMy daughter is 10 years old. Yesterday she went to a party trip for a friend.\n\nThere were 8 kids in total. After the trip out they went back to the birthday girls house for food and then we all collected our kids at 7:30pm.\n\nOr at least that’s what I thought. It turns out that the 2 boys were collected, and I collected my daughter - but the remaining girls all had a sleepover.\n\nMy daughter is now quite upset, and to be honest I’m an angry and confused father that my daughter has been ‘othered’.\n\nI just need a sense check from Reddit on what I can do to help my daughter feel better, and also some constructive advice not to feel angry with the birthday girls parents.", "Q_score": 94, "Id": "11j6v26", "Url": "https://www.reddit.com/r/Advice/comments/11j6v26/childs_party/", "Aswer": "Everyone on here is being super nice and reassuring you. Fact is if she was the only girl picked up then I actually think she is being excluded. \n\nWithout being too reactionary I would encourage her to broaden her friend group. I have raised two boys and a girl and I can confirm that girls are a much much tougher cohort to navigate from a social perspective. Their bullying can be calculating and truly heartbreakingly nasty. \n\nExclusion is also a really tough finger to point at… they’re all free to choose their friend group so it’s a very easy form of bullying that can be sort of ‘excused’ with a little gaslighting. \n\nI would be very careful with the friend group, encourage her to cast her net further afield while still remaining ‘friendly’ with this lot.  \n\nMy daughter has had this exact scenario happen then was slowly but surely more and more excluded until she was outright ostracized and ignored… we’re looking to change schools as she’s self harming (14y/o). \n\nHopefully I’m wrong and all the other posters are correct but none the less, be open and available, ALWAYS have her back and encourage her to integrate new friends into her life.", "A_score": 133}, {"Question": "How to overcome my fear of fast food?\nMy partner recently started eating lots of fast food and it literally repulses me.. I’m also worried for her health, happiness etc.. \n\nI grew up in a super healthy household so I’m just not used to people eating it around me, especially people I care about", "Q_score": 57, "Id": "11j9vlw", "Url": "https://www.reddit.com/r/Advice/comments/11j9vlw/how_to_overcome_my_fear_of_fast_food/", "Aswer": "Realizing that the rule is everything in moderation. Also maybe consider therapy if you're \"literally\" repulsed by fast food and try to work on being less judgemental", "A_score": 174}, {"Question": "is it weird to offer food to a girl I'm dating?\nGirl I'm dating is low on food at the moment, and doesn't have a job currently. Is it weird to offer her a small amount for a food delivery or something? We've only been on one date, but seems like she's having a tough week. What do you guys think?\n\nEdit: I did end up offering to get her a doordash, kept it light and playful though, thanks for the feedback guys!", "Q_score": 38, "Id": "11ja5vs", "Url": "https://www.reddit.com/r/Advice/comments/11ja5vs/is_it_weird_to_offer_food_to_a_girl_im_dating/", "Aswer": "It’s not weird at all! It’s actually very thoughtful and in my eyes it shows your thinking about her! I would find out what her favorite foods are, and then send her a DoorDash meal gift!", "A_score": 34}]}