{
    "Posts": [
        {
            "Question": "My wife threatens divorce if i stay up after her and the kids go to sleep. What should i do?\nIt's literally my birthday and 12:15 and she screams (wakes up both kids) I WILL DIVORCE YOU IF YOU KEEP PLAYING GAMES LIKE THIS! I'm a night owl. I'm not goin to lay in bed and stare at the ceiling. I enjoy competive gaming (i dont scream lets go and wake  everyone up). It's something I'm good at and she is belittling it saying it's for kids. I was # 2 in the world with a character and she calls me a fa***t for my efforts. I support her and our 2 kids 100% they have everything they could ever want. Even bought her a new bronco that she has given to her parents to drive after she put all of 3000 miles on it. . I just don't understand how it effects her or anyone if i stay up late if it doesn't effect what I get up and do everyday. Day by day by day.",
            "Q_score": 42,
            "Id": "120ahh6",
            "Url": "https://www.reddit.com/r/Advice/comments/120ahh6/my_wife_threatens_divorce_if_i_stay_up_after_her/",
            "Aswer": "Call her bluff. She will back down. Sounds like she's a leech anyway, and if she does scream divorce, tell her if she dont like it, she's welcome to leave and get a job.",
            "A_score": 92
        },
        {
            "Question": "Nephew turning 12 and says he doesn’t want anything for his birthday. What can I get him that he’ll want/not hate?\n",
            "Q_score": 233,
            "Id": "11zw2lt",
            "Url": "https://www.reddit.com/r/Advice/comments/11zw2lt/nephew_turning_12_and_says_he_doesnt_want/",
            "Aswer": "money",
            "A_score": 572
        },
        {
            "Question": "My boyfriend did the deed with me while I was sleeping?\nIs this rape or normal in relationships? How do I tell him if it was rape? He doesn’t think it’s rape. I told him to not do it again and that I’m uncomfortable.",
            "Q_score": 49,
            "Id": "1208ovg",
            "Url": "https://www.reddit.com/r/Advice/comments/1208ovg/my_boyfriend_did_the_deed_with_me_while_i_was/",
            "Aswer": "it's rape. relationship or not, consent still matters. since you were asleep and did not give an OK to it beforehand, it is rape.",
            "A_score": 230
        },
        {
            "Question": "My girlfriend (22F) won’t change her shampoo even though I’m (25M) allergic to it?\nWe’ve been dating for about 6 months now. When we first started dating things were okay, but a couple months in, every time we would sleep over at eachothers place my face would break out in a crazy rash, my eyes would get super swollen and gunky, and I just looked and felt terrible. \n\nShe seemed slightly concerned at first. I told her that the only thing that has made this happen to me before is an ingredient in a lot of soaps and shampoos that I’m allergic to. We looked through everything we own and use together and didn’t find it in anything, except her shampoo. I told her that’s probably what was causing it, since her hair would be near/on my face when we slept together. I asked her if she could possibly get new shampoo, and she said no.\n\nI asked her why not; she said that she really likes the way that shampoo feels and that she spent $100 on it (they’re pretty big bottles). I told her I could give her some money to get new shampoo and she said no, she’s not changing it. This conversation was 2 months ago. I try to bring it up every couple weeks, because my eyes and face have been red and swollen for months, but she kind of just laughs it off or changes the subject. It bugs me too because she always mentions “oh my god your eyes look so bad babe” and I’m just like… yeah, and we both know why? It’s literally your soap.\n\nI’m kind of at a loss, I understand that she likes the shampoo but it’s physically affecting me negatively and I’m getting kind of sick of people at work asking if I got beat up in a fight lol. Is there something I could do or say to her to make her change her mind? Am I asking too much of her? I kind of feel like I’m going crazy.",
            "Q_score": 400,
            "Id": "11zmoc0",
            "Url": "https://www.reddit.com/r/Advice/comments/11zmoc0/my_girlfriend_22f_wont_change_her_shampoo_even/",
            "Aswer": "Tell her that one of the two things is going to be leaving, you or the shampoo.\n\n  \nSounds like she already made her choice though.",
            "A_score": 930
        },
        {
            "Question": "He’s going to dump me if I don’t watch Star Wars. What do I do?\nI’m a 39 year old woman with a lot to offer the world, but everywhere I go someone’s mind gets blown because I’ve never seen Star Wars. It makes me feel like a stupid idiot even though I’m a really good person. It gets worse, my boyfriend of 7 months has been telling me that it’s  an embarrassment and unless I get with the program (and like it) I can hit the road. I love my boyfriend but don’t feel like spending 492592 hours getting caught up on a thousand movies starring mystical green babies and robots. What do I do?",
            "Q_score": 401,
            "Id": "11zjuwa",
            "Url": "https://www.reddit.com/r/Advice/comments/11zjuwa/hes_going_to_dump_me_if_i_dont_watch_star_wars/",
            "Aswer": "Break up with him then watch Star Wars.",
            "A_score": 1614
        },
        {
            "Question": "My Boyfriend Deleted All Photos of Me\nI was looking though his phone photos for pictures of us that I wouldn’t have and noticed there wasn’t any pictures of me on his phone. So, I checked his recently deleted and all photos of me are in there. I asked him about this immediately and he promised he didn’t do it. I am still overthinking and now worried there’s something he’s not telling me. However, he does have a three year old sister who plays on his phone sometimes; maybe it’s possible she did it on accident. -but it was hundreds of photos so, I am having a hard time rationalizing this as well.",
            "Q_score": 170,
            "Id": "11zltat",
            "Url": "https://www.reddit.com/r/Advice/comments/11zltat/my_boyfriend_deleted_all_photos_of_me/",
            "Aswer": "My ex did that right before he broke up with me. Said he did it before so he wouldn’t have to after…heads up girl. Idk if a 3 year old would be capable",
            "A_score": 425
        },
        {
            "Question": "Friend ruined my surprise for my birthday\nI was on the phone with my friend earlier and she asked me “you know what (husbands name) is doing for your birthday right?” I said no and she goes oh well I got confused because he said it was a “surprise” in quotes so she didn’t know what that meant, and then went on saying who she thinks will be invited. I told her to stop because I didn’t want the surprise totally ruined! I feel bad because last year he also tried to plan a surprise birthday party which didn’t go as planned. Im pretty annoyed at her for telling me about it and not sure if I should let my husband know?",
            "Q_score": 42,
            "Id": "11zy2n7",
            "Url": "https://www.reddit.com/r/Advice/comments/11zy2n7/friend_ruined_my_surprise_for_my_birthday/",
            "Aswer": "Do NOT tell your husband. He will be so sad. Your friend is an asshole though. You need to be clear with her that she is not to tell your husband you know and that what she did was unkind.",
            "A_score": 80
        },
        {
            "Question": "Ultimate Karen Mamabear, help\nMy 2nd grade son was involved in a scuffle at recess. Before I even heard anything of it from school, I received an email from the mother of one of the boys involved. At the end of it she threatened to file a police report.\n\nPeople are absolutely insane these days but I laughed and dismissed her bizarre behavior. Didn't reply.\n\nUntill one night at 730, a knock on the door to reveal 2 armed patrol officers looking to interrogate my 7 year old son. \n\nThis psycho really called the cops on a 2nd grader. I'm floored.\n\nI'm thinking about going with a Harassment or Restraining Order but what do you all think?\n\nIf she is so mentally unstable as to call police on a 7 year old, what's she liable to do or say if she ever sees my son around school, for example, and I am not there?\n\nThoughts?",
            "Q_score": 85,
            "Id": "11zqjfp",
            "Url": "https://www.reddit.com/r/Advice/comments/11zqjfp/ultimate_karen_mamabear_help/",
            "Aswer": "This is a matter for school administration since it happened during recess. Make an appointment with admin to discuss the next steps.\n\nUsually if police are involved they will contact the school. I'm surprised you haven't heard from the school.\n\nThe thing is schools easily label kids and sometimes those labels affect how they are dealt with going forward. You will want to get their take on the event. It will give you a good idea of how they viewed and recorded the event.\n\nDon't escalate. Investigate.",
            "A_score": 123
        },
        {
            "Question": "How do i handle this feeling of guilt as an (ex?) gay muslim?\nIt is the first day of Ramadan, what used to be one of my favourite “holidays” in the muslim agenda. However, as a college student living away from family it is so difficult for multiple reasons. \n\nI am a gay male, with that comes completely being considered a sin in the muslim community or even within the religion, apparently. So, why would i be apart of a religion that doesn’t accept me? I began to push myself away from the religion and now it’s Ramadan. I cannot even explain that feeling of guilt thats just rooted within me because I don’t want to partake in it. I have to lie to my parents and family in saying i am doing it, but im not. \n\nI was never given a choice in whether I wanna be religious or not anyways, I was simply just born into it. And that is so unfair and no one should EVER be born into a religion, it should be a choice. Anyways, after realizing and accepting myself in that I am not a straight male (and  because of that, my literal existence is a sin), and that i don’t agree with most of the views in that religion, I dont wanna be apart of it. But, that feeling of guilt will always be with me, forever. Being told growing up that your parents will have to suffer if their kids are not religious, or following the religion is traumatizing. It sucks and it is so mentally draining.\n\nHow can i ease this feeling of guilt?",
            "Q_score": 59,
            "Id": "11znneh",
            "Url": "https://www.reddit.com/r/Advice/comments/11znneh/how_do_i_handle_this_feeling_of_guilt_as_an_ex/",
            "Aswer": "Well if you think about it, you were never given the choice to become a Muslim, yes. But you were also not given the choice to continue being Muslim. Others around you decided to kick you out and banish you for how God made you. You don't kick a ball then be mad it rolled away.\n\nOn another note, its easy confuse guilt with other emotions. Regret, loneliness, longing; holidays are strong, cultural times. Maybe you miss the cultural side of it. You may not be able to celebrate Rahmadan with your family, but your college community may have you. Do it for you, not God or Muhammad or anyone else.\n\nPlenty of former Christians Celebrate \"Christian\" holidays because its often not about Christ. It's about community.",
            "A_score": 35
        },
        {
            "Question": "been talking to a guy for a while now and our relationship is getting kinda romantic should i disclose my medical issues to them?\nso ive taken some lab tests today and i got the result of one of the tests but still waiting for the results of the other tests.\n\nanyway so there's a guy ive been talking to and our relationship has started to go the romantic way should i disclose my medical issues with him or no im kind of scared it would scare him off or something\n\ncan someone just tell me what to do i hate being an adult haha",
            "Q_score": 22,
            "Id": "11zr9ek",
            "Url": "https://www.reddit.com/r/Advice/comments/11zr9ek/been_talking_to_a_guy_for_a_while_now_and_our/",
            "Aswer": "If he's the type of person who wouldn't date you over this medical issue, why waste his and your time?",
            "A_score": 60
        },
        {
            "Question": "How to amicably break up with a friend without ghosting them or causing a scene?\nSort of in an awkward situation. I have this friend who I used to enjoy or at least not mind hanging out with. We’ve had two falling outs and the last one was kind of their fault. I don’t want to make a big scene but I also don’t want to continue our friendship. They actually have a lot of friends, and I’m the more introverted one. I honestly don’t know how we even became friends in the first place; I feel like we don’t have much in common and I honestly don’t love spending time with them (sometimes they say things that aren't the kindest - e.g. made a comment about someone being introverted and sitting alone, even though I'm introverted and often do that). They think we’ve “made up” and want to even work on this group project with me. I was prepared to just say, hey, I think I need some time away, but when they came to apologize, I just chickened out and felt so awkward being rude to them (especially since they didn't do anything majorly wrong) and now they think we’re good again. Idk how to “break up” with them without hurting their feelings.",
            "Q_score": 27,
            "Id": "11zkudl",
            "Url": "https://www.reddit.com/r/Advice/comments/11zkudl/how_to_amicably_break_up_with_a_friend_without/",
            "Aswer": "Do you really have to formally break up? They did didn't do anything seriously wrong correct? You do get to choose who you spend time with for sure. My advice to spend less time with the people you don't get along with. It's not always necessary to formally \"break up\" with friends. Its better to maintain a circle of acquaintances. Some of these people are close friends, some are just friends, and some are just people you know from school. No need to formally reject anyone. Just tell this person that you're good with the people already on the group project.",
            "A_score": 17
        },
        {
            "Question": "Relationship advice please help\nHey guys I need some help with this relationship that I’m in. I’m a 22 F and my bf is a 32 M. I met my bf in university and he kept telling me that his birthday was to where we were only 2 years apart (1998). For several months, I was rather suspicious of this because there were photos of him on Instagram tagged in frat formals from dates to where if that was his birth year, it wouldn’t have made sense because it would mean that he would be in high school. During Xmas, I finally went through his license and saw that his birthday was in 1990 instead of 1998, making him actually 10 years older than me. I felt betrayed seeing this and tried to forgive him. Despite this, I cannot help continue to be reminded of this from time to time and how he basically lied to me for almost a year of our relationship. I love him a whole lot, and believe that he’s the best for me but I cannot get over this big lie he kept from me. What should I do?",
            "Q_score": 54,
            "Id": "11ytvy7",
            "Url": "https://www.reddit.com/r/Advice/comments/11ytvy7/relationship_advice_please_help/",
            "Aswer": "OP: I need advice\n\n\nThe sub: he’s untrustworthy and you should leave \n\n\nOP: Not that advice",
            "A_score": 174
        },
        {
            "Question": "underage coworker has a crush on me and my other coworkers are encouraging him to “shoot his shot”\n15 minutes ago, i just found out that one of my coworkers has a crush on me. he’s 17 and i’m 20, and i genuinely really liked being coworkers/friends with him, but now i feel weird\n\nmy other coworker told me that our manager told him to “shoot his shot,” and a lot of people ship us. apparently it’s been very obvious that he likes me, but i’m one oblivious ass mf. \n\na while ago, our assistant manager said she thought we would be cute together, despite the age gap. i know age gap isn’t a very big deal to most people, but he’s still in highschool, and he is not ugly, but i am not attracted to him.\n\nhe turns 18 in january and said that he plans on moving, but he wanted to hang out with me on his summer break and i really wanted to, before i found this out\n\nhe doesn’t know that i know, and i don’t know what to do or say. i turned 20 in september and this is my first time actually being an adult, so i’m fucking clueless. \n\nwhere do i go from here.",
            "Q_score": 35,
            "Id": "11yviuy",
            "Url": "https://www.reddit.com/r/Advice/comments/11yviuy/underage_coworker_has_a_crush_on_me_and_my_other/",
            "Aswer": "Let everyone at work talk. \nGossip will always be there. \n\nJust be his friend. If he does ask you out. \nTell him that the feelings are mutual and just keep bring friends if that works for the both of you. \n\nDon't let others ruin something nice",
            "A_score": 39
        },
        {
            "Question": "I'm being scammed and need advice\nI sent nudes to a girl and she is threatening to post the nudes on the internet unless I pay her a huge amount of money. Please, I'm scared and need advice\n\nEdit. Nothing has happened of yet. I told her that she is in possession of CP and that it carries a hefty sentence. I also blocked and reported her on all social media. Thank you everyone for the advice, I really appreciate it",
            "Q_score": 165,
            "Id": "11yg66i",
            "Url": "https://www.reddit.com/r/Advice/comments/11yg66i/im_being_scammed_and_need_advice/",
            "Aswer": "Block and delete here.  And move on. \n\nLife lesson.  Never send anything or say anything online.  That you do not want the world to see. \n\nOwn it and move on.",
            "A_score": 474
        },
        {
            "Question": "My Uncle is Pooping Himself in Public\nMy Uncle has a disease (Huntingtons). He is at the point where his movements are dramatic. He also poops and pees himself. He refuses to wear a diaper. We were out at the barbers today and he pooped himself in public. What do you think about him going in public? What do you think about people wearing diapers in public? Should he be staying home completely? I need your advice. I can’t thank the people on this sub enough for the help.",
            "Q_score": 22,
            "Id": "11yyzn5",
            "Url": "https://www.reddit.com/r/Advice/comments/11yyzn5/my_uncle_is_pooping_himself_in_public/",
            "Aswer": "He can wear diapers with clothes over them in public.  \n\nOther people have to wear diapers too.  Usually they fit well under the clothes.",
            "A_score": 79
        },
        {
            "Question": "I lost my best friend in a car accident two weeks and my father told me that I was weak to cry over it and that I’m weird for taking it so hard.\nHello my name is Brian I’m 17 years old. Two weeks ago I lost my best friend Hayley to a car accident she was 18 years old. I met her in kindergarten and we were best friends ever since. She was so nice to me and we were pretty much like siblings we talked every day. Not being able to call her or be able to just go see her whenever I want to and give her a hug is just killing me. I’ve been calling her phone just to hear her voice on her voicemail. My father saw me crying in my room yesterday and told me to man up and that I was weak. He also told me that it was weird that I was taking this so hard since she was just a friend and not family. I’m really struggling right now and could use some advice I just feel lost right now.",
            "Q_score": 209,
            "Id": "11ydsjq",
            "Url": "https://www.reddit.com/r/Advice/comments/11ydsjq/i_lost_my_best_friend_in_a_car_accident_two_weeks/",
            "Aswer": "old man here... your dad, is wrong.\n\nit's a left over of a time where men were to stupid to allow life to actually be life.\n\nyou feel what you must, do what you must, just ignore his stupidity and ignorance of a time that should be long gone",
            "A_score": 212
        },
        {
            "Question": "I (24F) went through my bf (24M) phone\nLike the title suggests yes I went through his phone and I know that it’s a very bad thing and will not do it again!! I did find a few things that bothered me. My bf still has all of the nudes from his ex and chats from when they were together. Now I have it the benefit of the doubt and said to myself that he forgot about them, but what I thought was worrisome it’s the fact that the chat is muted. There were no new text messages between them, but still, I’ve been thinking about it a lot… at times based on his behavior I do get the feeling of him not being completely over his ex, but apart from that what should I do now?",
            "Q_score": 32,
            "Id": "11ypvpy",
            "Url": "https://www.reddit.com/r/Advice/comments/11ypvpy/i_24f_went_through_my_bf_24m_phone/",
            "Aswer": "I can go through my husbands (25+ years married) phone whenever I want - as he can go through mine.\n\nThe thing is, I don't - not even because I trust him but more because I can't be bothered to look for something. \n\nTalk to him about how you feel - communication is key here.",
            "A_score": 55
        },
        {
            "Question": "My husband just passed away this morning\nHi r/advice…. I’m on mobile so I’m going to apologize for my formatting now but, \n\nMy husband just passed away this morning and I need help figuring out what to do. I (25f) and him (34m) just moved into our own apartment 4 days ago. Not to mention the fact that I can’t stop thinking about the moments before he died(I had with him all day up until it happened) I also have a bunch of bills and things like his phone and computer, that need to be paid off but won’t be used anymore. So I guess I’m just looking for some guidance, also a therapist would be nice…\n\nEdit: Thank you all so much for the overwhelming support, also him and I worked the same job(local truckers that team drive.) I’ve talked with my boss already and he is going to cover funeral/cremation costs for me. The main problems I’m having right now are: where am I going to live and what am I going to do for work?(I don’t really want to go back to trucking cause that’s what brought us together)",
            "Q_score": 913,
            "Id": "11xxdca",
            "Url": "https://www.reddit.com/r/Advice/comments/11xxdca/my_husband_just_passed_away_this_morning/",
            "Aswer": "r/griefsupport",
            "A_score": 481
        }
    ]
}