{
    "Posts": [
        {
            "Question": "I found 10,000 in my buildings parking lot.\nI just moved in. 10,000 in an envelope that i can tell has been in someones pocket. A ton of people live here and multiple buildings. Im hesitant to give it to management bc i dont want it to not get delivered to whoevers money it is. What would you do? No this is not a joke lol",
            "Q_score": 1071,
            "Id": "11muxxf",
            "Url": "https://www.reddit.com/r/Advice/comments/11muxxf/i_found_10000_in_my_buildings_parking_lot/",
            "Aswer": "Just hold it and wait.  \n\nAnyone you give it to is going to potentially keep it.  EVERYONE.  Cops, management, etc ... if you're set in your heart to do good, HOLD IT, say nothing, and listen like a doormouse.  Someone will talk about losing it.  \n\nBUT if you talk about finding it ... you are most assuredly getting assaulted, robbed, or accused.",
            "A_score": 3564
        },
        {
            "Question": "Our mom is out of town and we want to take some pictures of us being unsupervised kids that are up to no good, we are in our 30's, any ideas?\n",
            "Q_score": 547,
            "Id": "11n0dvn",
            "Url": "https://www.reddit.com/r/Advice/comments/11n0dvn/our_mom_is_out_of_town_and_we_want_to_take_some/",
            "Aswer": "Big snack piles, marker to the wall, an R rated movie. Just think of all the things you wanted to do as a child lol \n\nThis is hilarious I love this idea.",
            "A_score": 594
        },
        {
            "Question": "my mom won’t let me go to a guys house\ni want to hang out with this guy at his place but my mom won’t let me. we’re mostly hanging out to do a project. i’m pissed because i’m gonna graduate high school soon and i haven’t had any fun experiences  cause of my strict parents. me being 18 doesn’t mean anything to her how do i convince her?\n\nprobably should have mentioned im not gonna fuck him… he has a gf and i don’t think neither of us are interested in each other that way\n\nedit:\nregardless of all the things i have done before, i’ve always lacked privacy in my own home. i’ve never been able to close my bedroom door and i had my phone taken away every night until i was 16, i had it checked all the time. the wifi was also turned off during my summer vacations and after 10pm also until i was 16. i’ve had good grades for me entire school career up until this year(probably senioritis) my mom has also picked my friends and has told me who i can and can’t hang out with. all of this has been happening since before i started doing stupid shit like drugs.(it’s been a one time thing) my mom doesn’t know about any of this. i always have to tell her where i’m goign who i’m going with and update her on what i’m doing everyone other hour. i don’t even facetime my friends because my mom is always eavesdropping in our small apartment. and yeah i finally got out of that online “relationship” thing and i started going to therapy cause of it. anyways this is all to provide more context. i’m not shaming or criticizing my parents parenting. i was raised a little differently from all my friends and i’ve never been able to stop comparing how i live at home vs how my friends live.",
            "Q_score": 109,
            "Id": "11n5psw",
            "Url": "https://www.reddit.com/r/Advice/comments/11n5psw/my_mom_wont_let_me_go_to_a_guys_house/",
            "Aswer": "How about you ask mom to make you guys some snacks and you invite *him* over to your place. that way, mom gets to meet him and everything's safe. I mean, you have to start *somewhere*.",
            "A_score": 378
        },
        {
            "Question": "Does my job make me a loser?\nI’m a guy in my 20s. I work as an insurance claims adjuster. I handle auto claims. So if you back your car into a post in the Walmart parking lot, I’ll be handling your claim to get your car fixed. I get yelled at all the time.\n\nThe pay is decent for living in the Midwest and being in my 20s. I make about $60,000 a year. But I just feel like a loser when I tell my friends, family, or potential girlfriends what I do.\n\nI feel like it makes me seem boring and like a loser? What do you think?",
            "Q_score": 47,
            "Id": "11ncrzi",
            "Url": "https://www.reddit.com/r/Advice/comments/11ncrzi/does_my_job_make_me_a_loser/",
            "Aswer": "It's a good solid job that you should be proud of. Your own view of it is probably impacting other people's perception of you.\n\n\"Yeah I just do claims... You know take a few pictures, write a few numbers\".  Yawn.\n\nIt may not be the most exciting job (most aren't) but you probably have some good stories to tell.\n\n\"Oh my goodness I'm a claims adjuster and let me tell you about the time I found a X in this person's.....\"\n\nYou get the idea. People want to be around fun people. If you can make it fun it'll become... Fun (I feel like I've said fun to often).\n\nIf not, that's okay, jobs suck.\n\nAre you maybe missing some hobbies or other activities? Make yourself more then your job.\n\nThanks for posting this, it was interesting to think about and try to help.",
            "A_score": 77
        },
        {
            "Question": "My partner split up with me, 6 months later texting me about dental bills\nWhen I lived with my partner I paid for a discounted dental plan for both of us through my employer's scheme. He insisted it wasn't working between us and I needed to move out. I texted him a month later to say I needed to take him from my insurance. He asked if he could pay to keep me on it. I said I'd look into it, I did and it was pretty clear that it was a plan for me and my partner so I notified HR who changed all of my policies to be me only. I didn't tell him as I was trying to move on and not have too much contact.\n\nA few months later he asked if he was still on my insurance. I said he wasn't and he texted me back saying I didn't tell him and now he has dental bills. I did tell him but I also told him I'd look into keeping him on and didn't update him.\n\nSome time later he texted me about how his energy bills are going to bankrupt him.\n\nToday he asked me again if he was definitely not on my insurance. Of course I said no and then he told me he'd got a £3k bill to pay. I told him when we broke up he was no longer eligible for cover. He texted back \"oh dear\", then suggested I could move in until he's paid for dental work. \n\nI just feel incredibly guilty about it. If he was still with me the insurance would cover some of the expenses. Just the idea of him struggling with everything is eating away at me. I almost want to just send him a cheque to cover his bills.",
            "Q_score": 93,
            "Id": "11n1h4y",
            "Url": "https://www.reddit.com/r/Advice/comments/11n1h4y/my_partner_split_up_with_me_6_months_later/",
            "Aswer": "Please don't do that. He was the one who ended things, not you. You owe him nothing.",
            "A_score": 266
        },
        {
            "Question": "How can i explain to my gf that adding a bathroom to a new home isnt a priority?\nMe and my gf are in the final stages of purchasing a new home and we have all kinds of ideas to improve and customize an already renovated  home to our liking.  It’s a single family 2 bathroom 4-1/2 bedroom house. In the top floor where we are going to have our master bedroom does not have a bathroom. My gf always wanted a third bathroom to be added which isnt a problem to me, because the two bathrooms are in the middle and basement floor respectively. \n\nUpon getting the house inspection done, it has been revealed that the water heater, and hvac system is 3-4 years past its  life expectancy and i would like to have that replaced before all other improvements are made. To me, it takes more of a priority over a bathroom because #1, a third bathroom isnt absolutely needed, Its more of a want imo and #2, the other two bathrooms have been renovated and look very good aesthetically. \n\nMy gf doesnt look at the hvac situation as seriously as i do and is dead set on this bathroom. She doesnt seem to be budging on this. What do you guys think? Btw, i would do both repairs/additions at the same time, but money plays a factor. The price to add a bathroom could be the same or more as the hvac system. We haven’t moved in or gotten proper estimates yet.",
            "Q_score": 208,
            "Id": "11mstbg",
            "Url": "https://www.reddit.com/r/Advice/comments/11mstbg/how_can_i_explain_to_my_gf_that_adding_a_bathroom/",
            "Aswer": "I will add, that I can see her point about wanting a bathroom on the same floor as your bedroom.   It will be a pain in the ass to go up and down stairs when you have to pee in the night.   I would really hate that.   \n\nHowever, working AC and water heaters are necessities.",
            "A_score": 574
        },
        {
            "Question": "Should I break off the wedding? Fiancé hates my dad to the point of hurting me\nEdit: explaining what fiancé did to provoke dads behavior-he was having a bad day at work and yelled and was cussing not really at me-but in general. He also threw a drawer straight down on the floor because of how worked up he was. Once again none of it was at me or directed towards me in any way. But my dad felt like you shouldn’t talk to my daughter in that way-“she’s a lady.” When he confronted my fiancé my fiancé said “I shouldn’t have acted that way BUT-I was mad. My dad blew up because he felt since my fiancé had to throw a BUT in there-he wasn’t actually that sorry.\n\n\nI was raised by a single dad. My dad has a lot of faults-one of him is the way he talks to people is disrespectful and he has a temper. He never physically hurts anyone but he’s not afraid of cussing someone out. I know he has wrongs but I also see the damaged side of him and what he went through after mom left. So I still love him for all the years he was hurt and raised me. \n\nAbout 2 months ago my dad got in a huge fight with my fiancé. My fiancé was initially in the wrong. Dad got to the point where he went to my fiancés work and cussed him out in front of his boss. And then went and told my fiancés parents all his issues he has with me marrying my fiancé. \n\nI called my dad and yelled at him and told him he went way to far and didn’t talk to him hardly for like 2 or 3 weeks. But I still love dad. As wrong as he may be. My fiancé has not dropped it since. He brings it up about once a week how much of a jerk my dad is and how much he hates him. After I told him he needed to let it go because it was causing us to fight he stopped talking about it as much. But still brings it up occasionally. I try to let him get his temper out but then he will say something like I never want your dad at the house again. If you want to see him it can’t be on my property. And I think to myself he hates my dad so much that he’s willing to hurt my relationship with my dad because of what he did? Like I feel at that point he’s ok with hurting me. \n\nI try to explain to my fiancé that I know my dad did a bad thing but I feel he doesn’t care about my feelings when he’s making me take half the punishment by saying I don’t want your dad to ever come over and see our new house. But he sees it as me defending my dads behavior. I’ve tried to make him see my perspective for months. And I’m also trying to register how much my dad embarrassed him and of how my fiancé is acting is justified in any way…..\n\nShould I break this or not?",
            "Q_score": 294,
            "Id": "11mfd2v",
            "Url": "https://www.reddit.com/r/Advice/comments/11mfd2v/should_i_break_off_the_wedding_fiancé_hates_my/",
            "Aswer": "ESH? Wrong sub, but I stand by it.\n\n1. Your fiance throwing a drawer because he was mad about work is a major red flag.\n\n2. Your dad *going to your fiance's work and his parents* is WAY overstepping.\n\n3. Both these men seem to have serious anger issues, and need therapy. I think you could use a break from both of them.\n\n4. I strongly recommend you seek therapy, too, because growing up with your dad's anger issues seems to have normalized it for you, and that can set you up for making excuses for romantic partners with anger issues, too.",
            "A_score": 1188
        },
        {
            "Question": "I am dying, I don’t want people to know. What should I do?\nI just started therapy so Reddit is not the only place for this but I am feeling alone. I don’t want to tell people I have less than a year to live. I’m so fucking exhausted. Chemo is horrible. My body is failing me. I have nothing left to live for and I don’t want to be around my crying family and friends. I don’t want anything anymore but to just hurry up and die. Sorry I know it’s morbid but it’s how I feel. Can barely type this. The hospital is depressing and I feel like I’ve done nothing in life worth anything and I’m only in my twenties. How do I feel better again and does it even matter if I do if I’ll be dead soon anyways? Idk anymore",
            "Q_score": 189,
            "Id": "11mi3go",
            "Url": "https://www.reddit.com/r/Advice/comments/11mi3go/i_am_dying_i_dont_want_people_to_know_what_should/",
            "Aswer": "I understand how you feel. I was a terminal cancer patient with no options. I had cancer before but was stage 3, then 10+ years later it came back much much worse. \n\nMy doctors were fantastic and called all over the country to see if they could find anyone with my specific diagnosis. They found a hospital that had done an experimental procedure 3 times. Out of those one worked, the others passed.  I had 4-6 months left or try this experimental procedure which could be deadly. \n\nMy family and friends were completely sympathetic but I alone had to deal with my decision either way. \n\nI decided to do the experimental procedure. I was scared shitless and consistently depressed. I was heavily medicated for anxiety and panic attacks. I couldn’t get out of my own head for a long time. Fortunately I’ve been in remission for 2 years. The other person who had the procedure and lived has now died. I don’t know how long I have months to 20+ years. I’ve been where you are and I could be again. It’s all a mystery. \n\nPlease don’t give up and find just one person, even another terminal patient, to talk with. Having a horrible situation in common can be cathartic. \n\nPlease feel free to message me if you would like to talk. I’m sending you healing and peaceful vibes.",
            "A_score": 173
        },
        {
            "Question": "My boyfriend (23m) is a dealer and won’t get a legal job what do\nHello everyone, I (22f) am having a hard time with my bf (23m). We have been together for almost 6 years, as the title states he is a dealer. I have been trying to encourage him to get a job for years, and he acts like a complete man child about it, he has a temper problem when it comes to any kind of authority over him. Other than that we really don’t get into disagreements so it makes this harder for me. When we started dating we only did it because it was what we had to do if we wanted food or shelter, but now he’s became lazy. He just wants fast easy ways to get rich (y’all don’t even know how many crypto scams I have prevented him from giving our savings to) and not put in effort for anything he wants in life. Obviously I can’t just change him and make him work, but idk what to do anymore and I’m tired of it. To make things worse I’m a very introverted person and don’t have any near friends I could just move in with if I decided to leave. I hate saying I’m with him only for financial reasons because I do really love him, but ultimately if I had the money I would have been gone long ago. He just keeps saying he’s going to get a job as an “entrepreneur” but as I said he wants everything handed to him with no effort.  Anyways what can or should I do?",
            "Q_score": 353,
            "Id": "11mb9g6",
            "Url": "https://www.reddit.com/r/Advice/comments/11mb9g6/my_boyfriend_23m_is_a_dealer_and_wont_get_a_legal/",
            "Aswer": "Stop trying to change his life, and start focusing on changing yours so you can work towards leaving him.",
            "A_score": 679
        },
        {
            "Question": "I (M20) am being bullied at college and I don't know what to do\n this is going to be long sorry, but I need to get it out, I have been depressed for a while and I can't get any work done, and I am typing this on my phone in a rush so sorry in advance.\n\ngenerally I don't believe reddit because I was being bullied at school and made a post about it and you guys told me college will be different and it will be the best days of my life, its not, but I don't have someone to talk to about this so I will post here, I am in my second year of CS, I'm the nerdy type of person, I'm also probably on the spectrum, and I can't talk properly, I keep suturing and I can't explain my thoughts properly, but I am doing great academically, actually I was doing great.\n\nI was bullied really bad in high school, I'm quite skinny and I don't look threatening or strong, and I am around 6ft which makes me look quite lanky, anyways, people would just take my stuff and humiliate me in general and if I tried to stand up for my self I would be beaten or they'd break my stuff, I had to lie to my parents about why my glasses were being broken, and eventually I just stopped using them and tried to attend school without glasses, I became quite depressed and my grades suffered, it never stopped until I ended up fighting someone of the bullied, another 6ft guy but much more mascular than me, I gave him a black eye and suddenly teachers cared enough and sent me to the principal, anyway, the bullying stopped because they knew I could actually hurt them.\n\nnow at college, there is this guy, a general asshole, very sociable and popular, there was a project and it required teams, I couldn't find a team because I am socially retarded, but we ended up in the same team, he didn't do any work at all, and was being demeaning to me, things like \"I don't really care what you think we should do\" or \"idgaf about your opinion\" for simply talking about what I think would be the best idea for the project, I got angry and told him to shut the fuck up and that he wasn't even doing anything, other group members got mad at me because \"he's just joking\", and they started making me the butt of every joke, project was done, I did most of the work, got an A+.\n\nbut the popular guy just keeps making fun of me behind my back, and people generally started avoiding me more, when we worked together he was gossiping a lot about people, \"this guy is gay\", \"this girl is a hoe because blah and blah\", mostly comments making fun of other guys and comments about other girls, mostly untrue tbh, and he keeps doing the same thing about me now with other people and now I look like a joke because he's spreading things about me that is untrue I know that for sure.\n\nnow I can't go to someone with this, they won't care lol, we're supposed to be adults I doubt any normal older adult will care, and if I beat him up I will be arrested because its not just a random underage school fight, at this point it will be considered assault, and I cant verbally stand up for my self, he is much more sociable and well spoken, and I can't form a sentence without stuttering, its just a world built for neurotypicals and I am considering killing my self tbh, or at least saving someone, quitting school and doing hard drugs until I overdose and die, it will only get worse from here, I will encounter people like this in my future career, relationships etc, and I am disadvantaged because I don't know how to talk, my gpa went down really bad, I got a D in two of subjects due to the social and humiliation rejection I encountered, I am pretty sure I am getting PTSD from school days, and I can't think about anything other than hurting this person, even if it will get me expelled or arrested.",
            "Q_score": 36,
            "Id": "11mmyfh",
            "Url": "https://www.reddit.com/r/Advice/comments/11mmyfh/i_m20_am_being_bullied_at_college_and_i_dont_know/",
            "Aswer": "There's a bunch of trolls who are commenting in here.  Ignore them.  \n\nPlease see someone in administration and report this.  Gather as much as evidence as you can too.  Start recording his behavior with your phone for proof.  Try not to engage in his immature behavior.  \n\nAlso, let the school know of your mental and social struggles you're having.  \n\nIgnore the haters.  Be strong my friend.  I know it's easier said than done.  Take a deep breath.",
            "A_score": 28
        },
        {
            "Question": "Is it worth reporting to the police that someone has accessed my back sunroom and killed (stabbed) my 2 pet birds?\nI have, or had now, 2 small pet birds. A budgie/parakeet and a canary. They both live in separate cages. Their cages are kept in a back sunroom. It seems I forgot to lock the outside access door when I went out (have had lots on my mind recently). When home I found they had been stabbed, cut up, inside their cages, blood and feathers. No valuables are kept in this room and I'm unsure if anything is missing. This is quite disturbing.\n\nThey are only small birds but were pets. I know it's not like having a cat or dog killed but I had trained these little guys to hand feed, use swings and the budgie had started to talk a couple of words. The canary was currently nesting with 4 eggs (infertile). \n\nI don't want to have the police laugh at me or be accused of wasting their time. Do you think they would take this seriously? I will be looking up about animal cruelty laws and attacks on pets etc anyway.\n\nWhat kind of sick person would kill a small animal inside a cage?\n\n\nThis might sound weird but over the weekend late at night someone tried to break down my front door. From the voices it was at least a couple of guys. They were calling out the name of an ex-friend. I'm in the process of getting a restraining order on that former friend as I believe they were involved somehow. I'm assuming the bird deaths are probably/obviously related to that somehow.\nUnsure now to add the birds onto that order too. Or just make a new separate report to the police. Or just try move on. As upsetting as this is I already have enough things currently to deal with in my life.\n\nJust thought some advice might help. My head hurts at the moment to think straight really.",
            "Q_score": 41,
            "Id": "11mhnfs",
            "Url": "https://www.reddit.com/r/Advice/comments/11mhnfs/is_it_worth_reporting_to_the_police_that_someone/",
            "Aswer": "Someone broke into your home and brutally murdered your pets very shortly after a group of people tried to break down your front door. YES this is worth talking to the police about. \n\nDon’t ignore this. Lock your doors. Get a security system.",
            "A_score": 132
        },
        {
            "Question": "27M my girlfriend is leaving me because I don't have money\nBasically I'm 27m unemployed for 3 years and I cant find a job, I liked this girl and we started dating, I didn't wanna feel small to her so I'd usually spend money from my savings on dinners and gifts etc, now Im literally broke so when we hang I take her to cheap places or the park or just a car ride and yesterday she got upset when I said I don't have money to go to the movies and said \" you're the man you should be able to take care of me \". It honestly broke me to pieces and almost cried and idk what to do, I'm an engineer but I am having an extremely hard time finding any job even one not related to my field, my bank balance is 0 and all the cash I got is around 40$\n\nWhat do I do?",
            "Q_score": 794,
            "Id": "11ls1cg",
            "Url": "https://www.reddit.com/r/Advice/comments/11ls1cg/27m_my_girlfriend_is_leaving_me_because_i_dont/",
            "Aswer": "You need to worry less about dating and more about the fact that you have no money to support yourself.",
            "A_score": 4024
        },
        {
            "Question": "I just want my name change to be respected.\nI’m going to try to make all of this simple to you guys since it’s rocket-science to my family that I wanted a feminine name and gave it to myself. I just wanted to feel satisfied. \n\nI was born with a name that I did not like, so I changed it last year when I was 19. I’m 20 now and my family still can’t get with the program. I changed my name because I always hated it. My mom named me something so masculine. Before you guys get on me, I’m aware that gender neutral names exist but this wasn’t that. This wasn’t a “Jordan” or “Alex” situation. She named me after a famous male actor because she thought he was sexy and she’d never heard of a girl with his name before. She said I was going to be named that no matter if I was a boy or girl. Then, to make shit even worse, she gave me a feminine middle name. I’d been getting comments and questions about my name since I was in elementary school and I was seven years old telling myself that I’d change my name because I was just so tired. I just wanted to not be embarrassed. \n\nThe last straw that lead me to change my name was when I was at work and a guy asked me my name. I told him and he raised a brow and asked “Like the actor?” and I told him yes. Then, he proceeded to say “Well, you’re still beautiful anyway” and left. That was when I started the process of legally filing to change my name. \n\nWhen the name change did finalize and happen, my mom just couldn’t understand my choice. She compared it to how transgender people change their gender (I couldn’t get a grip on her comparison) and she compared my name to her name, saying she’d been teased all her life but her name is very much just feminine and Biblical. People know she’s a woman before they see her face but I had people thinking I was a guy before they ever even saw me because my name was so masculine.  She said I should’ve took that as a good thing and used every excuse in the book to avoid understanding my perspective. She even said it was disrespectful. Disrespectful for me to want a girly name so that I can live within my girly self? Disrespectful for me to not want to feel bad when people made unnecessary comments and said that my birth name was a “boy name”? \n\nRegardless of me changing my name, my family still continues to call me by my old name. I’ve tried to reenforce it but they just won’t listen. However, they always expect me to respect them but deliberately choose to ignore my wishes. Only a FEW people in my family try to respect my name change and best believe I can only count on one hand. I’ve received better support from friends. My dad told me on the phone that he would still call me by my birth name but he still mixes it up and calls me by both names. My big sister says she’s not calling me by my new name because she’s not used to it and I don’t look like the name that I’ve picked. Sometimes I feel like I’ve done this for no reason. \n\nI’m going to the military sometime this year and I’ve made it a goal to get this respect thing situated. I’m old enough to receive the same respect the adults in my family expect from me so if they’re still doing this to me when I join, I’m cutting them off. I even told myself that they’d be banned from my wedding if I get married and even the birth of my children if I have any if they can’t respect my choice. My wedding invites and baby shower invites would say my new name and I don’t need any confusion or embarrassment when my family meets my future husband’s family. The way my family is acting, they’re going to miss out on all that stuff. \n\nIt’s not THAT hard to call someone what they want to be called and I don’t know what I can do to change them from being ignorant.\n\nEDIT: Why would my mom throw trans people in the mix when if I did want to be trans, I’d have to take one less step considering the fact that my name literally used to be masculine? She set me up with a masculine name anyway so I wouldn’t have had to change my name if I wanted to be a male. It makes no sense. Give a girl a masculine name and then get mad at her for wanting a feminine name instead? Am I wrong?",
            "Q_score": 87,
            "Id": "11m4ie7",
            "Url": "https://www.reddit.com/r/Advice/comments/11m4ie7/i_just_want_my_name_change_to_be_respected/",
            "Aswer": "> I told him and he raised a brow and asked “Like the actor?”\n\nNow I'm just imagining you're named after Willem Dafoe, because what other name than Willem would a person instantly connect with an actor and not just... a name.",
            "A_score": 116
        },
        {
            "Question": "My bf (24 m) went to the dentist for the first time, and we need some general guidance on how to proceed\nMy boyfriend's parents never took him to a dentist (we dont have any idea why) and hes finally gone and gotten an exam. We're looking at dealing with some periodontitis, 2 root canals, wisdom teeth removal and several fillings. He's kept up with his dental hygiene well, he just never went to a dentist. He doesnt have insurance and is not eligible for care credit. I might be eligible but i havent applied yet and dont know if I'd be able to use my care credit for him. any advice on how we're supposed to navigate this situation would be amazing. Thanks",
            "Q_score": 38,
            "Id": "11majg8",
            "Url": "https://www.reddit.com/r/Advice/comments/11majg8/my_bf_24_m_went_to_the_dentist_for_the_first_time/",
            "Aswer": "I recommend reaching out to the closest college with a dental school. They have clinics where they teach dentists that are usually cheaper and will usually work out a payment plan.",
            "A_score": 91
        },
        {
            "Question": "Ex girlfriend keeps degrading me on social media\nSo I broke up with my ex a while ago now but she keeps posting videos on her tiktok about me either degrading me making fun of me or showing embarrassing screenshots of chats..\n\nI don’t know what to do as I’ve tried texting her about it and she just posted that too and she has a relatively large social following too and she uses it as leverage for EVERYTHING; social media is this girls life.\n\nWhat do i do? It’s really starting to bother me. And it’s humiliating.",
            "Q_score": 22,
            "Id": "11mbuir",
            "Url": "https://www.reddit.com/r/Advice/comments/11mbuir/ex_girlfriend_keeps_degrading_me_on_social_media/",
            "Aswer": "Block her. Stop looking. Stop texting her. Move on. She will get bored and do something else.",
            "A_score": 78
        },
        {
            "Question": "My friend is eattings his cats food.\nMy friend a 19m has recently brought a all white kitten he called cracker (a separate issue we are arguing about). Since having the cat he has increasingly been smelling of the feed his being giving to the kitten. At first on his clothes and slightly on his breath. At first I didn't think much of it as I know that wet cat food does smell and I believed it was lingering around him after feeding the kitten. That was until I crashed at his house the other day.\nWe had consumed a fair amount of alcohol the night in question.it was around 2.30am we both hit the sack and had taken ourselves to bed. I laid on my phone for around 20 minuites before getting up to go to the toilet before I was to sleep for the night, as I was walking to the bathroom I caught him wet food pouch in had eatting it straight out the packet with a spoon. I'm not convinced he saw me, this was a week ago. I need to say something, it's not right nd can't be healthy but how do I approach the subject? Please help!",
            "Q_score": 153,
            "Id": "11ltlca",
            "Url": "https://www.reddit.com/r/Advice/comments/11ltlca/my_friend_is_eattings_his_cats_food/",
            "Aswer": "Just call his ass out about it. You’re bros, right? Just be like “dude I saw you eating cat food the other day, WHAT THE FUCK?!” \n\nHe will stop and you give a new nickname of Cat Breath. It’s friendly, but helpful banter between dudes.",
            "A_score": 148
        },
        {
            "Question": "is the woman being fat a consideration for men?\nI'm 26f, well read, well spoken and with a well rounded personality. And I'm always well dressed, take care of my hygeine, and smell nice. I'm decently attractive.Also, I'm fat. I have an hourglass figure but in plus size. \nThis guy(27) and i have been casually going out for 6months, he's nice and we have a lot of fun (non sexual).  He calls me pretty, says all the right things, is always up for hanging out, always eager for asking me out. We've also indulged in sexting and that's been a lot of fun. \nButtttt. When we meet up in person, he makes 0 advances. And that's confusing. I wanna ask all the men and even ladies who have an SO- is a woman being chubby unattractive to men? And if not, what could be the possible reasons for his disinterest?",
            "Q_score": 53,
            "Id": "11lx23p",
            "Url": "https://www.reddit.com/r/Advice/comments/11lx23p/is_the_woman_being_fat_a_consideration_for_men/",
            "Aswer": "People have preferences. He may just be better at texting than he is communicating on the spot. It probably has nothing to do with your weight, tbh.",
            "A_score": 152
        },
        {
            "Question": "Is it normal to be attracted to masculine women?\nGuys I don't know if this is normal. I'm definitely a straight male. I have no attraction whatsoever to men. But women who are somewhat muscular and have short hair really seem attractive to me for some reason. Even better if I feel like they might stand up for me or protect me.\n\nWhat does this mean? Does this make me less of a man?",
            "Q_score": 351,
            "Id": "11lk8b9",
            "Url": "https://www.reddit.com/r/Advice/comments/11lk8b9/is_it_normal_to_be_attracted_to_masculine_women/",
            "Aswer": "Attracted to women, somehow thinks that's gay. Just... think about it for a second lol",
            "A_score": 681
        },
        {
            "Question": "Confused about my sexuality and in the process of losing the one person I was ever comfortable with.\nI'm having trouble finding a subreddit this fits in, but am desperate to send it off somewhere!  It just mysteriously never showed up on the other ones I've tried, so I wonder if the mods just quietly deleted it, or never let it through.  I hope this is okay to post here.\n\nI don’t know what I hope to get out of this post.  Maybe advice, or information that seems relevant to any of it, or just your own stories if you’ve been through anything like this or find any of my problems relatable.  I want to know it isn’t just me. There’s a lot to unpack here, and I don’t know how to organize it all, so here we go! It’s going to be incredibly hard to follow, and I’m sorry for that.\n\n---\n\nI seem to be broken.  The hardware is all there, but the software was never installed,  Maybe the software is in there, but too buggy to work.  I don’t know.  All I know is I’m 25 and have never had sex, and don’t really have desire to.  I mean… I want to try, now, sort of, but haven’t always.  I want someone to appreciate my body.  I wish I had let someone appreciate it when it was younger and stronger and tighter.  I age, and lose my opportunity to explore, to be desired.  I am not religious; it is not that Catholic Shame that prevents me from sex.  It just horrifies and disgusts me.  I evolved for multiplying, and the sex that is a necessity for it.  Sexuality is a big part of being a mammal, of being a human.  Why why why do I lack it?  I can enjoy looking at a man, generally don’t enjoy looking at women the same way, and tend to be more comfortable when the view excludes the genitals.\n\nMy external sex organs feel uncomfortable and creep me out a bit, but not as bad as they used to.  I have not been a victim of sexual abuse.  I am not transgender.  I feel like a woman, and would be unhappy with a penis.  (Any ideas what could be up with me here?)  Physically and mentally, I am a woman; however recently I have come to wonder if it is possible to be psychologically one gender but *socially* the other, if that makes sense.  The way a man treats a male friend is very different than a woman treats a woman, a woman treats a man, or a man treats a woman.  There is a specific kind of friendship and interaction I have only ever observed between men, and it saddens me that it is unlikely I will ever fully experience that type of bond.\n\nBesides this lack of sex drive and such, I am not much of a people person.  I have my one good friend, and that was all I needed, but I’m losing him through no intention of either of us.  I have made a few work friends, even having gone to parties with some and out to a restaurant for drinks with another, but find it hard to be with people.\n\n---\n\nWe were originally “pen-pals” (keyboard pals).  I was in university and heavily struggling.  It turns out I had some wild anemia that should have left me completely incapable (but somehow didn’t quite) and some fucky hormones that were making it hard to function, but I didn’t get those answers when I needed them.  I felt very overwhelmed and alone, ended up on a penpal-finding site, and he messaged me.  At first, I was annoyed by his comment that he, too, knew how it felt, to feel like one was getting left behind in a world that was moving on too fast, but kept that thought to myself and kept the conversation going.  Turns out, he really did know, better than I.\n\nWe became great friends.  We could tell each other anything.  I learned he was ill, lost most his friends because of it (when he couldn’t party, the partiers left; when he couldn’t work, those relationships dissolved; when he couldn’t play cricket, his teammates were no longer teammates).  He left home at 17 to escape an abusive alcoholic father, worked so hard on his education, got his degree, and I imagine life was finally becoming okay.  He only got to work a few years at the career he fought for before he became ill, and eventually couldn’t physically perform regardless of how hard he pushed.  He and I found each other and became pen-pals a few years later, at which point he was mobile within his home and usually managed to get outside a little bit once every few days.\n\nHe was (is?) fun and upbeat, charismatic, witty.  I was surprised to eventually learn that he had gone through some sexual and emotional abuse/trauma that left him with body dysmorphia, feeling worthless and unlovable, on-and-off suicidal with several botched attempts.  Even before this came out, we were very close, and it made me more comfortable with being open about my own struggles with the idea of sex.  Our problems here were very different, but somehow also very much the same.\n\nYears of phone calls and photos and daily text-chats went by.  He’d often express his regret that I wasn’t from somewhere closer (“shame you’re not local”); we’d talk about how nice it would be if I could just pop in for a cup of tea and a visit, sometimes.  We’d discussed the possibility of me coming to meet him, someday.  Perhaps that amount of long-distance communication is odd and unhealthy.  What do you think?  Can someone really be friends with a person they’ve never met?  Were we too co-dependent?  \n\nAnyway… a couple years went by, and I ended up going traveling through a few countries that were close together.  At the last country, I ended up on his doorstep.  He didn’t know I was coming, and I had found a few accommodations (hostels and campgrounds) nearby that I’d intended to check out and check into one of once I arrived.  I thought he’d probably chat with me on his doorstep, and if things went well I would come back and spend more time with him other days.  To my surprise, this beautiful, generous, vulnerable human who had no idea I was coming *trusted* me, opened up his little home to me, and made it clear that I was welcome to anything in it.  Though he is just renting one room in the house, I ended up there at a point where 3 others had just left and a fourth was in the process of moving out and no longer lived there, so we had privacy and the run of the house.\n\nWe watched movies together and played a board game he ordered.  We sat around and drank tea and listened to music and chatted and were our odd selves.  I had recently joined a cricket team in my home country, and he helped me practice his sport a bit outside.  He wanted to make sure I explored and did some touristy things, and would find me maps and send me off on adventures he couldn’t follow on.  As I walked out the door, he’d be grabbing me my the backpack to stuff in snacks and juice and the like.  He told me what foods I should try and where to get them, and once when I got home from a hike, I found he had made me a big pot of pasta.  I know that took a good bit of effort with his limited energy.  I felt so cared about.  I loved so well, and was so well-loved.  But, of course, I had to go back to my own country.  Those were a happy 10 days that I’ve been chasing ever since.\n\nWe continued chatting via text and phone call, sharing photos and videos.  A few months later, we planned for me to return the next summer.  We thought I might get a YM Visa down the road, so I could live and work out there for a couple years, but I’m getting older and trying to start a career, and am only eligible for that visa until I am 30, and I can’t see this being a possibility in the next few years, so I guess that’s that, then.  Yet another thing the pandemic ripped from me.\n\n After I left that first time, I kept becoming even fonder of him.  I loved him; I knew that for a long time.  He felt like a cool older brother, sort of, and I loved him that way.  But also I was discovering it was a versatile kind of love.  I *could* love him like a sibling.  I could love him as if he were my son, and I were ferociously maternally protective.  I could love him as a friend.  I felt a sort of attraction I’d never felt, before, too.  I could love him romantically, if I so chose.  So I did, and once I spilled my guts out to him, he eventually came around to the idea as well.  I didn’t push him; he just grew into the idea on his own.  We we became even closer, in this strange new way.  Eventually, I felt willing –– excited, even –– to try to explore some physical intimacy and sexuality with him.\n\nThe pandemic started getting attention a couple weeks before my flight would have left, and he urged me to cancel my ticket and try again when it was sorted out and safer in a few weeks.  Boy, if we knew then what we know now…\n\nIt’s been 4 years since I’ve seen him.  He’s gotten gradually sicker the whole time, which was somewhat expected.  Most days he’s not really well enough to chat back-and-forth, but will still text me to let me know he’s okay.  On lucid/focused/better (never “good”) days we chat and I see his old self peek out from time to time.  He is vaccinated, but caught COVID a while back, which also did not help things. I thought that post-covid would be a good time to slip in a visit, during the window which he had the antibodies from fighting off the infection and would be protected by both the vaccine and natural immunity.  He said he was too sick to visit (I think he’s self-conscious about his situation; things must be unravelling over there) and too scared, and I watched that little window where I could visit without putting him in danger slowly close.\n\nI know I won’t see him again, now.  I’ve tried to come to terms with that for the last few years, but keep finding myself picking up scraps of hope.  I wish I could move on.  I’ve tried.  I have a hard time finding people I can make connections with, and he was one of the precious few.  I don’t know if I’ll ever experience a romantic connection again.  I don’t know if I’ll ever feel ready to explore intimacy again.  I don’t want to die a virgin, but I can’t bring myself to even consider touching anyone else, yet.  Maybe the right person will come along, and be patient enough to stand by me for years as a friend, until I feel safe and secure and emotionally connected/intimate enough to try.\n\nI just can’t stop thinking of all those little pockets of happiness we’ve had, and all the happiness I never got the chance to have.  I imagined getting home from work and crawling into bed behind him, or making dinner while he kept me company.  I thought about the movies and music I wanted to share with him, all the cups of tea I wanted to drink with him.  I think about wanting to wake up to that bright face and its absurdly mobile eyebrows (he emotes with these in the most adorable, exaggerated way, lol), that beautifully rough voice and its prickly accent.  I never met his mum, but we sort-of interacted, and we somewhat communicated through him.  Early on, when we were just starting to get close as keyboard-pals, I guess he told his mum and sister about me.  They asked about me a few times over the year, and supposedly expressed fondness.  I’ve asked about them some, too, and get the impression that I would get along with his little family very well.  As creepy as I’m sure this is, I looked forward to meeting them, and am sad I will not.  I always thought I’d bring his Mum a little pot of zinnias to first meet her, and we’d probably end up drinking tea and talking about bits and bobs and…\n\nanyway, I’m rambling.  It’s just a weird thing.  I always knew this relationship was a long shot and could never actually last, but I wanted to steal a few more happy moments in this life, and thought I could help supply some better moments to him, too, and it’s hard watching that opportunity become an impossibility and not knowing whether I will ever feel such a connection again, or if I even want to feel such a connection with someone else.  I know this whole thing has been absolutely absurd from the beginning, but kind of wonderful, too.\n\n---\n\nWas this relationship always unhealthy?  Was it weird?  How do I get over it?  How do I move on?\n\nAny idea what's up with my sexuality?  What can I do about that?  I don't want my broken sexuality.  I want to be able to explore.\n\nWhat about my thought of being \"socially male\"?  Any idea what that might be?  Is there a term for it?",
            "Q_score": 42,
            "Id": "11lrkeh",
            "Url": "https://www.reddit.com/r/Advice/comments/11lrkeh/confused_about_my_sexuality_and_in_the_process_of/",
            "Aswer": "1. This sounds like a good relation where two people with similar, but not exactly the same issues support each other. Without toxicity. That is rare. \n\n2. Regarding your sexuality, maybe lurk on the r/asexual and r/asexuality sub.  You may be demisexual or graysexual. Or asexual. \n\n3. This can happen if you want a relationship where you are not wanted for your body or for sex. This may stem from number 2. \n\nI hope you two can keep on supporting each other. It seems that you have a special friendship.",
            "A_score": 15
        }
    ]
}