{
    "Posts": [
        {
            "Question": "A delusional teenager I work with is telling people we're dating\nAlright! So I don't know what to do about any of this. I (20F) am a server at a local restaurant. I have a decent amount of underage coworkers that I'm always nice to because I remember what it was like to be a teenager around adults who hated me. However, this one busser (16M) has gotten some sort of delusion in his head that we're dating, and I'm worried it's going to ruin my life.\n\nI've heard from coworkers who are my age AND who are his age and go to school with him that he's been saying we've had sex, I've performed sexual acts on him, and that my long-term partner who I talk frequently about at work is a cover story. Apparently he's said these things both at work (less of the lewd rumors) and at school CONSTANTLY.\n\nI've spoken to him about this, I've spoken to my managers (unfortunately they can't schedule me around him, against corporate rules.) Every single time someone mentions these rumours I vehemently disspell them, but it's all just getting worse and I'm afraid he's going to absolutely ruin my life.\n\nUnfortunately quitting isn't an option as this is the only place I can work with my school schedule, and I've gone as far as threatening legal action. I'm at a loss as to what to do to make these rumours stop besides finding a way to contact his parents and begging them to get him help. What do I do?! I'm constantly on the verge of a panic attack...",
            "Q_score": 41,
            "Id": "11tqyw2",
            "Url": "https://www.reddit.com/r/Advice/comments/11tqyw2/a_delusional_teenager_i_work_with_is_telling/",
            "Aswer": "Go above the managers to thier managers or HR. And let them know it's sexual harassment.",
            "A_score": 68
        },
        {
            "Question": "Nobody likes me\nI don't understand. I'm sociable. I'm decently attractive. I have stories to tell. I've had friends before when I was in my early 20s, but I had a falling out with many of them, and the overall number of friends I had were minimal at best. I'm now in my late 20s and left with but a single friend with no idea how to find more. I'm not invited to parties anymore as I was in my teens/early 20s since my peers now have families and careers. Also, I'd feel awkward going to a party thrown by early 20s. \n\nI feel that it might be my attitude that is off-putting to people. I don't know why, I always try to uplift everyone around me, and im kind and respectful. Though it's true that I can be rather sassy often. I suppose the main inhibito of my attitude is my depression, which actually dampens my mood and, therefore, my attitude considerably. My life sucks. That's just how I feel. I don't really go out there displaying this attitude to everyone, but I guess maybe people feel the energy when they're around me?",
            "Q_score": 61,
            "Id": "11tmwxo",
            "Url": "https://www.reddit.com/r/Advice/comments/11tmwxo/nobody_likes_me/",
            "Aswer": "Hey! i feel like losing friends is a part of growing up, it’s totally fine. instead of focusing on the people that you’re losing touch with, i think you should find a new hobby, start treating yourself as a friend and go out for walks, start enjoying your own company. I used to feel like you too, i decided to focus on myself and now i don’t feel the need to socialise, i talk to whoever talks to me, and i am content with myself. I hope your depression gets better !",
            "A_score": 48
        },
        {
            "Question": "Do I tell my sister she messed up my life from a car accident when we were teenagers?\nShe was 16. I was 14. She was driving, I was thrown from the vehicle.  We are now both in our late 40s.  I have had chronic pain, chronic migraines, infertility, and mental health issues mostly starting after that accident.  \nMy sister and I do not have a good relationship.  My sister is not a nice person and has kept her kids away from me because of family drama.  This has broken my heart.  Due to this I also have very bad relationships with my parents, they side with her.  They think I’m the problem and she’s the saint.   After a series of MRIs recently, I have learned all these health issues I’ve had most of my life are probably happened to me because of that car accident.  If I don’t tell her how can I stop myself from internally blaming her more?",
            "Q_score": 47,
            "Id": "11to9u9",
            "Url": "https://www.reddit.com/r/Advice/comments/11to9u9/do_i_tell_my_sister_she_messed_up_my_life_from_a/",
            "Aswer": "Was this intentional or an accident?\n\nIf this was an accident this is your issue and you need to deal with it as well as you possibly can, because heaping blame on someone because of an accident will not help you and will not make you feel better and will not change the person who was resonsible and will not add anything good or kind into this world or your relationship.\n\nI am sorry that you suffer from something that happened regardless of your choices. Life is not fair. This is your task and your life, so heal  yourself and increase the comfort of your life and your happiness by raising yourself up, not bringing other people down.\n\n10 years ago my two brothers were in a car accident, the driver is completely fine while my other brother is completely paralysed and in vegetative state since then. I could deal with my grief by hating my other brother for taking the person I love away from me. But it was not his intention and he is aware of what he has done even if he doesnt talk about it, will bear consequences forever, and I have no need to make him feel even worse by my hate.\n\nEven if I tell him I am angry at him it will change nothing, I still lost my brother and still need to deal with my own grief.",
            "A_score": 69
        },
        {
            "Question": "How do I make my gf orgasm ?\n\nSoo i and my girl are in early 20s . I am not able to make her orgasm , even after fingering her for like 15 min straight she does get to that point .\nPlease help me , how do i make her orgasm . Even with penetration she is not getting it , although she used to get them in previous relationships",
            "Q_score": 39,
            "Id": "11tikli",
            "Url": "https://www.reddit.com/r/Advice/comments/11tikli/how_do_i_make_my_gf_orgasm/",
            "Aswer": "Are you aware of the clitoris?",
            "A_score": 181
        },
        {
            "Question": "Food randomly disappearing from my house, need advice.\nI've been experiencing a strange problem lately and I'm hoping to get some advice on how to deal with it. For the past few weeks, I've noticed that food in my house has been disappearing without any explanation. At first, I thought I was just forgetful and had eaten it myself, but I've started keeping track and now I'm sure that something else is going on.\n\nThe food that's been disappearing is usually things like snacks, fruits, and other small items that can be easily grabbed and eaten. It's never anything substantial like a full meal, but it's enough to be noticeable. I live alone, so it's not like anyone else is eating it without my knowledge and there aren't any extra wrappers or peels in any of my trash cans or bags.\n\nI've checked my apartment for any signs of a break-in, but everything seems to be in order. I've also considering asking my neighbours if they've noticed anything suspicious, but I haven't yet\n\nI'm starting to feel paranoid and I'm not sure what to do. Has anyone else experienced something like this?\n\nQuick Edits: Don't want to divulge much information about myself, but I'm 20, I'm Brazilian, the apartment is owned by parents while I study in my university and they will sell it back once I'm done. Nobody has any keys and my parents added a tetra key lock (I believe that's the name) when they bought the place.\n\n\n Currently taking the following advice:\n*Taking pictures of the kitchen and other areas to compare while I'm away from home.\n*I'm going to talk to the janitor today, hopefully she'll be of help.\n*Slept with my leg tied up to the bed frame and I believe that's enough proof that I'm not sleepwalking, but I can't be sure.\n*Windows are now closed. Just leaving my bedroom's window open so I can get some air and I can keep an eye on it constantly.",
            "Q_score": 122,
            "Id": "11t80xw",
            "Url": "https://www.reddit.com/r/Advice/comments/11t80xw/food_randomly_disappearing_from_my_house_need/",
            "Aswer": "If items in the fridge or other locked areas are disappearing then I think it's you (sleepwalking etc). Regardless get a motion camera.\n\nIf it's things left out it could be rats/mice, get a camera and/or traps.",
            "A_score": 140
        },
        {
            "Question": "I’m having doubts on if my daughter is biologically mine and don’t know if I should take a paternity test and risk my marriage..\nI’m new to Reddit but I’m currently in a tough place and need an outside perspective. \n\nMe and my wife of 3 years have a baby girl she’s 2. They’re my world and honestly I’ve been beating myself up even having these thoughts but recently I’ve doubted if she’s really my biological daughter. We have similarities but there are certain things that have me second guessing. My wife and I both have green eyes I’m mixed and she’s Italian and American. My baby has brown eyes I know it’s a possible for two green eyed parents to have a brown eyed baby but I’ve read it’s rare. \n\nA few years back I had to travel for work and I had my suspicions of my wife cheating but the thought alone brought me to tears. I discussed it with her and she assured me she was loyal to me. She has cheated in her previous relationship but I didn’t want to judge based on that because she was in high school and we’ve all done dumb shit we regret as kids. \n\nI have discussed my concerns with her and to say I caused an argument would be an understatement. She got extremely upset and asked me how I could insinuate that she would ever cheat on me or that my baby isn’t mine. I’ve spoken to her in the past ab my doubts and she told me she would never cheat. I brought it up again and said I had my doubts but I’ll drop it and apologized. She got very defensive and started crying saying “I guess you want a paternity test since you don’t believe me”. I said no but after speaking with my family about it I think I may want one just to clear my mind. If she’s mine I’ll hate myself for ever being doubtful but if she’s not I still haven’t thought about the consequences that can bring. She is my daughter and I love her no matter what but what will that do to my marriage. \n\nThis has caused me so much internal conflict and I’ve spent nights crying thinking I could be making the biggest mistake of my life. If anyone has any advice or has been in a similar situation from mine or my wife’s perspective it would be greatly appreciated.",
            "Q_score": 108,
            "Id": "11t7w2x",
            "Url": "https://www.reddit.com/r/Advice/comments/11t7w2x/im_having_doubts_on_if_my_daughter_is/",
            "Aswer": "I'd get the test because you'd wonder forever if you don't. Besides, it could also turn out not to be your wife's either.",
            "A_score": 167
        },
        {
            "Question": "(20M) Feeling Trapped, Need Advice\nI’ll try be brief:\n\nI’ve been with my SO for 2.5 years. We have both lived at my parents’ house for the past 18 months. My parents love her to bits.\n\nWe nearly broke up about a month ago, because I said I wasn’t sure about my future. She was distraught as were my parents, who were very angry at me. \n\nMe and my parents had discussions about what was going on, but it just felt like they were convincing me to get back with her the whole time, instead of listening to my reasons to end the relationship. The longer our mini-separation continued, the angrier my parents got at me.\n\nWe got back together after about a week apart.\n\nI feel like I was pressured into it. I love her but am not really sexually attracted anymore. I’m only 20 and don’t feel that I want to commit multiple years or longer to this relationship.\n\nI feel like I can’t act though. Breaking up is hard enough, the guilt of hurting her for example. And then on top of that, being berated by my parents?\n\nI can either:\n\n- Put up with it and satisfy everyone’s wishes\n\nOr:\n\n- End it and get the abuse\n\nWhat would you do?",
            "Q_score": 40,
            "Id": "11tca83",
            "Url": "https://www.reddit.com/r/Advice/comments/11tca83/20m_feeling_trapped_need_advice/",
            "Aswer": "Absolutely end it if that’s what you want. I understand and am sorry for any social fallout that you may receive, but rest assured that if those people treat you like that, they are not people you want or should have in your life. Be honest with both your SO and your parents, and even if it is hard momentarily it will save you potentially years of emotional misery in the future. Good luck.",
            "A_score": 42
        },
        {
            "Question": "How do I tell my coworker to stop bothering me every single time I'm on my break trying to eat?\nTitle. I have extreme anxiety being seen eating and I always pick a time slot for my break that nobody else claims. Everyone respects this and leaves me alone in the break room except for one coworker who, nearly every time without fail, comes in when I am approximately 2-3 minutes into my meal and lingers talking about random things. I immediately lose my ability to eat the moment he walks in and by the time he leaves my break is over and I have to return to work starving. I am starting to get really upset by this but I have no idea how to bring it up or ask for his understanding and cooperation without coming across as a weird mentally fragile idiot. I thought he would eventually notice I stop eating whenever he visits and get the hint but he hasn't. I feel so stupid about this but it's really starting to effect me. I don't want to hurt his feelings but I need to be able to eat to get through the day. What do I say? How do I approach? Should I just start eating lunch in my car?",
            "Q_score": 256,
            "Id": "11suawi",
            "Url": "https://www.reddit.com/r/Advice/comments/11suawi/how_do_i_tell_my_coworker_to_stop_bothering_me/",
            "Aswer": "I think you’d have the right to say “hey man, I only have a few minutes for my break and I prefer to enjoy it it silence so I can recharge. I’ll talk to you after!”\n\nBut I don’t think you have the right to boot someone out of what I assume is a *shared* break room. Everyone’s got a right to be in there, if they work there. If you need total solitude, I would find somewhere else to eat.\n\nI’d also recommend seeking professional help to move through this anxiety.",
            "A_score": 348
        },
        {
            "Question": "Are we in danger?\nMy girlfriend's alcoholic, incel, antisemitic brother who owns a gun has threatened to kill her the next time she goes to Miami. Should there be a concern? She needs to go to Miami for her business and needs to talk to her parents, who her brother lives with. What should we do?",
            "Q_score": 57,
            "Id": "11t23cr",
            "Url": "https://www.reddit.com/r/Advice/comments/11t23cr/are_we_in_danger/",
            "Aswer": "Yes. Contact her parents and contact the police. And stay as far away from him as you can.\n\nYou and your gf can probably better evaluate how likely he is to follow up on his threats.",
            "A_score": 116
        },
        {
            "Question": "ASKING ADVICE: I want to play a metal song at my wedding\nMy Dad took his life before he could see me marry anyone. My Dad's last favorite song was a metal song, and it has some screaming in it, but not the whole song. And I would like to add that the \"screaming\" isn't \"messy\"- you can understand what the words are, but it's still screaming (Skyline, by Erra).\n\nI wanted to do a tribute to my dad by playing this song, but I'm having my wedding in a church, so I am conflicted about it. Not only that reason, but also because it's going to be a small wedding, and most attendees are older women who are very vocal about not liking that type of music.\n\nShould I play the song for my Dad, or should I choose another song for him? My runner up would be \"Brighter Side of Grey\", by FFDP- (still \"hard rock\", but softer, no screaming, and I love the message)\n\n&#x200B;\n\nEditing to include- I am 22F, American, and my family is Christian (Don't worry- I'm not the type that forces it on people lol, but some of the women are the more strict/old testament types..)- the bot said I should include this info",
            "Q_score": 29,
            "Id": "11t4c75",
            "Url": "https://www.reddit.com/r/Advice/comments/11t4c75/asking_advice_i_want_to_play_a_metal_song_at_my/",
            "Aswer": "https://www.youtube.com/watch?v=nksQDNR8AjE\n\nJust as an idea - if you think the screaming is too much - you can do an instrumental version.\n\nOr you can find a \"softer\" part of the song that has meaning and find someone who can work that portion with words into a portion with the instrumental. \n\nI think what you want to do is a beautiful idea and I think you should go with the song that honors your dad, honors a moment you didn't get to have with him ... it's your wedding, it's your tribute, he's your dad ... \n\nYou use his song!\n\nETA: Even with the screaming - the little old ladies can hang onto their pearls for a few minutes so you can have a lifetime memory.",
            "A_score": 45
        },
        {
            "Question": "Wife wants to circumcise son, but I don't want to.\nHello, I need advice on this situation, my wife is pregnant and is due in 1 week, ever since the news that it was a boy she has been adamant about circumcising the baby, the thing is I do not want my son to not have a choice of whether he wants to be cut or not, when he is at the age of consent I will allow him to make the decision, but not now. I tried showing her information about how harmful the procedure is but she won't agree or even listen to the information because she just won't believe it, I tried to talk but she refuses to talk about it because \"pregnancy mood swings.\"",
            "Q_score": 508,
            "Id": "11sj47l",
            "Url": "https://www.reddit.com/r/Advice/comments/11sj47l/wife_wants_to_circumcise_son_but_i_dont_want_to/",
            "Aswer": "If it’s a matter of “hygiene,” that shit has been debunked. It’s not difficult to clean underneath the foreskin at all.",
            "A_score": 887
        },
        {
            "Question": "I can't be bothered to make food, but I don't feel hungry quick enough, so I go full days without eating.\nAnd then I get even more depressed/sad/suicidal. Every time I forget that it's just that I need to eat, because I live in a haze of emptyness every day, because I don't eat.\n\nI really want to break this cycle, but I don't know how. Does anybody know some tricks that might help me get better at this?",
            "Q_score": 34,
            "Id": "11svs1x",
            "Url": "https://www.reddit.com/r/Advice/comments/11svs1x/i_cant_be_bothered_to_make_food_but_i_dont_feel/",
            "Aswer": "From my experience, not eating makes the anxiety/depression/suicide worse. And it's hard to find the energy to actually cook. Especially with my chronic pain. \n\nWhen I lived on my own, I took advantage of The Tray. The Tray is a tray of ready to eat foods that take no time to prepare. Buy a large flat surface you can carry food on. Put food on it. Carrot sticks, cheese sticks, crackers, lunchables, literally whatever you want. So long as it takes next to no preparation. Keep it in the fridge, fully loaded. Vaguely hungry? Pull it out, eat some, put it back. Is it out? Refill it. Maybe you go to the store or maybe you order grocery pickup or delivery. The Tray works for all.",
            "A_score": 21
        },
        {
            "Question": "My wife is lying to other people saying I put my hands on her\nMy wife (28f) and I (35m) got into a big argument recently. There was a lot of yelling at each other. Eventually I got so frustrated that I grabbed my car keys and took off for no more than 10-15 minutes to calm down. I came back home and while things weren’t exactly back to normal, kept to ourselves in seperate rooms for a few hours, calmed ourselves down and then talked it out.\nA few days later, I get a message from one her co-workers threatening me saying if I ever put my hands on her again, he was going to beat the crap out of me. I didn’t say anything to my wife as I didn’t want to get into argument so I ignored and deleted the message. Later that night while my wife was sleeping, I grabbed her phone and checked her messages (I know, not cool but I didn’t know what else to do) where she said what happened but added in a new part where I grabbed her and pinned her up against the wall before I took off. She also said she’s scared that eventually I’m going to snap and hit her in a fit of rage. We’ve had a few arguments but I have never once laid a finger on her during our entire time together.\nHow would be the best way to approach this with her without getting into a massive fight about it? And how could I protect myself in the future from false allegations in case of divorce or any other legal matters?",
            "Q_score": 443,
            "Id": "11s6t1h",
            "Url": "https://www.reddit.com/r/Advice/comments/11s6t1h/my_wife_is_lying_to_other_people_saying_i_put_my/",
            "Aswer": "You cannot be in a house alone with someone who will flippantly accuse you of physically abusing her. \n\nIf you insist on staying, find a set of mutual friends to mediate while you calmly ask her why she told this man you put hands on her. You don't even have to mention having gone through her phone, he messaged you directly and that says enough. \n\nPersonally, though, I'd just get out. You are playing with fire by not immediately recognizing the threat you're dealing with.",
            "A_score": 369
        },
        {
            "Question": "I'm being given custody of my sister and i don't know what to do\nI'm (19 m) and my sister (17 F) lived with our parents untjl recently they got arrested for possession with intent to sell narcotics. And after that CPS came and got my sister and she was with them for a few days, and than eariler today the social workers showed up at me and my roomates house saying that I've been given Legal guardianship over my sister due to our parents being incarcerated and that she's going to live with me. i don't know what to do. I don't want to take care of her especially since she was the favored child growing up and all the attention was on her and besides i have better things to do than be worried about her. What should i do?",
            "Q_score": 236,
            "Id": "11sb9pa",
            "Url": "https://www.reddit.com/r/Advice/comments/11sb9pa/im_being_given_custody_of_my_sister_and_i_dont/",
            "Aswer": "1.   Can you make it work for a year until she turns 18?\n2.   Any other close family or close friends who she could stay with?   \n3.   If you really can’t do it, then tell CPS that you can’t, and they will place her in foster care.",
            "A_score": 266
        },
        {
            "Question": "Am I over reacting to my boyfriends mom inviting him to sleep at her place while I stay with our crying 6 month old?\nMother in law offered for husband to stay over, why do I feel annoyed by this? Our 6 month old isn’t sleeping much and my husband works 12 hour shifts but we live in a small apartment so he doesn’t get much sleep. So his mother offered for him to come stay some nights. Am I over reacting or should I let him go get sleep at his moms while I stay with the baby in our apartment?",
            "Q_score": 36,
            "Id": "11smfx9",
            "Url": "https://www.reddit.com/r/Advice/comments/11smfx9/am_i_over_reacting_to_my_boyfriends_mom_inviting/",
            "Aswer": "Whenever I hear one adult proposing to \"let\" or \"not let\" another adult do something, I conclude that the partnership is breaking down.\n\nI have the kind of job where I can fall asleep at my desk for a while and nobody cares. Assuming that you as a couple need your boyfriend's income to pay rent, the answer probably depends on what will happen at his job if he falls asleep at work.",
            "A_score": 64
        },
        {
            "Question": "I want to be a musician but people are pretty discouraging\nI want to be a professional musician, I play 3 instruments and I sing. I love music and it feels like what I was made to do. I believe I can make it with hard work. But people tell me I won't make it and I should just give up on my lifelong dream. Should I listen to them or should I follow my dreams? Any advise?",
            "Q_score": 220,
            "Id": "11s1r6g",
            "Url": "https://www.reddit.com/r/Advice/comments/11s1r6g/i_want_to_be_a_musician_but_people_are_pretty/",
            "Aswer": "If it's the music that you love, keep in mind there are numerous additional roles you can play in the industry - marketing, manufacturing, production, sound & lighting, sales, etc.\n\nIf it's the artistic side, being a writer, producer, engineer, studio wiz, etc.",
            "A_score": 209
        },
        {
            "Question": "I just found out my boyfriend is the brother of the girl who falsely accused me of sexual assaults.\nWhen I (17)was in high school a girl (16)in class accused me of sexual assaults and, that I got her pregnant. I was arrested and I was almost sent to jail. Even when I was forced to come out of the closet to my super religious family who disowned me in a heartbeat and, it was revealed that I had both testicles removed due to cancer at 14 it wasn't until the girl admitted to lying about the whole thing even the pregnancy all because, her best friend dared her too, that the case was dropped, but the damaged was done. School had expelled me, my family disowned me, I thrown me out of the house, I lost my part-time job. I did sue her but, I didn't get much. I did get enough so I was able to move to another state. I was in a really bad place mentally for years over what happened to me, and I'm still not over it.\n\nI met my boyfriend at work. He was very low contact with his parents, only texting happy birthday/merry Christmas. I knew he had a sister but he was no contact with her at all. I did ask but, it was obviously a touchy subject so I never prodded to deep on the subject but I just assumed it was like similar to my family situation. Last night I finally feet comfortable about talking about what happened to me. It wasn't hard to put two and two and, he realised that it was his sister and what his sister did to me is why he's low-no contact with his family. He was away at university, when this happened. I don't know what to do I've already started to fall for him, god dam it. Idon't want that bitch to ruin another thing for me but, is this to weird?",
            "Q_score": 94,
            "Id": "11rvoni",
            "Url": "https://www.reddit.com/r/Advice/comments/11rvoni/i_just_found_out_my_boyfriend_is_the_brother_of/",
            "Aswer": "Wow! He cut them off for what they did to you before he even knew you. If that’s not support, I don’t know what is. \n\nHe can’t help who he is blood related to. He’s NC with them on purpose, and like 100x more fervently now. \n\nBlood means nothing. You guys are gonna do just fine.",
            "A_score": 241
        },
        {
            "Question": "How can I stop masturbating for 10-12 hours a day?\nHow can I stop masturbating for 10-12 hours a day? Yes, this is a serious question and not a troll even though it may sound like one. I know, it's weird. I've been addicted to masturbation, edging, and porn since I was 12 years old, and my addiction has never been worse than it is right now.\n\nTo break it all down for you, I typically edge to porn for around 10-12 hours a day, sleep for 4-6 hours a night, and then spend the remaining 6-8 hours of my day getting my priorities done (going to class, studying, and doing my homework). I'm still doing well in all of my college courses, and I enjoy learning and feeling successful by getting stellar grades. So at least that hasn't changed for me. \n\nBut besides that, I just masturbate for 10-12 hours a day and sleep for a little bit. I can't even remember the last time that I slept for more than seven hours in a single night. It's probably been around two months now. I wish that I could stop, but I don't really have a reason to at the same time. I don't have a girlfriend to make love with or anything. \n\nSo, how can I stop? At the end of the day, I do realize that this is really unhealthy and that I need to get rid of this addiction.",
            "Q_score": 634,
            "Id": "11rj1j7",
            "Url": "https://www.reddit.com/r/Advice/comments/11rj1j7/how_can_i_stop_masturbating_for_1012_hours_a_day/",
            "Aswer": "This is above Reddit's pay grade, right into professional help territory.",
            "A_score": 2473
        },
        {
            "Question": "My toxic family thinks that I am the problem\nAnd by family, I mean my sister and mother.\n\nHi, I, (32F) think I’ve reached a limit in believing my family will ever be anything close to healthy/functional.\n\nAs a child, I always perceived my eldest sister who is almost 20 years older, as abusive. At 7 years old she told me that our mother got pregnant with me as an accident so I was a mistake. At 12 years old, she stopped talking to me despite us living in the same home. So until I was 18 (when I had a chance to move out for school) my home life with her was a living hell. \n\nShe would throw out my dinner at times, leave me stranded out of the house for hours when I had forgotten my house keys, tell me I was worthless, humiliate me in front of my friends, mock me, call me obscene profanities, hide my things. She would judge every single action I would take and use it against me. She would reject and hate on me every single day. \nThe abuse got so bad that I spent every evening when I came home from school locked in my room just to avoid the abuse. \n\nMy parents knew she was mistreating me, and did nothing to stop it. If anything, they told me to just stay quiet, to avoid triggering her and to just ignore the abuse. I would ask them to do something about it but they just ignored my cries for help. \n\nEventually, after years of abuse I developed social anxiety and depression, and self esteem issues, all of which I’m working to heal even to this day.\n\nFast forward to today. \nI live with my mother (71F) at the moment, and guess who came to visit last week for a week? My eldest sister.\n\nIt was hell again. She told me I was worthless again and started body-shaming me. Despite me standing up for myself, my mother kept telling me I should just stay quiet and not trigger her. \n\nSo when my sister left, I confronted my mother for continuing to enable these abusive dynamics, but she laughed it off saying I was being sensitive and that I should just move on.\nThat she didn’t do anything about the abuse when I was younger because she was too busy working to feed\nand clothe us. That I should just be grateful because she loves me and had sacrificed so much for me.\n\nI don’t think my sister will ever change as she is almost 50, and my mother doesn’t take accountability for her role in enabling my sister’s abuse. But it makes me so angry when she tells me that I am ungrateful daughter who should be more loving. \n\nMoving forward, what would be the best approach in dealing with my mother and sister? Would you consider their behaviour as toxic and abusive? Any thoughts or comments would be appreciated thank you",
            "Q_score": 24,
            "Id": "11s4vxc",
            "Url": "https://www.reddit.com/r/Advice/comments/11s4vxc/my_toxic_family_thinks_that_i_am_the_problem/",
            "Aswer": "Why don't you get your own place. I feel like you have sacrificed your life for people who don't care about you.",
            "A_score": 22
        },
        {
            "Question": "am I (19) silly for giving money away to the homeless?\n\nI (19) have moved to a city with a big homeless population and walk by homeless people everyday on the way to school, mall, whatever. i always feel super bad and today i gave 20 dollar bills to 2 people separately, 40 dollars each because i just felt bad for them. one women was on the street looking sad and disheveled and she said god bless u which made me happy as someone kinda religious. the other guy had a sign saying he was in a fire and he looked it so i gave him a twenty after debating with myself (i was gonna give a five but felt bad and figured i didn’t need it). i know this seems like i’m bad with money maybe? i’m worried but i figured i would just spend that on weed so i was better off doing this. i don’t know if this is reckless spending but my parents gave me spending money and i’m worried they would disprove ig. also i heard “reckless spending” is a result of mental illness and i’m not sure if this qualifies?",
            "Q_score": 275,
            "Id": "11rlbzw",
            "Url": "https://www.reddit.com/r/Advice/comments/11rlbzw/am_i_19_silly_for_giving_money_away_to_the/",
            "Aswer": "Here's my point of view, as someone who was on the streets for 7 years. I was always grateful regardless if it was 50 cents or 100 bucks that someone would kick down to me. So I'm sure they are grateful and really do appreciate you helping them out. 20 bucks doesn't seem like a lot, but when you're on the streets you can make it go far. Sure I'd buy alcohol, and I was mostly honest about it, (Yo, can you spare some change for alcohol and I promise you I won't buy food) was my line, but most the time I'd buy food lol. \n\nSo they'll more than likely will be getting their fix or maybe they'll get food, but now when I give back, after the money leaves my hand to theirs it's really none of my business what they spend it on. I normally say \"Get whatever you need\" when I give people money. \n\nI personally don't think it's foolish, but at the end of the day you need to be sure you can take care of yourself. Sorry if this makes no sense, was a long day.",
            "A_score": 355
        },
        {
            "Question": "What are some walkable cities in the US?\nHi all. \n\nMy father recently had a botched eye surgery that was supposed to leave him with 20/20 vision, but instead has left him blind in one eye. This now makes it where he cannot drive anymore. \n\nMost of America (including where he lives) is built around people using cars to get around. I worry that him not being able to drive will completely strip him of his independence and leave him feeling depressed. \n\nI really want to be there for him and I want to sit my family down and suggest that they move to a city that is more walkable. Some place where he can go do the grocery shopping, go see a movie, really just do basic little things without having to ask someone to help him get there. \n\nI currently live in NYC so that was my first option, however my mother has ASD and the city is incredibly overstimulating for her. I’m wondering if there are any other cities/ towns people know of that are walkable/ more accessible to people who can’t drive. Preferably something on the East Coast so I can still see them",
            "Q_score": 28,
            "Id": "11rz806",
            "Url": "https://www.reddit.com/r/Advice/comments/11rz806/what_are_some_walkable_cities_in_the_us/",
            "Aswer": "Chicago is highly walkable, and some parts could even be considered ASD-friendly.\n\nEdit look at university towns. Cities like Champaign-Urbana have mass-transit systems above and beyond what you’d expect at cities of comparable size.\n\nAlso, Midwest is totally flat, so it’s a great place for leisurely walkability.",
            "A_score": 38
        },
        {
            "Question": "My boyfriend wont block the girl he cheated on me with…\nI am a 29F that is dating a 37M (lets call him Bob). We had been together for about 9 months before i found out that he had been cheating on me with a 20F, lets call her Karen, for the last two months. I broke it off after finding out. Within a week she moved into his place (her parents kicked her out). It has been 3 months and he told me he regrets it and he chose the wrong girl. He asked me what it would take for us to get back together. I said to stop sleeping with karen and have her move out would be a start. She moves out within two days. He says karen is moving to a different branch of the franchise they work for so he also wont have to see here there, but they are in a soccer league together that meets once a week for the next 5 weeks. I asked him to block karen and go no contact with her. He says no because they are still friends and he doesn’t plan on seeing her romantically (also that he doesn’t want to be told what to do and i should trust him). \n\nAITA for wanting him to not talk to her? How can the trust be rebuilt? I’m not sure if i should move forward with getting back together. I really love him but i don’t know how to get over this, and him still talking to her makes me uncomfortable, especially knowing Karen still wants to be with him, even if he dosent want to be with her.",
            "Q_score": 105,
            "Id": "11rlqo4",
            "Url": "https://www.reddit.com/r/Advice/comments/11rlqo4/my_boyfriend_wont_block_the_girl_he_cheated_on_me/",
            "Aswer": "Dude... why even get back together with him. Have a little self respect",
            "A_score": 1014
        },
        {
            "Question": "I Think My Husband Could Be Plotting To Kill Me\nTL;DR Discovered my husband has for a while been telling people I'm suicidal, and am generally mentally unstable. It's occured to me this could be part of an attempt to make it look like I commited suicide if I were to die suddenly. Am I being paranoid?\n\nI (26f) Have recently found reason to suggest my husband (29M) could be plotting to kill me and make it look like a suicide.\n\nYes, I realise how out there that sound, let me explain-\n\nMy reason for thinking is is because I discovered he has been secretly telling people we know, for a while, that I am apparently suicidal, along with other things to make me seem mentally unstable, as far as lying about having to call the police because I was a missing person. Recently the thought came to my mind, that this could be a way of making my death appear like a suicide, if he were to kill me, and I wanna share those thoughts to see what others think \n\nIt started after he one night told me not to go into the local store he works at, as he left early and had apparently used me as an excuse. Then not long after he happened to leave his messages open, and I noticed a conversation with his coworker about me, so curiosity got the better and I took a snoop. Turns out the excuse he'd used about me, was claiming that I'd gone missing and he needed to go look for me, adding the detail that I'm 'on suicide watch' even saying that he called the police. \n   \nOn another occasion, he said we can no longer go to his shop on Thursdays (It's the local store so we shop there regularly) because he'd told them he needed that day off as he takes me to therapy that day (This isn't true, we've never been to therapy)  \n\nMore recently we had similar incident, where he told me I couldn't go in the his shop as he'd used me as an excuse again. I Took another snoop and found he'd told them he needed to stay home with me due to my mental health. When he finally went back he told them that my brother is able to be with me now so he feels safe leaving me at home (I Haven't spoken to my brother in months)\n\nTo be clear, I have no history of mental health issues, never had to go to therapy, never been a missing person, nor has anyone ever had to call the police for me\n\nThis all also reminded me of a time a while ago, where he mentioned in casual conversation how he could get away with killing me, because no one would notice me missing. He explained how I don't talk to my friends or family regularly so they wouldn't realise I was gone, and he could just call my work and tell them I quit. This did creep me out at the time, but I brushed it off as a weird joke\n\nFor background, my husband is diagnosed with autism,  ADHD, and narcissistic personality disorder, he also has always had compulsive lying and anger issue. (I've Know of that since even before this) He also has a history of mistreating me, in a way some might call abusive. A lot of emotional abuse such as putting me down, both privately and in front of other,  being demanding and controling. He's never actually struck me physically, but has used threats of violence to get what he wants before\n\nAlthough all this concerns me, I also feel kinda silly for being concerned. Maybe I'm just paranoid, maybe I actually am as crazy as he's making me out to be? An outside perspective would be helpful.\n\nShould I do anything, or just ignore it and stop snooping?\n\nEDIT: Apologies for the way I've been replying to comments so far, I realise I've been acting kinda stubborn and it isn't helpful. I'm Gonna pause reading the comments for a bit so I can come back with a more clear head. Please do continue commenting if you have anything though as I will read them]",
            "Q_score": 1266,
            "Id": "11r6x69",
            "Url": "https://www.reddit.com/r/Advice/comments/11r6x69/i_think_my_husband_could_be_plotting_to_kill_me/",
            "Aswer": "Always go with your gut. When he goes to work grab images of emails and texts and make copies of any critical papers. Then go to the police and get a restraining order. Do you have someplace you can go where you’ll be safe?",
            "A_score": 1315
        }
    ]
}