{
    "Posts": [
        {
            "Question": "How can I tell my mother about my grades without her beating me?\nMy mom is abusive. All forms of abuse except for sexual abuse. My spring report came and I don’t know how to tell her without her beating me. \n\nSo here are my grades:\nArt: B\nSport: C\nICT: D\nGerman ( yes i am a German student): C\nEnglish: D\nFrench: C\nMath: C\nEthic: C\nMusic: A\nHuman sciences: C\nScience: C\n\nHow can i tell her about it without her beating me? I really need advice.",
            "Q_score": 148,
            "Id": "12ag8o8",
            "Url": "https://www.reddit.com/r/Advice/comments/12ag8o8/how_can_i_tell_my_mother_about_my_grades_without/",
            "Aswer": "I would walk up to one of your teachers and straight up tell them that you're scared of your mother beating you because of your grades",
            "A_score": 472
        },
        {
            "Question": "Should I buy this place for $29,900 so I can live on my own?\nI’m a 26 year guy. I currently live with my parents in the rural Midwest. I want to start living on my own.\n\nThere’s an old church for sale in a small town near me. The town has literally about 10 houses, no businesses, and this old closed church. This church is for sale for $29,900.\n\nIt closed as a church in 2018 and somebody had been living in it. Most houses in my area are around $80,000 or higher. I know this is cheap compared to other areas, but I can’t afford that.\n\nI can afford $29,900. This church was built before 1900. It is in a little rough shape but not terrible. Should I buy it?",
            "Q_score": 483,
            "Id": "129zm6p",
            "Url": "https://www.reddit.com/r/Advice/comments/129zm6p/should_i_buy_this_place_for_29900_so_i_can_live/",
            "Aswer": "Well, buddy, that's a tough decision to make. Living on your own can be an amazing experience, but it can also be a difficult one. Are you handy? Can you fix things up yourself? If not, do you have the money to hire people to help fix up the church?  \nIt sounds like a unique opportunity to own a piece of history, but it could also turn into a money pit if you're not careful. Think about your long-term goals and how this purchase fits into that plan. Good luck!",
            "A_score": 656
        },
        {
            "Question": "I want o break up with my partner because he’s trans.\nIt sounds horrible even typing it, but let me explain. I (M16) have been dating my partner (FTM16) for a little over half a year. He was my girlfriend up until about two weeks ago, when he came out to me as a transgender\nmale.\n\nNow for as long as I've been living, I've been a straight man. There are times when I've questioned it, but it's always ended up with me liking girls. So when he came out, I was proud of him, but also confused as to what that would entail with our relationship. I decided I would give myself the day to think about it and I came to the conclusion that it would be disrespectful for me to be with him because I believe he deserves someone who wants to date a boy, and I don't.\n\nI’m thinking about waiting a couple days before talking with him, as he just came out and I really don’t want to take this step in life away from him. But I’m terrified of how he’ll react and be labeled transphobic. What do I do?",
            "Q_score": 1314,
            "Id": "129m3rh",
            "Url": "https://www.reddit.com/r/Advice/comments/129m3rh/i_want_o_break_up_with_my_partner_because_hes/",
            "Aswer": "Yeah, you're not gay. There's nothing transphobic about having a sexual orientation. Your soon to be ex will need to understand that just as they couldn't continue living as a female you aren't into dudes. It's not a choice.",
            "A_score": 1673
        },
        {
            "Question": "I have a small penis and that's fucking my life.\nWell I never thought I would do this but wtv, why not? \nSo since I was 13 I notice that my \"thing\" wasn't growing, I told  myself that it was alright and with time it would grow. Now I'm 16 and it's the same, I have never had a real relationship with a girl, the last time I kissed a girl was 2 years ago and I don't think I'll have a relationship or anything like that for long, I consider myself as a normal guy, I wouldn't say that I'm the prettiest of all but I do think I'm pretty.\nThis is fucking with me because I just feel like I can't even try to have \"something\" with a girl because I couldn't give her the pleasure she would like ( it's really weird writing about this, I apologize). So I feel like I'm stuck in life and I don't see an happy ending to all this. ( Btw, I created this account to talk about this)\nAny suggestions or just a comment about my \" situation\" ? I would appreciate it.",
            "Q_score": 130,
            "Id": "12a68kn",
            "Url": "https://www.reddit.com/r/Advice/comments/12a68kn/i_have_a_small_penis_and_thats_fucking_my_life/",
            "Aswer": "With these kinds of post I feel like everyone focuses way too much on the “you can do other things to please a woman” aspect. Which is true, but doesn’t really help imo. You most likely have a completely average sized penis unless you have a medically diagnosed micro-penis. Most women can’t even handle a huge penis without pain. Your perfectly average sized penis is more than enough to please a woman. Stop watching porn and stop comparing your dick to other dicks.",
            "A_score": 460
        },
        {
            "Question": "What do I tell my dad to make him stop coming into my room?\n\nMy (M16) dad (M47) always opens my door and comes in my room to fix my blankets or just to look at me and leave when im sleep. Its the reason I wear pajamas or a shirt and boxers when I sleep. But its starting to get really warm and I want to start wearing a bit less but I dont want my dad to see me.\n\nI dont have a lock on my door and if I put something infront of it to stop it from opening, he would probally panic. I dont know how to bring this up with him. What do I do?",
            "Q_score": 41,
            "Id": "12a6o82",
            "Url": "https://www.reddit.com/r/Advice/comments/12a6o82/what_do_i_tell_my_dad_to_make_him_stop_coming/",
            "Aswer": "“Dad, I am getting older.  I would like a bit of privacy in my room please.   I would appreciate it if, in the future, you could please knock on the door before coming in.   I might be changing clothes. I might just want some privacy.   I am not four years old anymore.   At my age bit of privacy is normal.    Will you please agree to knock before entering my room?”",
            "A_score": 124
        },
        {
            "Question": "My boyfriend just died. Someone please tell me it's going to be okay.\nI cross posted this from another subreddit cause honestly I'm numb and freaking out.\n\nSo Im in the hospital after having a surgery to place a stent in my kidneys and when I called my boyfriend to see where he was today, I found out he died last night. I'm devastated. I'm freaking out. I can't leave the hospital till Tuesday and I don't know what to do. I'm just lost now.\n\nWe were on and off for a while but had been in a really good spot lately. I was just with him yesterday and the day before when he brought me to have my surgery.\n\nHis father told me they think it might have been drugs and I'm at a loss because now I feel like he had a secret life going on that I didn't know about. He lived with his father so he could take care of him and his father said when he went into his room, they found bottles and something called Delta K gummies and some sort of sleep aid. He also said there were all these weird messages on his phone. I knew he had had alcohol problems and done drugs in the past but he swore to me he past it and not doing it. His last message to me last night was fine. I'm screaming on the inside because now I feel like I missed something and could have done something.\n\nThere had been problems before and I probably should have broken up with him before because of some stuff but I don't know. I feel like I was dependent on him and now it's over. I depended on him. Even though now I wonder how much he was hiding from me, I'm still just devastated. I'll miss him so much.\n\nI don't have a good support system. I'm not super close with my parents and they didn't even really know I was seeing anyone. My sister and I don't get along well. I don't have a lot of friends and I live alone. He was basically my whole social life. I don't know what I'm supposed to do. I don't know what I'm going to do. Someone please tell me things are going to be okay.",
            "Q_score": 64,
            "Id": "129xujc",
            "Url": "https://www.reddit.com/r/Advice/comments/129xujc/my_boyfriend_just_died_someone_please_tell_me_its/",
            "Aswer": "Tell the nurses you need the hospital psychologist RIGHT NOW",
            "A_score": 76
        },
        {
            "Question": "Thinking of starting and OF to leave my financial abusive relationship\nI’m (f20) my bf dean is (m31) we have been together for just over two years. I’m in a kinda abusive relationship and I need money asappp. I need to make this money without him knowing. Would starting an onlyfans be the best way to do it ?",
            "Q_score": 255,
            "Id": "129g0vd",
            "Url": "https://www.reddit.com/r/Advice/comments/129g0vd/thinking_of_starting_and_of_to_leave_my_financial/",
            "Aswer": "After viewing your other post...\n\n\nhis mum is not your responsibility.  He is not your responsibility.  You need to get out. You are actually in modern slavery. Get to a shelter and explain the situation.",
            "A_score": 447
        },
        {
            "Question": "I just left my mother at the psychiatric department in a hospital\nI never felt so horrible before. She has medical problems and is not right in the head (believes she is possessed by a ghost) ~ so she didn’t see the potential dangers. I had to bait her in and escort her to the closed psychiatric department of a hospital. When leaving i heard her scream my name loudly. I can’t stop crying and idk how to get over the feeling that i betrayed her. They probably will bomb her down with meds and idk if i made the right decision at all. Advice on how to sleep tonight/feel better",
            "Q_score": 29,
            "Id": "129xbd1",
            "Url": "https://www.reddit.com/r/Advice/comments/129xbd1/i_just_left_my_mother_at_the_psychiatric/",
            "Aswer": "Former psychiatric inpatient here.\n\nYou got your mother the medical help she desperately needs. That is always the right thing to do.\n\nBeing locked up sucks… I know. The more she cooperates, the sooner she will come home.\n\nDoes this hospital allow visitation? I’m sure she more she sees a familiar face, the less anguish she will feel.",
            "A_score": 32
        },
        {
            "Question": "Boyfriend(24M) looks at other girls on ig and tiktok but when i(21F) post similar content he gets mad\na little bit of context, me and my boyfriend have been together for about 2 years now and have never had any issues with him looking at other females for sexual gratification or anything of that sort. however, i’ve been seeing that he’s been looking at videos of women in bikini’s, naked, and all that sort. the more i saw this the more insecure i got, and i know this might be bad but over the last few months i took it upon myself to prove a point and i started posting provocative picture’s of myself on ig (bikini’s, super mini dresses, etc.) just to see how he would react. \n\nHe started noticing that i’ve been doing it more often and would even get furious at me, screaming about how i was trying to get attention from other men and i was a whore. i would always talk back saying how it was okay for him to look at other women doing the same thing but i couldn’t do it?\n\nHe’s been giving me the silent treatment ever since. What do i do?",
            "Q_score": 42,
            "Id": "129njc0",
            "Url": "https://www.reddit.com/r/Advice/comments/129njc0/boyfriend24m_looks_at_other_girls_on_ig_and/",
            "Aswer": "So basically, he doesn't want you to get the attention that he giving to other women? What you do really does depend on how important hypocrisy is to you and whether or not you're okay with him having a say in what content you post.",
            "A_score": 60
        },
        {
            "Question": "Humiliated, what to do? (NSFW)\nI was at a party and after we all went to crash, I got a bed with a few other people, including my crush. Somehow I couldn't believe my luck but she was right next to me.\n\nNow this is where things get bad, there were 2 other people and they kept complaining about space and pushing us over, so we ended up basically spooning (me facing here).\n\nShe was wearing a skirt and is really hot, so the feeling of her against me got me hard so quickly. I am 100% sure she felt it and I was completely unable to stop it, or back away.\n\nI barely slept at all that night as that's all I could think about and to make things worse she would move a lot in her sleep, which basically rubbed against me and set me off again.\n\nShe didn't speak to me much in the morning and I know I have blown my chances now, anything I can do to fix things or get over the embarrassment?",
            "Q_score": 64,
            "Id": "129ibxl",
            "Url": "https://www.reddit.com/r/Advice/comments/129ibxl/humiliated_what_to_do_nsfw/",
            "Aswer": "Just be chill about it, maybe don’t even mention the boner. Be like “Hey just wanted to check in with you after last night because the bed was pretty tight so I hope you didn’t feel uncomfortable”",
            "A_score": 190
        },
        {
            "Question": "How to make yourself cry\nIn the past few months I've been going through a lot of things. Painful relationships, leaving my home country, dealing with stressful situations and loneliness. One thing I haven't been able to is cry about any of it. It always feels like it's just building up in my chest and I'm never able to release it. I've tried watching sad videos, listening to sad music, watching sad movies but it never goes past the point of a choking feeling. How do I make myself cry and finally experience some release?",
            "Q_score": 32,
            "Id": "129iple",
            "Url": "https://www.reddit.com/r/Advice/comments/129iple/how_to_make_yourself_cry/",
            "Aswer": "Sometimes, a cry isn't the release you hope it will be, and you will discover that release in a different way. That cry may come, and it may help, but it may feel a bit anti-climactic and pointless as well.  \n\nTrying to force, or somehow conform to a way of releasing those emotions that isn't suited to you will only hinder that tidbit of self discovery.  \n\nI speak of this purely from my own experience, so for me to tell you that \"rage cleaning\" the house, among other things, has helped me, is really of no use to you. We are all individuals, and so long as that release, when it comes, is channeled in a positive manner, you'll be okay.",
            "A_score": 24
        },
        {
            "Question": "I just got abandoned\nI'm seventeen and my mother told me not to come back, said I was on my own, and blocked me. I'm over eighty miles away with my father while she gets the house she bought fixed up. She is a narcissist, she never taught me anything about growing up or being my own person because you can control someone the more they depend on you. I'm clueless, I can only stay at my dad's for a week, and I don't know what to do, any advice? I'm terrified and scared.",
            "Q_score": 207,
            "Id": "1295m16",
            "Url": "https://www.reddit.com/r/Advice/comments/1295m16/i_just_got_abandoned/",
            "Aswer": "One of them legally has to provide you with shelter. What is your dad going to do, throw you out on the street?  Let them both know that if you have nowhere to go, you will have no choice but to call the police.",
            "A_score": 230
        },
        {
            "Question": "Pap Smear Fear\nI just turned 21 recently and had a doctor's appointment a few days after where I'd get my first pap smear. I've been dreading it since I found out I had to get one. I actively missed my appointment on purpose because I couldn't handle it; I don't want some guy that I hardly know up in my shit with a cold metal thing scraping my vagina. \n\nI already had a hard enough time coming around to even touching myself down there. I googled what if I never got one and they said I'd be at a higher risk of cancer but I honestly might just take my chances... I DONT want this and I DONT care if it's \"normal\".\n\nEDIT: I suffered childhood sexual abuse that was never addressed until I got older. Probably makes this worse.",
            "Q_score": 50,
            "Id": "129br3o",
            "Url": "https://www.reddit.com/r/Advice/comments/129br3o/pap_smear_fear/",
            "Aswer": "You do NOT have to go alone. Take your mom. Sister. Boyfriend. Best friend. Someone you trust to hold your hand. \n\nYou also don’t have to see a man if you can find a woman who takes your insurance. You might feel more comfortable with a female gynecologist. \n\nTell them your afraid, it’s your first time, you have past trauma that makes this feel even worse than a first time typically would be. Your doctor should try to make sure you feel as safe as they can. If they blow you off or make you feel unsafe you don’t have to stay.",
            "A_score": 44
        },
        {
            "Question": "I have a second date later today on April fools. What harmless, good natured prank could I play?\nI don't know them well enough to play most pranks but I feel like since it's April fools I should play some silly little prank on them. Nothing anxiety inducing, just some little fun thing. Any ideas?",
            "Q_score": 410,
            "Id": "128tfag",
            "Url": "https://www.reddit.com/r/Advice/comments/128tfag/i_have_a_second_date_later_today_on_april_fools/",
            "Aswer": "Bring some leeks, carrots, and other vegetables banded together like a bouquet.",
            "A_score": 957
        },
        {
            "Question": "I am way too skinny and I want to gain some weight..\nI am 18M and I am skinny as heck. I have little to no appetite but i want to gain weight cuz i am getting anxiety and many body image  issues.. I wanna know where do i start from and i tried seeking professional help for any eating disorder but that was of no help..\n\n\n\nEdit: I really cannot thank everyone who replied enough. I read everything i will try to improve on my appetite and myself. It really helped me alot...Thank you..",
            "Q_score": 29,
            "Id": "129aqa6",
            "Url": "https://www.reddit.com/r/Advice/comments/129aqa6/i_am_way_too_skinny_and_i_want_to_gain_some_weight/",
            "Aswer": "Do you have an eating disorder or do you just struggle to gain weight? You should start with your regular medical doctor.",
            "A_score": 9
        },
        {
            "Question": "(REPLIES NEEDED ASAP) How do I deal with feeling upset and embarrassed because of my boyfriends sister\nHi I 20 (f) am dating my bf who is 21 (m). I’m going to keep this quick because I really want replies. This just happened while I was having dinner with his family. I’ve been with him for two years now, so I am pretty comfortable and familiar with his sister (16). During dinner, she randomly looked at me and asked how does it feel not washing my hair. For context, I am black and if you do not know some blacks people do not wash their hair everytime they shower. This isn’t unhygienic, some hair just doesn’t retain as much moisture and doesn’t need to be washed. I wasn’t upset that she asked this and told her I felt fine. She then followed up by saying well you should wash it. I didn’t want to go into a whole spill on why black people don’t wash their hair so I just kept the conversation going. The conversation then turned into poking fun at me over something else. I just felt embarrassed and hurt, and I don’t know what to do now. I don’t really want this to become a huge deal but I do feel some type of way. What should I do?",
            "Q_score": 38,
            "Id": "1298kjc",
            "Url": "https://www.reddit.com/r/Advice/comments/1298kjc/replies_needed_asap_how_do_i_deal_with_feeling/",
            "Aswer": "Your feeling are completely valid. His sister was out of line big time, but I’m a little more concerned that no one else stood up for you.\n\nWhy didn’t your boyfriend or his family call her out? \n\nYou can’t control what nasty things people will say about you/ to you, but you can control who you spend time around. You can set boundaries and choose to not interact with her, but I’d also consider having a conversation about this with your boyfriend.",
            "A_score": 57
        },
        {
            "Question": "My girlfriend is a dry texter\nSo my girlfriend is a dry texter, she mainly replys with \"fair enough\" or \"that's nice\" not even kidding I could send her a paragraph of what I did today and she would reply with \"that's nice\" and I would be left there not knowing how to respond. But irl she's great we can talk and have a fun time but it's just a conversation while texting which sucks what do I do?",
            "Q_score": 567,
            "Id": "128jg14",
            "Url": "https://www.reddit.com/r/Advice/comments/128jg14/my_girlfriend_is_a_dry_texter/",
            "Aswer": "She doesn't like texting. Don't try to make her do it. Save it for when you see her. Small fun texts here and there. That's it. \n\n\\--signed, a dude who hates text conversations.",
            "A_score": 1477
        },
        {
            "Question": "Would you let $65 slide to save a friendship of 16 years?\nMy best friend of 16 years called me in Jan (3 months) ago and asked to borrow $1200 because she doesn't have enough money to pay for the dying cat's vet bills. I let her borrowed it because I don't want the cat to suffer as well.\n\nThis morning she venmo me $1200 and said it's also \"part of the phone bill\" HOWEVER, the phone bill is $65 because we share the same plan. That means she still owes me $65.\n\nIt took me forever to get the $1200 back and she seem annoyed each time I asked for it. I do see her going on dates and paying for the girls she's dating.\n\nAm I being petty?",
            "Q_score": 115,
            "Id": "128w4ao",
            "Url": "https://www.reddit.com/r/Advice/comments/128w4ao/would_you_let_65_slide_to_save_a_friendship_of_16/",
            "Aswer": "It doesn't have to be the end of a friendship. There's other things to consider. Is she always coming up short with money situations? Don't lend her money. It was a $65 lesson. If you are tight on money and $65 is a big deal then ask her for it in a week. If she doesn't pay it take her off the shared plan and let the whole thing go.",
            "A_score": 196
        },
        {
            "Question": "How can I talk to my cute neighbor?\nOkay so I have been living next to this guy for like a year and a half now. We both work a ton and see each other occasionally. When we do we always exchange a “hello” but I am a very shy person and I can tell he is too. When we see each other, we say “Hi, How are you” then we both say good and that’s the end of the conversation….ughh! I have a feeling that he wants to say more and I of course do too but what do I even say after that? I’m so bad at starting a random conversation/friendship. Any suggestions welcomed!",
            "Q_score": 29,
            "Id": "1295mq1",
            "Url": "https://www.reddit.com/r/Advice/comments/1295mq1/how_can_i_talk_to_my_cute_neighbor/",
            "Aswer": "I find “compliment then question” is a good combo to start a conversation.\n\nExamples: “I love your shoes, where did you get them?” “Your car is a neat color, did you pick it on purpose?” “I love your garden gnome, does he have a name?” \n\nEveryone likes a compliment, and then the question opens the door for a bit more in depth conversation that can maybe lead to: “Let’s go shoe/car/gnome shopping together some time! Let me get your #” I’ve also just straight asked neighbors for their digits in case of emergency, even tho happily married. Good luck!",
            "A_score": 22
        },
        {
            "Question": "My neighbours keep having loud sex, what do I do?\nThere’s a couple that live next door to me, I’ve talked to them a few times and the guy seems like an extremely shy person so I only smile as a greeting now.\n\nThe thing is though, every night I can hear him (and a few times her) practically screaming (and not the bad kind) and It’s REALLY messing with my sleep. I’m an athlete and have to train at 4-5am, 2-3 hours before going to uni, training again, then working. \n\nI really don’t want to embarrass him but don’t know how to approach the situation.  Does anyone know what I could do? They only seem to be home at night too, and that’s when I’m trying to sleep or I’m trying to study.\n\n**Update**: Okay so I may have not used the most useful technique but my friend was over and I showed him this post, a couple hours later when they started he *yelled* “yes mommy” without warning and they stopped immediately. Pin drop silence.\n\nThanks for the replies though, I’ll use the more rational approach if it happens again 🤣",
            "Q_score": 458,
            "Id": "128hclu",
            "Url": "https://www.reddit.com/r/Advice/comments/128hclu/my_neighbours_keep_having_loud_sex_what_do_i_do/",
            "Aswer": "Get an audio clip of loud applause, and play it on full blast every time they finish.",
            "A_score": 465
        },
        {
            "Question": "my boyfriend of over 1 year cheated on me. i broke up with him. please tell me something encouraging i am so hurt and cant stop crying\n",
            "Q_score": 44,
            "Id": "128z9h1",
            "Url": "https://www.reddit.com/r/Advice/comments/128z9h1/my_boyfriend_of_over_1_year_cheated_on_me_i_broke/",
            "Aswer": "Don't treat the breakup as some kind of problem. If you broke up, then you are not made for each other. Now you are free and can find a person who will spend his whole life with you. And if he cheated on you, then he is definitely not worthy of you! People who cheat are disgusting. Well, now you have more time for your hobbies :\")",
            "A_score": 60
        },
        {
            "Question": "What do I say whenever someone calls me ugly for no reason.\n",
            "Q_score": 386,
            "Id": "128aqw5",
            "Url": "https://www.reddit.com/r/Advice/comments/128aqw5/what_do_i_say_whenever_someone_calls_me_ugly_for/",
            "Aswer": "\"I hope that is the only thing we have in common\"",
            "A_score": 839
        },
        {
            "Question": "What to do with a gf that doesn’t know what she wants to do\nBasically, we wake up, we both want to do something. I name lots of different activities we could do and she can’t name 1 thing. What do I do?",
            "Q_score": 58,
            "Id": "128j3sc",
            "Url": "https://www.reddit.com/r/Advice/comments/128j3sc/what_to_do_with_a_gf_that_doesnt_know_what_she/",
            "Aswer": "She may be a person with a weak sense of self. She knows she wants to do stuff and have fun but doesn't know herself well enough to understand what excites her. People often talk about depression in relation to a lack of interest in activities and this is the part exactly that I believe causes it. \n\nIf this sounds like her she needs to work on being present during activities and not in her head. Activities are never fun if you're in your head worrying over how you appear or contemplating what you'll do for the rest of your day. I made this mistake my entire life. The only thing that I could do to be present during an activity was play video games or read. I never considered why I liked those things I was just grateful I did like them and found relief when doing them. Now I understand it's because I gave them my undivided attention. Since focusing on that and putting forth the effort in other activities my interests have become endless.",
            "A_score": 96
        },
        {
            "Question": "My classmate wants me to give up my bed for her\n I (16F) am going on a 3 day trip with my school. I was lucky enough to get a room with my two best friends. However a group of 4girls at my school weren't able to get a room to themselves, 3of them were roomed together and the 1 that was left got put in a different room. She however doesn't want to sleep in the room that she was assigned. \n My room will have a twin bed and a king bed. The girl suggested that me and my 2 friends squeeze in the king bed while she gets the other one for herself. I find it unfair and my friends agree because the girl doesn't want to sleep with her twin sister and friend, in a room that has the exact same layout and space while she expects us to do so. \n  I originally said yes to her sleeping in our room on the condition that she slept on the couch (provided there is one) but she said that she paid for the trip and it's not fair to sleep on the couch while she paid for a bed. I've already thought about what to say to her but I'm afraid she is going to insist and end up ruining our trip. \nIs there anything i should say to her to shut her up immediately?????\n\nTLDR: My classmate wants me and my 2 friends to sleep in the same bed, while she gets one to herself and refuses to share with her twin sister and best friend.",
            "Q_score": 35,
            "Id": "128lyld",
            "Url": "https://www.reddit.com/r/Advice/comments/128lyld/my_classmate_wants_me_to_give_up_my_bed_for_her/",
            "Aswer": "You can all just tell her no. If she’s going to pout about it, let her pout.",
            "A_score": 101
        },
        {
            "Question": "My boyfriend’s studying, how can I help him?\nIs there a care package I can curate for him? \n\nPlease help. \n\nI don’t think I can help him with the study part. \n\nDon’t give me sexual bs. Genuinely need help.\n\nEdit: I tried. Just got him an energy drink, packet of marshmallows and one fruit candy pack. I couldn’t find anything. I don’t live with him either. Thanks guys.",
            "Q_score": 36,
            "Id": "128k13x",
            "Url": "https://www.reddit.com/r/Advice/comments/128k13x/my_boyfriends_studying_how_can_i_help_him/",
            "Aswer": "* Snacks and drinks he likes\n\n* Study materials like flashcards and pens\n\n* Comfort items like a cozy blanket or scented candle\n\n* Motivational items like a framed quote or note of encouragement\n\n* Self-care items like a face mask or stress ball",
            "A_score": 46
        }
    ]
}