{
    "Posts": [
        {
            "Question": "My boss is always mentioning how short I am\nMy boss is a very tall woman. I am a very petite woman. She has a habit of constantly mentioning my height. \n\nMost recently at a very large meeting she referred to me as “she may be short and small but she has an important role”. \n\nI am just really sick of this and don’t how to bring this up to her. I am a middle aged professional woman who doesn’t need to constantly be belittled because of my height and stature.\n\nThis situation is really getting me down. How do I deal with it?",
            "Q_score": 312,
            "Id": "126mkfj",
            "Url": "https://www.reddit.com/r/Advice/comments/126mkfj/my_boss_is_always_mentioning_how_short_i_am/",
            "Aswer": "pop your head in her office and be like 'i'd just like to say 'please don't bring up my height with others again. k, thanks, bye!' lol",
            "A_score": 399
        },
        {
            "Question": "Coworker MIA. Should I be concerned?\nMy coworker who’s been working at our company since last summer suddenly stopped showing up to work.  She got along get with everyone in our department and was very friendly and outgoing.  She liked her job and didn’t seem to have any issues that we know of.  No one including our managers have been able to get a hold of her.  Her Facebook status will be active for a little bit but our messages go unread.  I don’t want to invade her privacy but I am concerned because this is unlike her.  What should I do?",
            "Q_score": 79,
            "Id": "126n1zc",
            "Url": "https://www.reddit.com/r/Advice/comments/126n1zc/coworker_mia_should_i_be_concerned/",
            "Aswer": "HR should have an emergency contact to try calling. Otherwise asking local police to do a wellness check is appropriate.",
            "A_score": 173
        },
        {
            "Question": "My husband hides my toys!! HELP!\nLet me start by saying this man has an ego problem when it comes to our sex life. He is very inconsistent with everything, down to our finances. The first time, i was looking for my toy in my drawer, and it disappeared for over 3 months. I played along with it and then called him out on it when it reappeared. \n\nMost recently we moved and I put all the contents from the drawer into my bag. I've been looking for this bag for about 2 months  and I finally found the bag and my toys are missing. \n\nI'm so sick of his subtle controlling ways. He looks for ways to take away things I enjoy that intimidate him  but does nothing to actually fix our issues. I can't speak to anyone about this because it's so embarrassing. Should I try to have a real conversation about this?\n\nUPDATE!!!: I spoke to him about it, he didn't say anything at first then he started gaslighting me. Answering questions with questions then denied taking it. He did finally admit to hiding my last toy, stating, \"because he didn't want his step-son to get to it\" which is odd because he denied it for months! These rose toys are expensive, I'm mad I have to buy a new one. FYI - we did therapy in the past. After one session, he said the therapist should focus on her problems first. Would this be grounds for divorce for you?",
            "Q_score": 877,
            "Id": "1263yki",
            "Url": "https://www.reddit.com/r/Advice/comments/1263yki/my_husband_hides_my_toys_help/",
            "Aswer": "This is not embarrassing for you, it’s embarrassing for him. The fact he is going behind your back and hiding your toys rather than actually speaking to you shows he is a spoilt man child. It is absolutely controlling behaviour OP and a huge red flag. Your husband is putting his ego and pride above your body and pleasure in the most unhealthy way. If he’s jealous of a material item and chooses to deal with it by physically hiding it from you, what will be next? This isn’t about the toys it’s about control.",
            "A_score": 869
        },
        {
            "Question": "My parents want me (18) to go to jail for my sister (25)\nI don’t know if the title is exactly accurate but it’s closest to what’s happening. And please don’t think I’m being over dramatic I’m only sharing this incident because it’s not too bad and can paint a picture. \n\nHi I’m Jordan (18). Long story short I’m the only “civilian” (what my family calls me) in a family of people that have been in the street life at some point or another. I’m confused on what to do and how to compromise. \n\nMy sister (25) recently got into a fight with this girl and when I was holding her accountable for her actions I was berated and told “you don’t do that to family. It doesn’t matter what happened, you should have her side no matter what”. I was told I was wrong when removing myself from the situation incase a witness was needed, but then told not to tell 100% of the truth if it makes my sister look bad. \n\nI won’t say exactly but through multiple situations my mom has shown me that she has no problem throwing me under the bus if it saves my sister. Which has me totally confused because I’m being told that family should support each other but I’m supposed to take the fall for my sister. I’m supposed to lie for my sister. I’m supposed to put myself in jeopardy to go to jail so that my sister can walk free. But why doesn’t my family try to keep me out of that situation? Why would my family feel comfortable putting me in jail when I’ve never did anything to have any run in with the police? I’m told that I have a bad view of family and I should do better. My only concern is doing what’s right. \n\nI’ve been told by my parents that they’re happy that I never got put into that kind of life but then I’m almost belittled and berated for not being able to understand it. I’m asked for my opinion but then yelled at and told “you’ve never gone through it so you could never understand“. I don’t have the funds to move out because I’m saving to start school. Do they not like me or something? What can I do?",
            "Q_score": 64,
            "Id": "126l7xr",
            "Url": "https://www.reddit.com/r/Advice/comments/126l7xr/my_parents_want_me_18_to_go_to_jail_for_my_sister/",
            "Aswer": "Seems to me you're a good apple in a bad bunch.\n\nThey see you as a mark, a fall person for their more favored offspring, your sister.\n\nRun, do not lie for her, go to the police and tell them they are trying to tamper with witnesses if there is an open case already. As that is a crime, and just find a way to make your own way in life.",
            "A_score": 116
        },
        {
            "Question": "I walked in on my son doing it😬\nI am a mom of 3 boys. 17, 14, and 11. Tonight I got off early and came home and loud music was blaring from my 17 year olds room. I knocked twice, got no answer so I came in. He had a girl in there and saw them doing the deed. I started screaming and so did they and I ran out. I didn’t think I’d ever have to experience this, or at least not any time soon. I’m so embarrassed and don’t even know what to say to him.  I’m kind of just hiding in my room at this point. I’ve already given him talks about safe sex, and the importance of contraceptive. I just feel more awkward then here. What do I even do? Advice?",
            "Q_score": 465,
            "Id": "12676w6",
            "Url": "https://www.reddit.com/r/Advice/comments/12676w6/i_walked_in_on_my_son_doing_it/",
            "Aswer": "I’d just make sure he’s being safe and then pretend it never happened. I’m sure he’s embarrassed too.",
            "A_score": 739
        },
        {
            "Question": "Bedroom rules for my son with a trans friend?\nI have a 15 year old son. When girls are over we have an open door policy, and absolutely no sleepovers. But my son has this new friend he wants to bring around. He’s trans, female to male. I know he is male, and I am not trying to be transphobic in anyway, but should the rule still apply? He still has working reproductive female parts. I’m very lost at this, there is no handbook on this. Advice please??",
            "Q_score": 162,
            "Id": "12685m7",
            "Url": "https://www.reddit.com/r/Advice/comments/12685m7/bedroom_rules_for_my_son_with_a_trans_friend/",
            "Aswer": "if you think your son is sexually active, you need to have that conversation with him and talk about protection. my parents had this rule, i still found a way to do it and it caused some problems before we had that conversation",
            "A_score": 395
        },
        {
            "Question": "My mom (40) opened a credit card in my name name (18) and I did not know until recently, she doesn’t want to close the account or give me the card. She did this worth the excuse that it will help me, but Ik that’s it’s cuz she has bad credit and the bank won’t approve her for a home loan. Help\n",
            "Q_score": 1123,
            "Id": "125jmdx",
            "Url": "https://www.reddit.com/r/Advice/comments/125jmdx/my_mom_40_opened_a_credit_card_in_my_name_name_18/",
            "Aswer": "She is committing identity theft, which is a felony.  You are completely within your rights to tell her that if she does not close the account forthwith, you will be filing a police report.\n\nDon't let her destroy you financially before you even have a chance to get started in life.",
            "A_score": 1735
        },
        {
            "Question": "I was falsely accused of SA and it’s ruining me\nI’m 20 years old in college and a 30 yr old woman has tried to ruin my life, and it’s worked to an extent. I met this woman through work, I thought she was nice, and she was at first. We talked often and became friends, she wanted it to evolve into something more and became infatuated with me and wanted sex, It wasn’t reciprocated at alI. She showed up to my 2nd job (A grocery store) twice. I never told her where I worked. I was minding my own business working when she first showed up, I was walking to the front of the store to do some stuff and was shocked to see her, she lives 30 mins away from where I work so I didn’t know why she was here at my store. She saw me see her and walked up to me and said “Hey! How are you? I’m just on my break” and i’m thinking… why are you on your break here?? It was very awkward and I told her I was busy and needed to go so I left. The 2nd time she showed up, I had just clocked out and was getting ready to leave the store when I suddenly ran into her on my way out. She was “shopping” and was trying to strike up conversation. The first time was already weird af and I was beyond creeped out at this point. I told her I was busy again and needed to be on my way. One day when I wasn’t working, I checked my snap map to see if she was there, she was. \n\nWhenever I’d take a while to respond to her texts she would post on her snap story and make it private so that only I would see it and title the story “Jason pls pls pls read” (jason isn’t my real name but you get the idea). She showed up to my house one time with gifts I didn’t ask for, it was some merch from my favorite shows and some cheep wish.com clothes. She’d post pictures of me to her instagram and would caption it cringey shit like “#mr.sideprofile” I never asked her to do that, she just did. Overtime her texts to me became increasingly explicit. The final straw was when she asked me to “fuck her savagely” after that I said she was really creepy and blocked her on everything. I could’ve done that ages ago before it got extreme and I should have but that doesn’t make what she did okay. \n\nAfter I blocked her she tried emailing me multiple times through different accounts and started texting my friends and was playing the victim saying “he blocked me and i don’t know why🥺” my friends told me and asked me who this was and i explained everything to them, after which they told her to fuck off. For a couple days that was it, not much happened with her. \n\nOne the first day of the semester at a new school I transferred to, I get a call from campus police, saying I need to talk with them. I meet up in an office with some office worker and a cop. They told me about some comments that were made on the school’s instagram. They showed me a printout of it. It was a bunch of sock puppet accounts commenting on posts saying that I was a rapist and have sexually assaulted many people. I knew instantly it was her doing. She didn’t even do a good job of hiding it. All the accounts names were from things she knew I liked. One was “corpse bride casting” and another was “starplatinum_gold47” They were all references to shows and movies i liked. Luckily I had screenshots of her trying to ask me for sex and other weird crazy shit she did. After i showed them all that and explained who she was, they believed me and said they would open a case against her, nothing ever came of it though and it was eventually closed because apparently the cop couldn’t get in contact with her. The comments were the last thing she did and it’s been quiet from her. The damage had been done though. My reputation was fucked. I’ve lost count of how many times i’ve had to explain to people i’m not a rapist. It doesn’t always work. My peers would talk about it and try to warn people of me. I tried asking the faculty to do something about it but they don’t do shit. \n\nI’m tired and angry all the time. I want to be normal. I want to take action. I don’t want to live like this anymore. I’m so tired of being made out to be a monster. I’m not. I want people to leave me alone and let me live. \n\nPlease offer your advice on how I can deal this. Anything would be greatly appreciated. Thank you",
            "Q_score": 39,
            "Id": "1266er4",
            "Url": "https://www.reddit.com/r/Advice/comments/1266er4/i_was_falsely_accused_of_sa_and_its_ruining_me/",
            "Aswer": "You need to contact a lawyer. I know that all colleges have a legal aid center where you can receive a legal advice for a reduce rate or free. I’m just a law student, but it sounds like you really could go after her civilly for damages(money). She defames your character, you might be able to get a tort against her, and maybe against the school for poor handling",
            "A_score": 71
        },
        {
            "Question": "My mom bought a house under my name without my permission!!!!\nHi some context, my mom lives in Florida and I live in New York. I am currently in school to become a nurse and am supporting myself on my own. I had read to let my credit agencies know to put a freeze on my credit because I knew my mom would do something like this. I guess I forgot that my mom literally knows my social security. What do I do, I am freaking out!!! I don’t know whether I should call the SSA or what, I can’t let my credit take a hit because my mom has a gambling problem and can’t pay her bills.\n\n\nHelp!!!!",
            "Q_score": 135,
            "Id": "125vl04",
            "Url": "https://www.reddit.com/r/Advice/comments/125vl04/my_mom_bought_a_house_under_my_name_without_my/",
            "Aswer": "Are you willing to charge her with fraud for forging your signature?",
            "A_score": 274
        },
        {
            "Question": "I'm (24f) getting a series of cosmetic surgeries and my (27m) boyfriend is acting like I'm going to pass away\nI'm (24f) going to have several cosmetic surgeries (Nose job, bichectomy, laser freckle removal, etc) in the next months. My boyfriend initially was against it, but later he agreed to support me and kind accepted it.\n\nBut his towards me attitude is really startling me. Every day he takes my face in his hands and kiss my nose and cheeks for several minutes. He takes photos of me very often. Last night he believed I was asleep when he went to bed and he kissed me and whispered \"My beautiful girl, how I'm going to miss you\". It's like he thought I'm going to die because of the surgeries or something, when they are totally safe. How can I make him see that he isn't going to lose me?\n\nTLDR: I'm getting cosmetic surgeries and my boyfriend is acring like I'm going to die on the table",
            "Q_score": 76,
            "Id": "125zmj8",
            "Url": "https://www.reddit.com/r/Advice/comments/125zmj8/im_24f_getting_a_series_of_cosmetic_surgeries_and/",
            "Aswer": "I don’t think he thinks you’re going to die, but it sounds like he will miss the way you look now.",
            "A_score": 490
        },
        {
            "Question": "Boyfriend got mad over me wearing a tank top\nI (22F) have been dating my boyfriend (21M) for almost 3 months, (I know it’s not a long time but they’ve been pretty intense) I am his first girlfriend and we have known each other for over 5 months. He’s sweet, kind and he treats me with respect, he’s always complimenting me and saying how lucky he is to have me. \n\nYesterday I got to see a side of him I didn’t know existed, and what happened left me in shock. We both study at the same uni and yesterday we met in the library, we were the only two people there at the time. I rushed to get to the library and so I was pretty sweaty. I was wearing a tank top under my long sleeve shirt and so I removed my shirt, since I was getting hot. \n\nAs soon as he saw me wearing a tank top he immediately removed his hoodie and gave it to me, saying “cover up, now”. Needless to say I thought he was joking, since he never showed any signs of being “conservative” or whatever you want to call it, and is supportive of women in general. \n\nHe started saying that I’m inappropriate and I shouldn’t be there wearing a tank top (remind you: we were the only two people present) I lack decor and I should cover up because I’m disrespecting the entire university and my teachers’ job by exposing my shoulders apparently. He even saw another girl wearing a tank top like 2 days prior and got upset and said “might as well wear a swimsuit, no? 🤨” but I didn’t think much of it because once again, there’s no way he way he being serious, at least in my head. \n\nI wholeheartedly believe that people should be allowed to wear and do what they want, without people criticizing them for it, and I highly DESPISE people who act the way he did yesterday. We talked a little about it and he firmly believes that society’s rules should be respected, but every time I questioned him about him blindly following what others say he didn’t even know how to reply, he just said that if most people believe in something then it must be right, zero critical thinking skills. \n\nHe apologized for telling me to cover up but also told me that these are his morals and he’s probably not willing to change them. \n\nI’m starting to believe I never knew him at all and I feel uncomfortable, but I also care about him and don’t want to end the relationship for one argument. He wants to move on but I don’t know if I can to be honest.",
            "Q_score": 215,
            "Id": "125ncgu",
            "Url": "https://www.reddit.com/r/Advice/comments/125ncgu/boyfriend_got_mad_over_me_wearing_a_tank_top/",
            "Aswer": ">sweet, kind, and he treats me with respect \n\nExcept he blew his lid over you wearing a tank top. Not very sweet, kind, or treating you with respect.",
            "A_score": 590
        },
        {
            "Question": "Whole office is mad at me coz I told a colleague’s spouse that she’s cheating on him\nBasically everyone at the office knew she is cheating except her spouse. I didn’t give shit until her spouse approached me then I told him everything.\n\nNow entire office is mad at me telling me that I should have minded my own business. This includes those simps who once tried to rape her when she was drunk at a party. Like wtf I did wrong?\n\nI’m out of office now but will go back in few days and idk how to counter everyone? Any advice?",
            "Q_score": 1085,
            "Id": "124oimq",
            "Url": "https://www.reddit.com/r/Advice/comments/124oimq/whole_office_is_mad_at_me_coz_i_told_a_colleagues/",
            "Aswer": "\"This includes those simps who once tried to rape her when she was drunk at a party\"......I feel like this is the bigger issue here!",
            "A_score": 1753
        },
        {
            "Question": "I want to live alone but people think it’s weird to not have roommates.\nLate 20s, F. \nI’m in a pretty high income job (but it means I work 14 hour days during the week). 1. I can afford it. 2. I can have free reign over the space when and how I want, esp after a long work day. 3. I work in a super extroverted field and wouldn’t mind some quiet time. \n\nI also accidentally ended up living alone during covid lockdown (roommates moved back to their family homes). And lost 30 pounds because there was never any junk food laying around and I was always motivated to go out to be social and be active (rather than falling into a Love Island trap because my roommate just has it on). \n\nBut everyone I tell thinks it’s so crazy. \n\nEdit (grammatical error): every single family/friend has said it’s sad and lonely. \n\nI know I shouldn’t care what people think, but I do care what my close people think… \n\nBut is it really that crazy? I’m single, but I do hope to have a family one day and will never have the chance to live alone after that!!",
            "Q_score": 27,
            "Id": "125i8fz",
            "Url": "https://www.reddit.com/r/Advice/comments/125i8fz/i_want_to_live_alone_but_people_think_its_weird/",
            "Aswer": "This sounds more like it's coming from jealousy that you can afford to live on your own in this economy. I don't know many young people who wouldn't kill to live alone but can't afford to. Life's too short not to be happy. Get a place and make it your own!",
            "A_score": 35
        },
        {
            "Question": "How did you survive the lowest point in your life?\nI’m a 24f and life has been progressively getting worse for me over the past 4 years and I’m struggling so much. I’d love to hear about how others have handled their worst moments and managed to keep going and not give up.\n\n(I’m very new to Reddit and I don’t know if I’m supposed to say helped in every comment so I’m sorry if I’m doing this wrong haha)\n\nThank you so much for taking the time to leave these comments! I appreciate it a lot",
            "Q_score": 163,
            "Id": "1253aaq",
            "Url": "https://www.reddit.com/r/Advice/comments/1253aaq/how_did_you_survive_the_lowest_point_in_your_life/",
            "Aswer": "Identify 1 negative aspect of your life that you have the power to remove from your life then remove it.\n\nIdentify 2 short term goals and 2 long term goals then identify what needs to happen to obtain them then obtain them. Rinse and repeat.\n\nThis is the exact blueprint that turned my life from “single unemployed criminal dropout alcoholic” to “sober married gainfully employed homeowner with a master’s degree” in 5 years.",
            "A_score": 130
        },
        {
            "Question": "my parents dont let me shower\nmy parents only let me wash myself every 3 days. and no showers, only baths. im a teen and i have pimples all over my body, i sweat a lot and i feel gross. my parents think i will get a cold if i shower daily. how do i convince them to let me?",
            "Q_score": 388,
            "Id": "124s6s6",
            "Url": "https://www.reddit.com/r/Advice/comments/124s6s6/my_parents_dont_let_me_shower/",
            "Aswer": "You should try and arrange a doctor's appointment where they can ask the doctor about their superstitious beliefs.",
            "A_score": 775
        },
        {
            "Question": "How do I get my ex to leave the gym I work at?\nSo my ex girlfriend is currently a member at the gym I manage at. The kicker is she was secretly married the entire time we were dating and once I found out I ended things. The problem is that every week Monday to Friday at 7:30am to 9am I see her and her new boyfriend that she cheated on me (and is currently cheating on her husband with) at the gym. I thought I could handle it but I can't. I flat out ignore them both but hearing their voices first thing in the morning almost every morning is painful. I just need advice on how I can get them to switch gyms? \n\nI can't leave this job, I was so broke for so long after covid. Lost my cafe and my house. And now I'm finally working again earning a very good salary and building my life back up. I just moved to this new town mid last year as well so I have no where else to go. Any advice please help",
            "Q_score": 546,
            "Id": "124ongs",
            "Url": "https://www.reddit.com/r/Advice/comments/124ongs/how_do_i_get_my_ex_to_leave_the_gym_i_work_at/",
            "Aswer": "Greet them both warmly and ask her how her husband is doing.",
            "A_score": 2020
        },
        {
            "Question": "Would it be weird if I made a friend some oat milk?\nI have a new friend who is vegan. They recently came over to my home so our kids could have a play date. I didn’t have any plant based milk in the house so they brought a container with a little bit of oat milk in it so they could have a cup of tea here. They accidentally left that container and the milk went bad so I threw it away and washed the container.\nWe were chatting about oat milk and they mentioned how expensive it is. I know that it’s fairly easy to make your own and was wondering if it would be weird if I gave them their container back with some homemade oat milk in it? Or is that too odd? I’m like 80% sure they would appreciate it but the 20% is shouting loudly that it’s too weird so I’d love some opinions please!",
            "Q_score": 73,
            "Id": "124xpeu",
            "Url": "https://www.reddit.com/r/Advice/comments/124xpeu/would_it_be_weird_if_i_made_a_friend_some_oat_milk/",
            "Aswer": "I’m vegan, I’d think it was super thoughtful and sweet",
            "A_score": 84
        },
        {
            "Question": "Fast ways to make money besides s*x work, I'm already selling everything I own\nI have listed most things I own for sale on Facebook market place and Kijiji. Even my tv, couch, dresser, my collectable cars that I adore. I am behind by a lot of money but right now I am in urgent need of about $300. I can usually do food delivery to catch up but my car needs a small repair first (I can do myself just need the part) and I have a negative account balance. I am looking for cash jobs as well as regular jobs. It's very hard to find a strictly daytime job as a single mother. I have had people reach out online to offer me cash jobs usually in construction or something of the like, but when they meet me and find out I'm a woman they doubt my strength and don't call me back. I am in Ontario, Canada. I did s*x work before but it was really scary and bad and they make me bleed all the time and I rather die than do that again. Maybe that is what I have to do but I want to know if there's other ideas.",
            "Q_score": 93,
            "Id": "124v7y4",
            "Url": "https://www.reddit.com/r/Advice/comments/124v7y4/fast_ways_to_make_money_besides_sx_work_im/",
            "Aswer": "Another idea. Contact your local nuclear power plant and ask to be trained as a firewatch for the next outage. You can even get sent to operations school if you have a general education diploma. No worries if you do not though, firewatch pays well.\n\nBy the way, if you are curious. This kind of basic job nets about 1k dollars per week for about 2-3 months. And if you choose to stay and they send you to the nuclear operator academy you'll be making roughly 80 thousand dollars per year. It requires 18 months of training and they will ship you most likely to the capital of your country. But I'm sure there are on campus accommodations for parents with children.",
            "A_score": 162
        },
        {
            "Question": "My (33m) girlfriend (29f) isn’t paying rent. Should I break up?\nI (33m) have been together with my gf (29f) for nearly 4 years now. She comes from a wealthy family. Well, her extended family is wealthy. Her parents are somewhere in the low 7 figures. But she never had to worry about money. Therefore she never really had a job. Sometimes she would work for her dad’s company. But that would only be minor tasks. I never really worried about that because it was made clear she would take over the business and thought she’d get everything together by then. At one point I got a bit annoyed that she was always at home and I never had a second for myself and helped her getting a job through a friend of mine where she works a few hours per week. \n\nI kind of became suspicious when she didn’t finish her degree and confronted her about it. But she shrugged it off and told me it wasn’t any of my business as long as she was able to pay rent and contribute financially to our life. Since communication is very important to me I was a bit alarmed. \n\nDuring the last year things got rocky. For reference: We split rent and costs for our dog 50/50. Since I’m using her car sometimes I give her half of the leasing rate + gas. Other spendings are all from our own accounts.\nLast summer we went on a roadtrip where I paid for everything. Afterwards I told her the total, expecting her to pay me back. She told me she couldn’t afford it, which I thought was weird. First of all because I know she got a huuuuge cheque from her dad the year before and I thought it was a bit unfair not to clarify beforehand. Since then she only paid rent sporadically. When I confronted her about it and asked her when she was gonna contribute again to our shared life I barely got an answer or she told me she couldn’t afford it. \nTo be clear, it’s not about the money in the first place but more about the way of not communicating about this issue. Am I expecting too much? How could I address this better? Or is this a major red flag?\n\n\n\n\nUpdate: to address a few comments\n\nCommunication about finances: I was very upfront when she moved in about all costs, what and how I plan to cover/split. We discussed it multiple times. She’s a passionate cook but at one point grocery spendings were getting out of hand (1k/month). We agreed on a limit. \nBut I also think there should be common sense about spending. Why would I need to clarify that I don’t pay for a full vacation? Doesn’t make sense to me in a relationship. In my previous relationships my partner always offered to pay her half or contribute whatever she can.\n\nCommunication emotionally: My girlfriend is a very insecure person. She’d rather listens to others instead of doing the talking. In my opinion that’s rooted in lack of self esteem. That’s why it’s hard to talk about emotional or uncomfortable things with her. I can see her trying though. \n\nIn her defense: She’s not overall lazy. As I mentioned she’s a passionate cook and kinda turned into a SAHP, likes to make everything nice at home, having guests over etc. It’s just… I never asked her to do any of that. I want my partner to tell me what she’s thinking about, what her goals are, difficulties, etc. Wich I told her. \nBut she totally locks me out. Guess that’s why the rent thing is bothering me so much. It would have been fine for me if she would have come to me before and would have told me that she can’t pay rent, why that is and what her plan is.\n\nI did talk to her about it multiple times. But I also wanna support her and not being a douche to her. And yeah, maybe I’m bad at addressing this properly, because I don’t wanna be too harsh.\n\nAnd no, I’m not after her money. My only goal is to be financially stable and independent. I like my job which won’t make me rich but I’ll won’t struggle. But I do like her family. We get along very well. Which is important to me.",
            "Q_score": 82,
            "Id": "124t8ts",
            "Url": "https://www.reddit.com/r/Advice/comments/124t8ts/my_33m_girlfriend_29f_isnt_paying_rent_should_i/",
            "Aswer": "Massive red flag. She is very obviously hiding *something* from you.",
            "A_score": 146
        },
        {
            "Question": "Red wine spilled at a party who’s responsible\nI was sitting next to a friend at a small party and she was drinking red wine. She stood up abruptly and my hand bumped her red wine glass. It spilled all over her dress and splattered on the light grey couch and carpet. She was able to get the wine out of her dress. The host of the party had hired someone to help with drinks and cleaning during the party. At that time she acted quick and tried to scrub the wine out of the cushions. She confirmed to me she was able to get the wine out. The following day the host of the party said he was angry with me due to the red wine spill which apparently has not fully come out of the cushions or the carpet. The guest who was actually drinking the red wine confirmed she was able to get the red wine out of her dress. My question is, who is responsible for the red wine stained on the cushions and carpet? I said the person he hired confirmed to me she was able to get the stains out of the cushions at that moment. The host is insinuating that I should pay to replace the cushions, which are apparently not even available for purchase anymore. Who is responsible?",
            "Q_score": 173,
            "Id": "124lgne",
            "Url": "https://www.reddit.com/r/Advice/comments/124lgne/red_wine_spilled_at_a_party_whos_responsible/",
            "Aswer": "The host. Their party, their responsibility. You were an invited guest and unless you purposely set a few small fires or tore plumbing out of the walls, the host bears all responsibility.",
            "A_score": 547
        }
    ]
}