{
    "Posts": [
        {
            "Question": "My [23F] bf [25M] told me to take down a pic because my boobs don't look big enough\nI posted a pic and he said \"Please take that one down, I don't feel comfortable with it\". I was like \"Umm...wtf? Why?\"\n\nHe told me that from the pic, it's clear that I don't have big boobs. Apparently he had been bragging (and lying) to his friends that I have really big boobs. I was really angry when he told me this and he was just like \"It's okay that you don't have big boobs....I love your boobs, I just wanted to seem cooler and tell my friends that my gf has huge boobs\".\n\nUm.... obviously YOU DO wish I had bigger boobs or you wouldn't lie to your friends and say that I have big ones when I don't. I'm honestly considering breaking up but I'm not sure....he has always been so amazing to me for the 6 months that we have been together. But this really made me angry.\n\nThis is the pic I posted that he asked me to delete....now I feel a bit insecure about myself and I'm wondering if that's really the reason? Like is there just something wrong with this pic or do you think the \"your boobs don't look big enough\" excuse is the real reason he said it? https://i.imgur.com/KY5F1rX.jpg\n\ntl;dr My bf told me to delete a pic because my boobs don't look big enough and now I don't know if I should continue dating him or if I should trust him\n\nEdit: OMG IT GETS WORSE! I have an older sister and she actually does have very big boobs, and apparently he showed her pics to his friends and pretended that was me!!! WHAT THE FUCK!",
            "Q_score": 402,
            "Id": "11z9eh0",
            "Url": "https://www.reddit.com/r/Advice/comments/11z9eh0/my_23f_bf_25m_told_me_to_take_down_a_pic_because/",
            "Aswer": "Is your BF 25 or 15? What a stupid and childish thing to say. Also if he lies about his girlfriends boob size he probably lies about everything. What a weirdo",
            "A_score": 532
        },
        {
            "Question": "My boss has asked some employees, including myself to work for free for a charity night.\nHi everyone!\nSo my boss is putting on a fund-raiser for a former member of staff who sadly passed away around Christmas time and we want to raise money for her children. \nHe is hosting the event at his restaurant and guests are paying $150 a ticket to attend plus some auctions and such that the money will go to the children.\nNow here is my problem that I would like some advice on.\nThe boss approached the whole kitchen and wait team and asked if we would be willing to work for free on the night of the fund-raiser. \nIt is being held on a Friday night and almost all the staff are casual and alot of us depend on our entire pay to basically survive. \nWould it be wrong to decline this? I really would like some advice because I feel bad but I also have my own children to think of and can't afford to lose 8hrs of pay.\nThankyou!",
            "Q_score": 600,
            "Id": "11yh0pj",
            "Url": "https://www.reddit.com/r/Advice/comments/11yh0pj/my_boss_has_asked_some_employees_including_myself/",
            "Aswer": "\"I'm sorry boss, I would love to help but I cannot afford my bills if I'm not paid for the time I work\"\n\nYou can do this privately. If they shame you in any way you should probably look for another job.",
            "A_score": 1019
        },
        {
            "Question": "A girl asked me to bark for her wtf does that mean\n\nSo basically this sort of “popular” girl I’m rather friendly with did something kinda odd. Just for context, She says weird stuff sometimes, and she seems to try to get my attention a lot more than she does with others. Might just be because I tend to be pretty approachable ig, don’t really know why tho. So basically, a few days ago, she said something really weird. Idk if this is normal behavior, or it might be some internet trend thing I haven’t noticed. She said quote “can you bark for me” in the middle of class in a rather demanding way. I normally don’t have a problem with weird humor. But holy shit that was weird. I kinda just froze and smiled awkwardly at her. Cuz like wtf was I supposed to say? The girl sitting next to me gave me a weird look and we went back to studying. My question is, what should I do with this? Should I just forget it happend or bring it up?\n\nOh and we are high schoolers, and I apologize for any grammar mistakes. English is not my native language, and my understanding of it is rather limited\n\nTLDR: girl asked me to bark in I’m still in shock form how odd it was",
            "Q_score": 21,
            "Id": "11z0ll3",
            "Url": "https://www.reddit.com/r/Advice/comments/11z0ll3/a_girl_asked_me_to_bark_for_her_wtf_does_that_mean/",
            "Aswer": "One thing you shouldn't do is bark for her. Or for anyone. Bark on your own terms, if you like to bark.",
            "A_score": 82
        },
        {
            "Question": "underage coworker has a crush on me and my other coworkers are encouraging him to “shoot his shot”\n15 minutes ago, i just found out that one of my coworkers has a crush on me. he’s 17 and i’m 20, and i genuinely really liked being coworkers/friends with him, but now i feel weird\n\nmy other coworker told me that our manager told him to “shoot his shot,” and a lot of people ship us. apparently it’s been very obvious that he likes me, but i’m one oblivious ass mf. \n\na while ago, our assistant manager said she thought we would be cute together, despite the age gap. i know age gap isn’t a very big deal to most people, but he’s still in highschool, and he is not ugly, but i am not attracted to him.\n\nhe turns 18 in january and said that he plans on moving, but he wanted to hang out with me on his summer break and i really wanted to, before i found this out\n\nhe doesn’t know that i know, and i don’t know what to do or say. i turned 20 in september and this is my first time actually being an adult, so i’m fucking clueless. \n\nwhere do i go from here.",
            "Q_score": 35,
            "Id": "11yviuy",
            "Url": "https://www.reddit.com/r/Advice/comments/11yviuy/underage_coworker_has_a_crush_on_me_and_my_other/",
            "Aswer": "Let everyone at work talk. \nGossip will always be there. \n\nJust be his friend. If he does ask you out. \nTell him that the feelings are mutual and just keep bring friends if that works for the both of you. \n\nDon't let others ruin something nice",
            "A_score": 33
        },
        {
            "Question": "Relationship advice please help\nHey guys I need some help with this relationship that I’m in. I’m a 22 F and my bf is a 32 M. I met my bf in university and he kept telling me that his birthday was to where we were only 2 years apart (1998). For several months, I was rather suspicious of this because there were photos of him on Instagram tagged in frat formals from dates to where if that was his birth year, it wouldn’t have made sense because it would mean that he would be in high school. During Xmas, I finally went through his license and saw that his birthday was in 1990 instead of 1998, making him actually 10 years older than me. I felt betrayed seeing this and tried to forgive him. Despite this, I cannot help continue to be reminded of this from time to time and how he basically lied to me for almost a year of our relationship. I love him a whole lot, and believe that he’s the best for me but I cannot get over this big lie he kept from me. What should I do?",
            "Q_score": 37,
            "Id": "11ytvy7",
            "Url": "https://www.reddit.com/r/Advice/comments/11ytvy7/relationship_advice_please_help/",
            "Aswer": "Run. A man who is willing to completely fabricate his identity can’t be trusted. You had to go through his documents to get the truth. I’m 31, about his age, I won’t date anyone younger than 27. Ask yourself this, why would a 32 year old man lie about his age to you? Did you ever meet his friends? Family? They would surely have known his age and they also kept it from you. You don’t deserve to have your partner deceive you. He could be a creep, or married, or a criminal. You don’t know because you don’t actually even know him.",
            "A_score": 105
        },
        {
            "Question": "I'm being scammed and need advice\nI sent nudes to a girl and she is threatening to post the nudes on the internet unless I pay her a huge amount of money. Please, I'm scared and need advice\n\nEdit. Nothing has happened of yet. I told her that she is in possession of CP and that it carries a hefty sentence. I also blocked and reported her on all social media. Thank you everyone for the advice, I really appreciate it",
            "Q_score": 152,
            "Id": "11yg66i",
            "Url": "https://www.reddit.com/r/Advice/comments/11yg66i/im_being_scammed_and_need_advice/",
            "Aswer": "Block and delete here.  And move on. \n\nLife lesson.  Never send anything or say anything online.  That you do not want the world to see. \n\nOwn it and move on.",
            "A_score": 459
        },
        {
            "Question": "I lost my best friend in a car accident two weeks and my father told me that I was weak to cry over it and that I’m weird for taking it so hard.\nHello my name is Brian I’m 17 years old. Two weeks ago I lost my best friend Hayley to a car accident she was 18 years old. I met her in kindergarten and we were best friends ever since. She was so nice to me and we were pretty much like siblings we talked every day. Not being able to call her or be able to just go see her whenever I want to and give her a hug is just killing me. I’ve been calling her phone just to hear her voice on her voicemail. My father saw me crying in my room yesterday and told me to man up and that I was weak. He also told me that it was weird that I was taking this so hard since she was just a friend and not family. I’m really struggling right now and could use some advice I just feel lost right now.",
            "Q_score": 206,
            "Id": "11ydsjq",
            "Url": "https://www.reddit.com/r/Advice/comments/11ydsjq/i_lost_my_best_friend_in_a_car_accident_two_weeks/",
            "Aswer": "old man here... your dad, is wrong.\n\nit's a left over of a time where men were to stupid to allow life to actually be life.\n\nyou feel what you must, do what you must, just ignore his stupidity and ignorance of a time that should be long gone",
            "A_score": 206
        },
        {
            "Question": "My husband just passed away this morning\nHi r/advice…. I’m on mobile so I’m going to apologize for my formatting now but, \n\nMy husband just passed away this morning and I need help figuring out what to do. I (25f) and him (34m) just moved into our own apartment 4 days ago. Not to mention the fact that I can’t stop thinking about the moments before he died(I had with him all day up until it happened) I also have a bunch of bills and things like his phone and computer, that need to be paid off but won’t be used anymore. So I guess I’m just looking for some guidance, also a therapist would be nice…\n\nEdit: Thank you all so much for the overwhelming support, also him and I worked the same job(local truckers that team drive.) I’ve talked with my boss already and he is going to cover funeral/cremation costs for me. The main problems I’m having right now are: where am I going to live and what am I going to do for work?(I don’t really want to go back to trucking cause that’s what brought us together)",
            "Q_score": 909,
            "Id": "11xxdca",
            "Url": "https://www.reddit.com/r/Advice/comments/11xxdca/my_husband_just_passed_away_this_morning/",
            "Aswer": "r/griefsupport",
            "A_score": 478
        },
        {
            "Question": "I (24F) went through my bf (24M) phone\nLike the title suggests yes I went through his phone and I know that it’s a very bad thing and will not do it again!! I did find a few things that bothered me. My bf still has all of the nudes from his ex and chats from when they were together. Now I have it the benefit of the doubt and said to myself that he forgot about them, but what I thought was worrisome it’s the fact that the chat is muted. There were no new text messages between them, but still, I’ve been thinking about it a lot… at times based on his behavior I do get the feeling of him not being completely over his ex, but apart from that what should I do now?",
            "Q_score": 24,
            "Id": "11ypvpy",
            "Url": "https://www.reddit.com/r/Advice/comments/11ypvpy/i_24f_went_through_my_bf_24m_phone/",
            "Aswer": "I can go through my husbands (25+ years married) phone whenever I want - as he can go through mine.\n\nThe thing is, I don't - not even because I trust him but more because I can't be bothered to look for something. \n\nTalk to him about how you feel - communication is key here.",
            "A_score": 45
        },
        {
            "Question": "How would be the best way for me (18 F) to talk to my boyfriend (18 M, who is circumcised) about not wanting to circumcise our son?\nHello everyone, me and my boyfriend are going to have a baby soon and we've never talked about this before so I'm not really sure how he feels, I could be overthinking things and be worried for nothing. But even so, I'd like to hear some other men's thoughts on this before I bring it up him if I can, thank you for any input.\n\nI don't want this to be too long so I'll just give a brief explanation. I'm a woman and I do not want to circumcise our son. My boyfriend is circumcised (not for any cultural or religious reasons, we live in the US so it's just the norm) and I'm worried if I bring this up and tell him my reasons for not wanting to he could be hurt or insulted. This would never be my intention and I wouldn't say anything that could be offensive on purpose, but I'm worried I may come off that way. This is really important to me and I don't want to just not talk about it because when the baby is born and the time comes to make a decision it may cause issues if we aren't on the same page.\n\nI'm writing this here because I'd like to hear from men how they feel about this or would feel if their girlfriend brought this up to them and how would be the best and most sensitive way for me to bring this up and explain my reasons for not wanting to circumcise our son? Has anyone ever been in this situation and if so how did you feel about it and do you wish the conversation went differently?\n\nAgain I may be overreacting and he could have no opinion or feeling about this at all lol, but I want to be prepared and mindful just in case! Thank you again for any input, sorry this ended up being long!",
            "Q_score": 113,
            "Id": "11xs92r",
            "Url": "https://www.reddit.com/r/Advice/comments/11xs92r/how_would_be_the_best_way_for_me_18_f_to_talk_to/",
            "Aswer": "It's a two yes, one no type of deal. You both have to agree to it, but if one person says no, it's a no. Body mutilation on someone who can't consent is pretty freaking bizarre when you think about it, so I would say \"let's wait until our son is old enough to consent, and then we can ask him what he wants to do\"\n\nedit: also, as a man, I want my foreskin back",
            "A_score": 183
        },
        {
            "Question": "I’m a male survivor of SA and I’m struggling to cope with it.\nHey all I’m not quite sure what to say here but I’ll just get to it. So I’m guy in my 20s who grew up REALLY religious. As a kid we had a close family friend who I’d spend many nights at his house and he at mine. On a few occasions his older cousin in her teens baby sat us when our parents went out or did events with our church. His cousin was also a member of our church and his family had a lot of prestige within our parish. \n\nWith that as the backdrop, when she would baby sit us she’d let us play and do whatever. But after a while she would call us down to the family computer and porn would be one. She’d have her hand in her pants and call us over. She’d then have me and my friend do things to each other, to her, and she’d do it back to us. It felt good to me but I knew it was wrong, even at 9 years old. She told us not to tell anyone or else our parents would get kicked out of the church. \n\nThis same pattern went on when I was well into my teens until we no longer needed a baby sitter. During puberty this was especially confusing because I didn’t like men but was forced to do sex acts on my friend. Adding to that, i also lost my virginity to her and felt so impure. I didn’t date anyone in HS because of this. I felt undeserving of love and confused about my sexuality. \n\nI experimented plenty when I went off to college and don’t really have ties to the faith anymore. There is still a level of catholic guilt that I don’t know if I’ll ever escape but that’s not all that present in my thoughts these days. The first girl I opened up to about my past left me because I was “with a man” and I just don’t know that I ever will be willing to be vulnerable like that again. \n\nI guess the reason for this post is to ask if anyone out there has had a similar experience and how you manage? I’ve done therapy in the past but can’t afford it at the moment. \n\nI also want to explore my sexuality further but have a lot of trust issues. Is there a place on Reddit to do so? The anonymity here provides me some comfort and this and r/sex sub was the first place I figured I should look.",
            "Q_score": 71,
            "Id": "11xqtg5",
            "Url": "https://www.reddit.com/r/Advice/comments/11xqtg5/im_a_male_survivor_of_sa_and_im_struggling_to/",
            "Aswer": "I don't have the experience or many answers you seek but hopefully others will jump in with some.\n\nThat's horrible what you went through and I'm sorry that a person you trusted to share this with was unable to handle the trauma you've suffered. \n\nQuickly, \"with a man\" doesn't count unless you want it to count. In my book, that which is done to the defenseless cannot be held against them in anyway against their wishes.\n\nGood luck, I hope you find the support you're looking for.",
            "A_score": 49
        },
        {
            "Question": "Me and my boyfriend of 5 years are going to break up tomorrow, I know I'm headed toward a long journey of different emotions. I could use some advice on how to approach this.\nAnyone here has been through this? It's my first relationship. I could use some advice on how to handle things after he's gone. I could also use some support rn. thank you\n\nAnd no working on the relationship is no longer an option\n\n&#x200B;\n\nEdit: Absolutely appreciate all of you for taking the time to write your replies, truly your words mean a lot right now. Thank you all ",
            "Q_score": 32,
            "Id": "11xyo62",
            "Url": "https://www.reddit.com/r/Advice/comments/11xyo62/me_and_my_boyfriend_of_5_years_are_going_to_break/",
            "Aswer": "There will be moments you miss him and moments you regret the breakup. Just understand it’s done and the more you look back the harder it will be to move forward. \n\nClean breaks are always the best, and don’t be harsh on yourself. Treat yourself well both in how you speak to yourself and what you do to relax.",
            "A_score": 57
        },
        {
            "Question": "Girl I text responses are very vague\nSo my friend’s girlfriends’ friend thought I was cute and asked for my number. She asked for it through my friend though, so not directly. He asked if I wanted to text her basically. Anyways, we texted for about a week, and she would come up to me during school and we would talk a little then. She never initiated conversation over text and she was always vague so I decided to just ask for her intentions one night. She said she thought I was cute but wasn’t ready for anything yet. So I said I felt the same and I was honestly stressed cause of a lot going on in my life at the time so I left her on delivered. I randomly sent her an 8 ball later that night as a joke, and she didn’t respond till almost a week later. (During this week period she told her friends she rejected me and I was a lying piece of s**t) after she responded we kept playing the 8 ball and eventually started conversation. But it’s the same as last time. I start every conversation and her responses are vague. I’ll ask her a question or say something and she’ll respond to the question but it will be vague. She never starts any conversation. I’m confused whether I should ask her about it or not. Do I confront her? What do I do?",
            "Q_score": 23,
            "Id": "11y0sjq",
            "Url": "https://www.reddit.com/r/Advice/comments/11y0sjq/girl_i_text_responses_are_very_vague/",
            "Aswer": "Why would you wanna continue any sort of communication with someone who called you a piece of shit and blatantly lied about you? Fuck her dude lmao, just leave it as is.",
            "A_score": 31
        },
        {
            "Question": "Finally had the courage to talk to my gym and im so embarrassed\nI’m 25 (f) I’ve been seeing this guy every time I’m at the gym for the past few months, we’ve made eye contact with eachother and even cracked a smile passing eachother but never had a conversation…well today I walked over to the back machines and he followed me and got on the machine next to mine. When he finished his set we made eye contact and I said “I sure do see you here a lot” he laughed and said “yeah its like we’re on the same schedule” we had small talk..found out he’s in college and I told him I work for the government and he mentioned he had a brother that does the same thing. Well he ended up just saying “it was nice to meet you” I was sure he was going to ask for my number he he didn’t…maybe he’s not interested ? Or should I just leave him alone ?",
            "Q_score": 35,
            "Id": "11xvbym",
            "Url": "https://www.reddit.com/r/Advice/comments/11xvbym/finally_had_the_courage_to_talk_to_my_gym_and_im/",
            "Aswer": "Since you see each other on a regular bases at the gym, there was no need for him to hurry. In this situation, I wouldn't have asked for your number during the first conversation either, since there is plenty of opportunity.",
            "A_score": 101
        },
        {
            "Question": "I'm not interested in anything career-wise.\nI (25F) have been largely unemployed for three years. I had a job briefly but they laid me off and I haven't been able to find anything else since. Like, *anything* else, not even retail jobs or call centers or anything like that. I've gone back to school but I don't even like the program I'm in, I just didn't know what else to do. I could drop out but that would look bad and I don't know what I'd do instead.\n\nI ask for help finding a job and people ask me \"well, what do you want to do?\" and I never have an answer, so they tell me they can't help me. I go to career fairs and networking events and everyone expects me to be eager about whatever industry the event is about, but I'm not. I can't even pretend to be. I don't really \\*want\\* to do anything, I just need a job, hopefully one I don't hate and that will give me stable income. All my friends have at least some idea of what sort of work they want to do (to the extent that people in their 20s do at least) but I don't have that. Even my college major I chose based on what I'm good at, not what I'm interested in. Because again, I'm not interested in anything so what else was I supposed to do?\n\nI just have no career ambitions at all and people are treating me like I can't do anything until I have them. But I can't just sit around waiting to suddenly be interested in something. I don't know what I'm supposed to do.",
            "Q_score": 22,
            "Id": "11xsi5j",
            "Url": "https://www.reddit.com/r/Advice/comments/11xsi5j/im_not_interested_in_anything_careerwise/",
            "Aswer": "My last 2 jobs i never thought to  make a career in, it just happened.\n\nIm not passionate about data analysis or bookkeeping, but i am passionate about my life outside of work. I look for jobs that allow me to live the life i want.",
            "A_score": 24
        },
        {
            "Question": "[18f] [18m] my boyfriend won’t get the surgery he needs for his dick\n\nWe’ve been going out a year and a half now. One thing with my boyfriend is that his dick, or specifically the band on the back of the head the “frenulum” frequently tears. \n\nWhen we first started having sex it would tear in any position. But now he goes extra gentle (which gets annoying) and it’s fine but when I ride him there’s a good chance it tears so I have to feel bad every time I want to go that. \n\nAnd every time it happens we have to wait a week or two for it to heal before he can use it again. I would there’s seriously like a 30% every time I ride him it’ll tear and a 5-10% that if he’s doing it it’ll tear. \n\nI googled and there’s surgery you can get to lengthen the band so it stops tearing. But apparently there’s a slight chance it’ll reduce sensitivity in the dick because the frenulum is pretty sensitive. \n\nHe said he’s not losing feeling in his dick so he won’t get it. I ask what he plans to do then and he said nothing, like literally he plans to do nothing.",
            "Q_score": 515,
            "Id": "11wxnd0",
            "Url": "https://www.reddit.com/r/Advice/comments/11wxnd0/18f_18m_my_boyfriend_wont_get_the_surgery_he/",
            "Aswer": "This is his body.... he has every right to say no to this surgery. Just like you have ever right to leave the relationship if the sex isn't how you want it.",
            "A_score": 2158
        },
        {
            "Question": "What should I do with people that wouldn't leave me alone in the gym at night?\n\n\nI [M27] am a, although thankfully functional, neurodivergent person.\n\nI am not comfortable around people and I relax and calm myself through repetitive behaviour.\n\nFor this reason I love going to a nearby 24/7 gym and at night. I can use the same machine for one or two hours (I usually take three hour sessions in total) without anybody else waiting for me to finish and often there isn't anybody else in the first place. (Mostly running or other repetitive things).\n\nRecently I have been approached by people that are making me very uncomfortable. They insist on asking questions about me, my work, my salary and don't seem to take kindly me not willing to answer al talk at all. They grab stuff from my bag (like my brush when I am done with it, they then use it on their own hair and give it back to me but it still grosses me out and it's unnerving).\n\nI just want to be left alone, but I don't want to lose the place that has been my coping mechanism for so long.\n\nWhat should I do?",
            "Q_score": 29,
            "Id": "11xgqq8",
            "Url": "https://www.reddit.com/r/Advice/comments/11xgqq8/what_should_i_do_with_people_that_wouldnt_leave/",
            "Aswer": "Grabbing your brush is not normal behavior. \n\nIt is acceptable for you to firmly state \"Put that back. Do not touch my stuff.\"\n\nIf you don't feel comfortable doing that, tell the staff. \"These people keep harassing me and taking things out of my bag. I don't want them to. Please make sure they leave me alone.\"\n\n&#x200B;\n\nIt's also okay to say \"I prefer to work out alone.\" and put your headphones back on. Even if you're not listening to music, you can play a podcast, some white noise, whatever you want. Or just leave them on so people see them and realize you aren't interested in hearing them.",
            "A_score": 63
        },
        {
            "Question": "Is it irresponsible to hit a dab pen if you’re the only one watching your kid but they’re asleep?\nI thought it might help me relax, so I hit a dab pen that I keep safely put away in a box at the top of my closet where you’re supposed to put hats. I rarely ever use it and it’s been about 6 months since I hit it. Anyway, I wasn’t expecting to get as high as I just got from one hit. Now I’m thinking there’s a small chance my daughter might wake up, and I don’t know if this was an irresponsible move. I have everything around here taken care of, and I’m not struggling to get by or provide, but yet getting high just now has made me question all of that and wonder if I’m even fit to be a parent. \n\nI’m sure I’m just high and it’s actually not that irresponsible, because I’m not impaired or unable to look after her if she wakes up, but I need a little bit of reassurance. My mom called a few minutes after I got high. Everyone always acts so concerned about me, and they always give me advice on what to do and check in on me, because they all think I’m not cut out to be a single parent. None of my family or former in laws trust me at all. That’s the only reason my mom called, and that made me start to wonder if maybe they’re all right about me. I think this was a minor mistake, I didn’t know I was going to get as high as I did, but I don’t think this was irresponsible. Was this pretty bad and a sign that they’re right, or not that big of a deal? If I wasn’t high I would probably be able to know, but I can’t work it out at the moment",
            "Q_score": 22,
            "Id": "11xi2i9",
            "Url": "https://www.reddit.com/r/Advice/comments/11xi2i9/is_it_irresponsible_to_hit_a_dab_pen_if_youre_the/",
            "Aswer": "If you're too high to respond responsibly to an emergency, then yes. That would be irresponsible.\n\nCompare it to alcohol. It's fine to have a beer at the end of the day right? You're still sober enough to drive or make important phone calls. If an emergency comes up you'll still be able to be the responsible adult as long as you don't get drunk.\n\nSame with weed. Keep it mild enough that you'd be safe driving (and don't give that \"I drive better when I'm high\" BS, I hope you aren't one of those types)",
            "A_score": 121
        },
        {
            "Question": "My husband cheated on me and then left me for his affair partner. How do I recover from this?\nI (28F) was married with my husband (35M) for 3 years, together for 6 years total. He was the first person I dated. I absolutely adored him. He was the love of my life, my best friend, my life partner. It's sad to say, but I thought he would be the last person on earth to cheat. But here we are.  \n\nI've had so much issues with my mental health since finding out about the affair. I feel so naive. I trusted this man 100 percent. He always portrayed himself as someone with a high moral compass. I remember him expressing how much disdain he has for people who cheat. I did sense something off about him and this girl. I confronted him about it and he managed to look me in the eye and deny everything. He looked me in the fucking eye and told me he loved me and only me. That he would never cheat on me. Only for me to catch him a week after. And then subsequently, leaving me for his affair partner. I just can't imagine trusting anyone again. \n\nFor people who have gone through the same situation, how did you recover?  \n\nEdit: I feel so moved by everyone's responses. Thank you so much for the kind words, advices, perspectives, and stories. I hope to be at a better place in the near future. I'll do my best.",
            "Q_score": 67,
            "Id": "11x7pe9",
            "Url": "https://www.reddit.com/r/Advice/comments/11x7pe9/my_husband_cheated_on_me_and_then_left_me_for_his/",
            "Aswer": "You thank your lucky stars that you found out now and did not waste anymore time on this douchebag. You get a good lawyer and take him to the cleaners. And then you take a well-deserved vacation and live happily ever after because you are free of someone who obviously didn't care about you as much as you cared about them.\n\nBe free.\nAnd love yourself enough to not waste another tear on this dirt bag.",
            "A_score": 83
        },
        {
            "Question": "My ftm trans friend is becoming misogynistic to me. Female.\nOkay so I have a friend and we’ve been friends for awhile. He has transitioned into a man and I fully support. However, I’ve noticed he’s started to become misogynistic. Sometimes he will make a kitchen joke or say “woman moment” and I’m just so confused on what to do? I feel like obviously he craves validation from cis men and is mirroring his cis male friends behavior so he can “fit in”. But I feel like it’s ruining our friendship. Any advice?",
            "Q_score": 706,
            "Id": "11ppaqn",
            "Url": "https://www.reddit.com/r/Advice/comments/11ppaqn/my_ftm_trans_friend_is_becoming_misogynistic_to/",
            "Aswer": "I'd call him on it like you would anyone else saying those things, \"Hey, not funny. No really, disrespectful and not cool.\"",
            "A_score": 1123
        }
    ]
}