{
    "Posts": [
        {
            "Question": "My sons girlfriend has some issues. Help!\nMy son (20) has been with his girlfriend (20) for about 5 months and she's just moved in with us as she doesn't get along with her parents but she comes with issues that I'm not used to or know how to deal with.\n\nShe's not working so my son and I are supporting her. I've been trying to help her find work but she's not making an effort.\n\nWhen it was me and my son, I'd put food in the fridge (cooked meats, salads, bread, sandwich wraps etc) and he'd take care of himself but his girlfriend always asks for cooked meals for lunch and dinner and to make it worse, she won't eat left overs or the same thing twice in one day. Won't even eat them the next day.\n\nWhen I do cook meals, she loads her plate up so full that she can't eat it all. Ends up in the fridge but as I said, she won't eat left overs so it gets thrown out.\n\nIn the mornings when I first wake up, I like to sit in peace and have my coffee, watch the morning news etc but she right there non stop talking and doesn't seem to take a breath.\n\nShe's not a bad person. She's actually a lovely girl who clearly hasn't had the best upbringing. If we could get these small issues sorted, I feel we'd have a much better relationship.\n\nHow do I help her understand that these things are not ok without hurting her?",
            "Q_score": 51,
            "Id": "11qb3of",
            "Url": "https://www.reddit.com/r/Advice/comments/11qb3of/my_sons_girlfriend_has_some_issues_help/",
            "Aswer": "Maybe you can offer to teach her to cook? It would be a good way to bring up that you’d like her to do it herself and if she’s missing the skills you can help her develop them. If you have time of course",
            "A_score": 55
        },
        {
            "Question": "My gf is being tracked.\nSo I’ll keep it brief. My gf has been getting notifications that an AirTag is following her car. We recently moved, and it travels with her everywhere she goes in her car. \n\nWe searched what we could. But where are some good places to look? It’s a 2016 Mazda 3 if that helps. \n\nYes, we’ve got in touch with the police. They said they can’t do much until we actually find a tracker. \n\nShe’s going to try to have a shop look for it asap.  Thanks for any and all help.",
            "Q_score": 305,
            "Id": "11pxwd8",
            "Url": "https://www.reddit.com/r/Advice/comments/11pxwd8/my_gf_is_being_tracked/",
            "Aswer": "My nasty fuckin ex gf put a android smart tag in my kid's backpack and I found it really easy but mostly because she previously was trying to record my conversations with a recording spy pen.There's an app called BLE Scanner. Download it and take it outside maybe 75 feet from her car and refresh the app. Take note of all devices that it picks up. Then got next to the car and refresh the app, if there is a tracker in or on the car you'll notice a new device appearing in the app. Look at the distance which is in meters, then walk around to different sides of the car, and look at the distance. The lower the distance means the closer you are to the Air Tag. The app should display Air Tag so it should be really easy to find in the app when looking at it. I'd also recommend maybe doing this search with her car at least 75 feet from all other cars and bluetooth device that are on phones and cars. It should be super easy to find. Good luck and keep us posted on the progress. Here's a [link for the app](https://apps.apple.com/us/app/ble-scanner-4-0/id1221763603).",
            "A_score": 396
        },
        {
            "Question": "My ftm trans friend is becoming misogynistic to me. Female.\nOkay so I have a friend and we’ve been friends for awhile. He has transitioned into a man and I fully support. However, I’ve noticed he’s started to become misogynistic. Sometimes he will make a kitchen joke or say “woman moment” and I’m just so confused on what to do? I feel like obviously he craves validation from cis men and is mirroring his cis male friends behavior so he can “fit in”. But I feel like it’s ruining our friendship. Any advice?",
            "Q_score": 584,
            "Id": "11ppaqn",
            "Url": "https://www.reddit.com/r/Advice/comments/11ppaqn/my_ftm_trans_friend_is_becoming_misogynistic_to/",
            "Aswer": "I'd call him on it like you would anyone else saying those things, \"Hey, not funny. No really, disrespectful and not cool.\"",
            "A_score": 941
        },
        {
            "Question": "I met up with my son after four years of no contact.\n \n\nOriginal Post: [https://www.reddit.com/r/relationship\\_advice/duplicates/11lcng9/my\\_son22m\\_cut\\_contact\\_with\\_me\\_43f\\_four\\_years\\_ago/](https://www.reddit.com/r/relationship_advice/duplicates/11lcng9/my_son22m_cut_contact_with_me_43f_four_years_ago/)\n\nFor the few that gave me actual advice, I went to meet up with my son without Max or my daughter. It was at a local coffee shop. I found him sitting in one of the booths at the coffee shop. He was on his phone. I was really scared. A part of me wanted to tackle him with a hug and beg for his forgiveness. Another part of me, wanted to leave before he noticed me. I said his name to get his attention. He didn't even leave his seat; he just looked at me and said hi. I asked if I could sit. I started asking about how is he doing. He said he was fine. I was about to apologize, but he interrupted me by saying, \"Before you apologize, I want to understand how the relationship between Max and you even started.\"\n\nI started telling him everything. When it came to mentioning my meet-ups, he interjected me and started asking me questions that were difficult to answer. He asked \"So all the times that you were going out you were lying to me about where were you going. Weren't you?\" I nodded. \"What about the times I asked to spend time with you? Did you lie to me so you meet up with Max instead?\" I started tearing up. It was hard being there. \"Did you miss out on events to be with Max? What about my birthday?\" That's when I started crying. He told me to save my tears. He said he figured that out soon after he learned about the relationship with Max. He just wanted to hear it from me. He then asked me if I was still with Max. I told him I was married to him and I have a daughter with him. He seemed to need a minute to process that.\n\nThen he started speaking. He told me he never had an issue with me dating or meeting someone. In fact, he hoped I found love. He understands that I needed companionship and a type of love he couldn't offer as my son. He told me throughout all these years he felt conflicted because both Max and I were both consenting adults and adults have a right to find happiness. My son admitted he shouldn't Max and was glad he didn't press charges. He said despite all of that, they were some things that he can't get over. He told me he can't get over the fact that I didn't take him into consideration when it came to pursuing the relationship. It was also hurtful to realize that I would value a romantic relationship to the point of being willing to throw away a close relationship with him for it. If I had the attitude of being done raising him and finally pursuing my own life, then that's valid, according to him. However, I would have no right to want to have a close relationship with him in return. Again, that's what he said he believes. He told me he wouldn't have forgotten me when he left for college. He would have wanted me to move close to him after he got a job if he couldn't move close to me. In this ideal world we would live close by so he we could still see each other even after he had a family.\n\nHe said he loves himself and his life too much to have back in my life.. My son said he works as a mechanical engineer now. He is engaged to the love of his life. She was also raised by a single mom like him until she was 16 when her stepdad into the picture. Both of them have welcomed him into the family. He told me his future in-laws and his fiance are his family now. He said he was getting a job near them.\n\nHe finally admitted that he just wanted closure before permanently cutting me off. He told me not to contact him or his family at all. He made it clear he wouldn't be there for me at my last stage of life or even come to my funeral. He made it clear he won't even hold my hand when I pass away. I won't have the privilege of knowing his fiance or his future kids. He made it clear that if his half-sister ever contacts him as an adult he'll be upfront on why he doesn't want a relationship with her. He said good bye to me and left. I cried so hard that I got the attention of the people in the coffee shop. I was crying on the way back home. I don't even know how therapy can even help. I never felt so much emotional pain in my life before. What do I do now?",
            "Q_score": 844,
            "Id": "11pfgyz",
            "Url": "https://www.reddit.com/r/Advice/comments/11pfgyz/i_met_up_with_my_son_after_four_years_of_no/",
            "Aswer": "Now, you respect him and move on with your life.",
            "A_score": 1096
        },
        {
            "Question": "Should I feel bad for not wanting to help my parents past age 25?\nMy parents recently told me that they cannot afford certain things and they need help, I live with them and I’m 20 so I help out with bills every so often, I’m the youngest I have an older sister and an older brother who both drained them of money for college, trips, etc. my brother has nothing to do with my parents because they drove him away and my sister works on and off but they don’t expect her to contribute, she also dropped out of college that they were paying for. \n\nI recently started my own business and work full time so I can eventually go to school or fund my business for more return. They know I have a lot of money saved for my future and told me I will have to start helping out because my sister refuses to work full time and make money, they also don’t expect her to pay bills or rent. \n\nThey ended up telling me that i have to pay them money for retirement because they had expectations that the child with the most money will take care of them, I barely started my life and it seems unfair for the youngest child to have to take care of my parents who are mid 60s when I am just learning my way around my personal life and business. I feel a huge burden on my shoulders because they made bad financial decisions and they are expecting money from me to fund their vacations , groceries for everyone , bills , cooking, cleaning etc. im starting to think of moving out but I feel bad because they did give birth to me and take care of me when I was a kid. \n\nI think they should ask my sister (22 f) to help or my brother (30 m), I can’t take on their financial burden as I have to think about my future, I want a family of my own and children.\n\nWhat do I tell them? Do I stand my ground? Do I owe them money for taking care of me? They also let me use one of their cars to go to work, should I buy them a new car?\n\nEdit: these are the type of financial decisions my parents make;\nMy mother spent $500 on designer glasses but she can’t pay for groceries so I have to pick up the slack.\nMy father retired early with no investments just a pension that can barely cover the mortgage and electric bill, he payed for my sisters college and struggles with those bills too.",
            "Q_score": 54,
            "Id": "11pyt67",
            "Url": "https://www.reddit.com/r/Advice/comments/11pyt67/should_i_feel_bad_for_not_wanting_to_help_my/",
            "Aswer": "You never owe your parents anything. You never asked to be born.\n\nStand your ground and let them rely on your other siblings, or like actual adults, they can figure it out.",
            "A_score": 105
        },
        {
            "Question": "In a really bad mood..... What can I do to calm down??\n*Title*",
            "Q_score": 133,
            "Id": "11provd",
            "Url": "https://www.reddit.com/r/Advice/comments/11provd/in_a_really_bad_mood_what_can_i_do_to_calm_down/",
            "Aswer": "I have a punching bag in the garage for my bad moods. Go do something physical. Try running or just smash some empty cans",
            "A_score": 102
        },
        {
            "Question": "I (34F) caught my dad (71M) watching bestiality porn and found lots more in his history.\nMy parents (71M & 69F) are retired but my mother runs market stall of her crafts in our town once a month.\n\nI work freelance and have been abroad for the last years. I am back visiting them for a while and staying with them, I am sleeping in their guest bedroom in the basement where my dads PC also is. My mother is a technophobe, literally never uses a PC, doesn't even have an email address.\n\nI was helping my mum on her stall today, my dad drives her there and picks her up, I came home early because I wasn't feeling very well and went down to the basement to lie down. My dad was in there clearly watching porn and I was like OMG and he scrabbled around to turn it off. I left the room embarrassed and he came out and was angry at me saying that I should be helping my mum and then left the house to go there. I hadnt seen the screen fully but i noticed something absolutely black on the screen with the woman and I got a bad feeling. So I went on the computer and reopened the browser and the tabs were still open and it was all dogs having sex with women. I felt sick and I looked in his history and I found about 15-20 other records of porn in the last 3 months - 100% all of it was dogs having sex with women. All the timing was clearly when my mum is out at her stall.\n\nI think the bad feeling came from this... About 20 years ago when I was 13/14 my dad had some software program called 'Poser' which made 3D rendering of people. Once I came to talk to him while he was on the computer the screen is the opposite to the door but I saw something in the window that looked a dog having sex with a woman really fast as he minimized it. \n\nIt was windows XP with separate accounts his had a password but I saw him write it once and memorized it. I logged into his account and I found LOADS (seriously loads) of 3D rendered images of dogs having sex with women. I felt so sick, I was still a child. I deleted all the images and I uninstalled the program. I think this was my way of letting him know I knew and an attempt to make him stop. I told my sister (then 18F now 39F) about it cause I was really upset but that was it. \n\nThe next time I went on the computer my entire music collection had been deleted from my account as well as my downloading program had been uninstalled. I was pretty annoyed and I complained to my dad about it at dinner in front of my mum he got angry and was like WELL LOTS OF THINGS HAVE BEEN DISAPPEARING OFF THE COMPUTER RECENTLY HAVENT THEY?? I was so shocked by his reaction considering what his missing stuff was and I was a young girl it seemed audacious, I nearly said what is was to my mum but I was just too afraid.\n\nI decided to just leave it and try and try to forget about it. I told myself that at least it wasn't real porn with it in just these cgi cartoony things that don't have proper genitals. He changed his password and I never saw the new one.\n\nAfter catching him today and seeing all his porn choices in the history, I feel sick thinking he has been doing this this whole time since back then?\n\nI just don't know what to think or do. I don't know what to make of it. It doesn't seem like he wants to have sex with dogs himself but just see women with them. Is this a degradation thing? Is this messed up? Is he a secret pervert? Is this misogyny? Fetishism? \n\nI've been trying to look up help online but I only really seem to find stuff about people wanting/having sex with animals themselves - if he was into that would he not watch men have sex with dogs to imagine it is him? \n\nOther than this my dad is really great, he was an architect and is still an artist. He was a fun and warm and playful dad when I was young, he used to drive me to sports clubs all the time. He also warm and fun with my sisters kids now who love him the most out of everyone. I've never heard him say  anything thats made me think he is misogynistic or sexist. He is however very disorganized. My mother has always worked full time as well and she basically has to look after him to keep order. My mother is pretty emotional and can have bad mood swings and get shouty and she organises my dad but also has a go at him about it a lot and she is very dominating and can be belittling of others when she is mad.\n\nI thought when I was young maybe it was some sort of reaction to feeling demasculated (?) by my mum or something. I just wanted to forget cause aside from that I get on with him more than my mum and havent had issues with him, I also havent seen him angry like he was that day at dinner and even today it was unlike him to lash out at me about not helping my mum. \n\nI just don't know what to do. I think if my mum knew she would really go insane and probably chuck him out the house. I think she would be really hurt, it's messed my head up (although I saw it all) and I'm not married to him. They are in there 70s now and have been married nearly 50 years. \n\nI told my sister again and she said she thinks we should confront him but I just don't even know what to say. His previous reactions bother me also. She thinks we should try and get him to get help. She agreed she thinks my mum would be incredibly upset if she knew and it could be life ruining for her and thinks we should avoid telling her.\n\nI said maybe we could seek a professional therapist who specializes in this sort of thing and have a session and ask for advice from them on what to do before confronting him. But as I said I couldn't find anything I felt was appropriate so far, does anyone know of anyone/where for me to look for this issue?\n\nI'm also concerned because I know the possession of bestiality porn is illegal here in UK but I don't know about streaming it. He doesn't use a VPN or even an incognito window as I found the history in his browser. Could he get in trouble?\n\nI just feel physically sick and anxious about it. I wonder what else he might be doing.\n\nAm I over-reacting?\n\nPlease be gentle I've never actually posted on reddit before, I feel too embarrassed to ask friends for help. \n\nThanks in advance",
            "Q_score": 115,
            "Id": "11prqp4",
            "Url": "https://www.reddit.com/r/Advice/comments/11prqp4/i_34f_caught_my_dad_71m_watching_bestiality_porn/",
            "Aswer": "I have got to quit reading Reddit",
            "A_score": 217
        },
        {
            "Question": "Cousin who molested me as a child, just assaulted his sister. She doesn’t want to call the police. Is there anything I could do?\nHe never got any repercussions for molesting me multiple times when I was 6-10 years old, and now he just physically assaulted his sister. They both live a block  away from me. I have a recording of him admitting it on the phone. She doesn’t want to call the police. He’s not remorseful. It’s triggering me really bad that once again he’s not going to be punished. Is there anything I can do, or do I have to just take the L on this one and sit with my anger? Their mom witnessed it, but she doesn’t want him to go to jail. I want him gone from our lives. He’s a disgusting piece of trash person.\nEdit: people are assuming his sister is a child. He is 29, his sister is 31.\n\nEdit again: they were arguing and he grabbed her hair or ear and threw her on the floor. Then he ran to his room and locked the door. I believe he’s still locked in his room and everyone is comforting his sister and their mom, who has a heart condition, and is hysterical since she witnessed it",
            "Q_score": 36,
            "Id": "11pudyx",
            "Url": "https://www.reddit.com/r/Advice/comments/11pudyx/cousin_who_molested_me_as_a_child_just_assaulted/",
            "Aswer": "You can still call the police and made a police report",
            "A_score": 39
        },
        {
            "Question": "My(F19) own siblings(M17 M22) show signs of wanting to sexually assault me\nThis is not my main account for privacy reasons.  \nWe were at the house and my older brother told me to take the trash out, I was angry because of his tone and how he always sounds like he is bossing me around, so I told him he can take it out himslef. He proceded to yell at me and calling me names, my younger brother was also there and they started talking about how I am a b\\*\\*\\*\\* and they also made fun of the way I look and the fact that my ex was ugly and bla bla.   \nI didn't really care about all of this because it's not uncommon in our house (probably the only person who loves me in our house is my mom). but what was really disturbing is that they joked about how they would want to gang bang me so I can 'shut up'. this was absolutely disgusting and creepy  \nI am not making a big deal of this because like 3 months ago I found semen on one of my panties and and don't know which one did that but they both are really trash human beings and can definitely do this.  \nI don't know if I should finally tell my mom about this or if it is even a good idea to tell her. and I don't have anywhere to go.",
            "Q_score": 239,
            "Id": "11pdlkz",
            "Url": "https://www.reddit.com/r/Advice/comments/11pdlkz/myf19_own_siblingsm17_m22_show_signs_of_wanting/",
            "Aswer": "You should definitely tell your mom about what’s going on if you suspect that they will harm you. Brothers should not be saying things like that. Be safe please.",
            "A_score": 432
        },
        {
            "Question": "My sister (F56) is angry with me (F51) for buying my nephew (M18) Plan B, and I've been getting harassed and accused of being inappropriate for it.\nI (F51) live with my husband Brian (M55) only around half an hour away from my sister Lisa (F56), BIL Harold (M55), and nephew Robby (M18). Robby's in his senior year of high school and he's honestly always been a good kid. I love that little brat.\n\nHowever, a few nights ago, I was in the middle of watching cobra kai while Brian was at work. I get a frantic call from Robby. I'll spare the details but he said that he had no money and was in emergency need of Plan B for his girlfriend (F18). He begged me not to tell his parents, and I agreed to it. It's worth noting that he doesn't have a car just yet, and apparently neither does his girlfriend. The kid was freaking out and screaming on the phone, so I took some time to calm him down and reassure him that his future was not ruined and everything was going to be okay.\n\nI went to the nearby CVS and even bought two Plan Bs in case this happens again in the future, and drove down to Robby. My sister and BIL were out for the night, and Robby couldn't thank me enough. I told him not to mention it and also advised him to stay careful in the future. Robby begged me to keep this between us, and I agreed to spare him embarrassment. Unfortunately, I got an angry call from Lisa the next morning, and she had found the other Plan B in Robby's bathroom drawer while she was cleaning the bathroom. She said it was out of line for me to go and do that behind her back, and that I should've told her and Harold. I said that Brian was freaking out and I didn't want to embarrass him or make him feel bad, but Lisa said I was an AH for interfering with her parenting, and that me \"advising him to stay careful in the future\" was an inappropriate thing to say to my own nephew. It's literally gotten to a point where Harold and even a couple of Lisa's friends have been messaging me. I haven't even told Brian about this to keep Robby's word. I wasn't judging him at all, I really was just trying to help.\n\nSince then, I've still been getting messages from Lisa, Harold, and their friends. I haven't responded to a single one, and I even posted to AITA about this before it got taken down. I got a lot of advice on giving Robby the talk, but I'm extremely worried about how inappropriate that's just going to look. But at the same time, I fear that Robby might be uneducated on this stuff, as Lisa and Harold have honestly always been weird about this. Where do I go from here?",
            "Q_score": 38,
            "Id": "11pr42c",
            "Url": "https://www.reddit.com/r/Advice/comments/11pr42c/my_sister_f56_is_angry_with_me_f51_for_buying_my/",
            "Aswer": "Your sister sounds irrational and over the top. I would simply not respond to anything your sister says or does, and not see her until she can apologize. Her son is an adult, and you just saved him from a ruined future.\n\nInstead, I would check in on the adult nephew and see how he's doing and if it all worked out. \n\nIn a few years after this, you will have a nephew who will be on his own and will probably VERY grateful for you, and views you as more trustworthy than his mother. And a sister who either realized you saved her son from having a kid too early, a sister who can forgive and forget, or a sister who shouldn't be in your life.",
            "A_score": 54
        },
        {
            "Question": "Should I not get a silicone \"stand in\" ring to wear in place of my wedding band in active and/or dangerous situations?\nTL;DR I'm ordering a silicone band to wear when I'm exercising and visiting places where theft might be an issue. My fiance thinks this is weird and keeps asking me why I won't just wear my wedding ring all the time. Should I not be getting this \"stand in\" ring?\n\nI'm a 40 something guy getting married for the first time. I'm pretty active, including cycling a lot. I also sometimes go to less than safe places where theft can be an issue. I also cook and often have my hands in foods that may be acidic etc. Finally, I lose things all the time! So I'm ordering a silicone band to wear when I'm not comfortable wearing my wedding ring. Mainly in the situations I just listed.\n\nMy fiance seems to think this is weird. Every time I bring it up he asks me why I wouldn't just wear my ring. I've explained all of the above.\n\nAm I missing something here? Maybe I'm not being empathetic. Any advice as to how I should look at this?",
            "Q_score": 96,
            "Id": "11ph7ff",
            "Url": "https://www.reddit.com/r/Advice/comments/11ph7ff/should_i_not_get_a_silicone_stand_in_ring_to_wear/",
            "Aswer": "This is a very common thing to do. I used to work for zales and I was told to recommend also getting a cheaper silicone type band we offered along with their wedding band if they worked jobs where their ring can get caught on anything dangerous like machinery. Better safe than sorry with the precious wedding band :)",
            "A_score": 215
        },
        {
            "Question": "Can’t control my laughter\nI be talking to my mom and I giggling non stop and I stg she said she’s gonna drug test me came in my room at 2am and I was just giggling at her I can’t talk to anybody without giggling ik yous are gonna think this mad dumb but I’m honest I can’t stop laughing non stop is there a medical reason for that or sum anybody got an idea",
            "Q_score": 101,
            "Id": "11peprw",
            "Url": "https://www.reddit.com/r/Advice/comments/11peprw/cant_control_my_laughter/",
            "Aswer": "If it’s genuinely constant it’s either caused by a neurological disorder or brain injury. Go to your doctor.",
            "A_score": 130
        },
        {
            "Question": "I LOVE eating but need to lose weight. How can I change my mindset and strengthen my will?\n",
            "Q_score": 54,
            "Id": "11pi0sd",
            "Url": "https://www.reddit.com/r/Advice/comments/11pi0sd/i_love_eating_but_need_to_lose_weight_how_can_i/",
            "Aswer": "Eat large volumes of low calorie foods before eating anything else. It limits the damage of high calorie, low volume foods.\n\nNobody ever put on unwanted fat from eating too much steamed broccoli or too many apples. \n\nSimple changes are change white to brown: brown rice, not white, whole sweet potatoes vs white, whole wheat flour (breads, etc.) vs white, etc. The \" brown\" is about the fiber, which is more filling and less calories than the starches. \n\nDon't drink your calories. Don't eat any cheese you can't taste. If you can't tell the difference, don't add it. If you want alcohol, stop with the added calories and sugary mixes. Buy good booze and drink it straight. If you want the buzz, do it on an empty stomach because it takes a whole lot less. \n\nFollow a simple rule: if it's not in the house,  you can't eat it. This holds true for Twinkies and apples. So fill up the house with what you do want to be eating and never with what you don't.  \n\nTreat calories like money. If you went on a shopping spree and over spent, would you say \"fuck it\" and run up all the credit cards and take out a 2nd mortgage? No you would not! Don't do it with it food either. If you screw up, you screw up. Make a plan to minimize the damage and get back on your better eating plan. \n\nWhenever confronted with a menu, make the best choices possible and then enjoy the meal and the company. \n\nYou didn't gain the weight overnight and you won't lose it overnight. \n\nMake a list of 5 things you can do to soothe yourself for at least 30 minutes before diving into [your favorite downfall food here]. Then decide if you still want it. Remember, it shouldn't be in the house, so that means going and getting it. Give yourself every chance for the feeling to pass so you'll know if it's a temporary thing or an actual craving. \n\nThink about every little thing that can help. If you can find 10 things that give you a 10% improvement,  you'll have a 100% improvement. \n\nBe compassionate with yourself.",
            "A_score": 128
        },
        {
            "Question": "Should a married woman (me) be “allowed” to go out dancing with a group of women without her husband?\nA little background info; We’ve been together since I was 13 and married for 10 years in April. I’m 33 and he’s 34.\n\nMy husband guilted me out of going out saying he wasn’t comfortable with it but not because he doesn’t trust me. I rarely do anything besides work, take care of my children and home and visit family. My best friend invited me out for a night of dancing at a local bar. It was her sister’s birthday and 5 or 6 other women were going. He said a married woman shouldn’t be going out without her husband and at first suggested that he go and just “hang out” in the bar. I told him that I thought that would be weird, him just standing in a corner of the bar watching us. He then sent me several pictures of posts where people had asked if their wives should go out without their husband which of course supported his opinion. He also sent me a very long text explaining that he wasn’t comfortable with it. Saying that he doesn’t trust other people and he thinks it’s just wrong for a married woman to go out to a bar where people go looking to “hook up”. I just wanted to go out with a group of ladies to dance.",
            "Q_score": 828,
            "Id": "11oq8g6",
            "Url": "https://www.reddit.com/r/Advice/comments/11oq8g6/should_a_married_woman_me_be_allowed_to_go_out/",
            "Aswer": "I literally shook my head after reading the title. This really shouldn't really even be a question. Everyone deserves a night out w/ friends.",
            "A_score": 1228
        },
        {
            "Question": "Taking his daughter’s kidney\nI have a friend who is in the middle of renal failure. Dialysis has gotten him this far. His daughter is a match, and wants to give him her kidney. \nHe wants to take it, but has so far refused.  He keeps saying that he can’t take his little girl’s kidney. \nWhat in the fuck should I tell him? He called me and talked to me about it. But how am I supposed to either tell him to take his daughter’s kidney, or not to and he’ll probably die without it. Never seen him cry before, but I just heard it over the phone…",
            "Q_score": 229,
            "Id": "11otfm5",
            "Url": "https://www.reddit.com/r/Advice/comments/11otfm5/taking_his_daughters_kidney/",
            "Aswer": "I gave my Dad one of mine. He didn't want to take it but did in the end.  He woke up from the op looking and feeling a million times better straight away. I've never regretted the decision. He got 6 years longer than he would have done, something unrelated got him in the end.",
            "A_score": 359
        },
        {
            "Question": "I'm being forced to betray 1 of my 2 best friends.\nso basically, i have 2 best friends, a girl (Maddie), and a guy (Aiden), both of them have had many relationships and aiden is a player and doesn't really do relationships, Maddie is a huge lover, she's been \"attached\" to him for over a year now, she's absolutely obsessed with him, she's cried, screamed, even self harmed over him, she knows he doesn't like her at all but still says \" we're meant to be \" and all that stuff, he recently told me that he honestly hates her guts and is just playing her, and she doesn't know, i either tell her about it all and betray Aiden because i had promised to never tell anything he tells me to anyone, or let it be and let Maddie get hurt, what should i do?",
            "Q_score": 153,
            "Id": "11ovcms",
            "Url": "https://www.reddit.com/r/Advice/comments/11ovcms/im_being_forced_to_betray_1_of_my_2_best_friends/",
            "Aswer": "Well Aiden is a huge asshole here so you should do the right thing and protect Maddie. And maddie needs to quit with the \"we're meant to be\" nonsense because she's being delusional and setting herself up for disappointment. \n\nYour friends suck but this shouldn't be too hard. If you have to pick between the asshole and the victim, protect the victim.",
            "A_score": 322
        },
        {
            "Question": "is it offensive to say hats off to you\nthere was a guy jogging near me and i said hats off to you and then he jogged away and then he came back to me and shoved me into a wall and said \"hats to who?\" and i explained i said it to him to support him and he walked off. im wondering if this is offensive he was black and i really didnt mean anything by it but it did scare me alot as ive been in hospital recently and have almost no muscle s i couldnt push him away or anything.",
            "Q_score": 49,
            "Id": "11ozb3t",
            "Url": "https://www.reddit.com/r/Advice/comments/11ozb3t/is_it_offensive_to_say_hats_off_to_you/",
            "Aswer": "Not offensive at all. His fault for getting so angry. He might’ve had earbuds in and didn’t hear you correctly. Sorry you were scared",
            "A_score": 115
        },
        {
            "Question": "Are any teen moms, dads, or parents, in general, able to advise me on caring for a baby at 16?\n# I got my girlfriend pregnant and she doesn't want an abortion but neither do I. Im gonna be 16 in about 2 weeks so I can get a decent amount of jobs but pretty low pay. I don't know how my mom is going to react, she could kick me out but I'm not sure. Would it be better to move in with my GF and care for the baby or stay with my mom? I also need help knowing what I need for a baby. ",
            "Q_score": 555,
            "Id": "11oelh3",
            "Url": "https://www.reddit.com/r/Advice/comments/11oelh3/are_any_teen_moms_dads_or_parents_in_general_able/",
            "Aswer": "I'm 30 now. But when I was 17 my girlfriend and I got pregnant. We opted for adoption, my father knew of a couple who wanted but couldn't have kids. They were super awesome, well off, amazing jobs. Needless to say the kid was going to be set, better off than i ever was and I was raised middle class. They paid for all the hospital expenses, pampered her, let us stay at their house. It was the best option for us at the time, cause neither of us felt right getting an abortion, but knew we weren't ready to be parents. Flash forward to now, that girl and I broke up more than a decade ago, good riddance honestly. I met my NOW wife a few years after the break up, we have two boys, and life is good. Parenting is hard, I do not regret what we did and the choices we made. The way our relationship went after the adoption was horrible. She cheated, manipulated, tormented. The true colors showed once we were out of high school and got to expirence the real world. Just weigh your options man, think about your future self. Good luck and hope you the best.",
            "A_score": 916
        },
        {
            "Question": "(Update): My ex-bestfriend, who is married to my ex-husband hired me to make a cake for her son's birth.\n Hi, guys. I have read your advice and suggestions. You all made some really good points. So, I decided to talk to my mom about it. I just needed her insights about this matter. She told me I should do what I want to do. My boyfriend also encouraged me to take the order. He says that if I had to stay to organize the dessert table he would be there for me. I took the order. And it turns out, it was my ex husband’s idea to hire me. Because one of his colleagues recommended my services to him. And it was sort of short notice so I had to rush this. Anyways, I kept it strictly about business. I did take the payment in advance just like some of you have mentioned. I always ask for advance payments. I mostly maintained communication through email. I have an assistant who is also a family friend of mine to handle all communications. My ex-bsf tried many times to meet with me in person, but I told her to just email me because I do have cake orders for other people too. I only had to meet her 1 time in person regarding the order. She sent me the details of the party over the email. \n\nAnd like I mentioned it was a huge order. I didn’t just have to make a birthday cake for the baby (it is pokemon themed). There were also cake pops, cupcakes and macarons. Luckily, I had my friend Marie over for some help (yes, I did pay her). So, like usual I went to deliver the cakes and other stuff for the party. There was already a table set at the venue. My boyfriend, Josh (35M) came with me to support me and to keep me away from my ex-husband and ex-bsf as much as possible. As I was busy with myself, my ex approached me and said hello. Ngl, seeing him after so many years my heart just stopped. This man has given me the worst pain you could possibly give to a human. I am glad I held my composure. I also said hello back. He tried to have a small talk with me by saying that he is sorry about how things went down and what he said and also I looked better than the last time he saw me. Then he drops a big bomb, he said all these years he has thought of me, wondering what I was doing even though he is happy with his married life. I was silent. I didn’t say a word. He just kept spewing that he misses me and my cooking. My homemade french onion soup is still his favorite. He misses that every time he gets sick with a flu. I didn’t know what to say. At that moment Josh noticed that my ex was making me uncomfortable and he rushed towards me with a fake emergency. He asked if I was ok, I said yes. \n\nAfter the table setting was done, I was about to leave, that’s when I saw my ex-FIL along with other guests. He noticed me and came to give me a hug. My ex-FIL is a very humble man. In fact he was the only man who was on my side when I was going through a divorce with his son. He looked really happy to see me and asked me how I was. He started to chat with me. I talked to him about my business and he gave me some advice. He even talked to my boyfriend. He called Josh a “pretty standard guy” (whatever that means). Ex-FIL was nice and said he would suggest my services to his friends too. He insisted that I stay until lunch is served. I said no a couple of times but he managed to convince me. I only stayed for 1 more hour or so. But I was fine. I did notice that my ex-bsf was eyeing me from the corner. I was fine because Josh was beside me the whole time. I chatted with some guests. They appreciated my service. I didn’t have any more conversations with my ex. I didn’t even stay for the cake cutting. I left the first chance I got but my assistant stayed to make sure everything was fine and for the clean up. \n\nIt was overwhelming for me. I saw some of my old friends and my in-laws. My MIL avoided me and some of my old friends just said hello. Later that day I got a message from my ex-bsf on my work email that she liked my service and that her guests really liked my cakes and desserts. She also said sorry. That’s not where it ends. I got to know from my friend Marie, who is still in contact with some of my old friend group that my ex-bsf is not happy with her marriage. When my ex and her are in public they would often fight a lot. They also fight on the day of their kid’s birthday. Tbh I just told her to not bring me the gossip about her. But the silver lining is I got a huge fat check lol. I can finally buy a new sugar printer or maybe a good quality oven. Also, I just want to appreciate my boyfriend Josh. He has been incredibly supportive of me. He has protected me from my ex and ex-bsf like a knight. I think he deserves his own cake from me. 😉 And I know a lot of you told me not to take it. But I guess I am just a greedy Mr. Krabs who cares more about the money rather than being classy hehe. But this is the last time I will be taking any orders from them. I know they have a 3 yr old daughter whose birthday will be in 2 months. I think they might try to hire me again. I will not take it if that happens. \n\nP. S. Yes my ex-bsf did try to communicate with me during the party but I managed to avoid it thanks to Josh and my ex-FIL. My ex-FIL knows about my situation and my discomfort with my ex-bsf. He kept me busy with small talk.",
            "Q_score": 222,
            "Id": "11oj5ek",
            "Url": "https://www.reddit.com/r/Advice/comments/11oj5ek/update_my_exbestfriend_who_is_married_to_my/",
            "Aswer": "Your bf needs his favorite cake mad stat. He deserves 2 cakes.",
            "A_score": 109
        },
        {
            "Question": "3 missed periods\nI’m a teenage girl, i’ve had regular periods for around 6-7 years and suddenly i’ve missed around 3. i’ve had no of my pre period signs and i’m not really sure if this is something to be worried about. \n\nis it worth bringing up to my parents/doctors or anything?",
            "Q_score": 26,
            "Id": "11owpsp",
            "Url": "https://www.reddit.com/r/Advice/comments/11owpsp/3_missed_periods/",
            "Aswer": "Absolutely. A simple blood test to at least find out what your hormonal are doing is in order. \n\nIf you've been sexually active, a pregnancy test will needed too.",
            "A_score": 71
        },
        {
            "Question": "Hidden Cameras—should I warn my sibling?\nMy sibling (in their late 30s) is moving in with one of my parents due to mental health issues. My parent has hidden cameras in their home due to their own mental health issues, and has used them to surveil people (myself included) who were temporarily staying in their home to take care of pets and such while they were out of town. Should I warn my sibling that they are there? I felt very violated after the fact when I found out, and since my sibling deals with paranoia and psychosis, I worry. On the other hand, my sibling has no where else to go and I don’t want to drop that information in their lap because I don’t want it to exacerbate their challenges. \n\nI have a complicated (read: bad) relationship with this parent so I’m conscious that this could read as shit stirring. Any help is appreciated!",
            "Q_score": 61,
            "Id": "11onwqm",
            "Url": "https://www.reddit.com/r/Advice/comments/11onwqm/hidden_camerasshould_i_warn_my_sibling/",
            "Aswer": "I would let them know for sure",
            "A_score": 108
        }
    ]
}