{
    "Posts": [
        {
            "Question": "Someone here gonna have to explain what I said wrong?\nSo Prom was a few days ago and I starred talking to this girl and we rly got along and we’re genuinely having a good conversation and it was going well, one of her friends even came over and said they were going and she responded back to her friend “give me a few more minutes” and we continued talking for about 10 more minutes then Prom ended and I got her snap\n\nWe were snapping back and forth for a few days with just random pics then I texted her “Hey” and she texts back “Hi” and then asked her “So what type stuff u into” and then checked my phone a few minutes later and she had blocked me, ima need someone to explain what happened here because I clearly missed something, because I thought things were going pretty good and that we both liked each other",
            "Q_score": 70,
            "Id": "123c6ph",
            "Url": "https://www.reddit.com/r/Advice/comments/123c6ph/someone_here_gonna_have_to_explain_what_i_said/",
            "Aswer": "She obviously thought you ment what sexual shit she's into. And honestly, by how it's written here, I would have too.",
            "A_score": 168
        },
        {
            "Question": "Accidental date with boss. What to do!?\nHello, I need some advice on what I am going to do next. Last night I went out to a concert with my boss. I thought we were going as mates. Boy! was I wrong! He treated it as a date. Full on, Full Blown date. He opened the car door for me. Tried to lean close to me. touched my leg but never lingered. Took me out to a meal at the end. Gave me flowers at the start.\n\nI just thought he wanted a friend to go to the concert with. The concerto was really nice. Classical music.\n\nHe has a wife that I work with. Who is also my boss? How in blazes am I going to move forward?\n\nEdit: I also have a boyfriend. Whom he met. My boyfriend is in a different city. He knows everything. But It is just shocking that my boss would do something like this.\n\nEdit: I also don't think getting a new job would be too variable. I have been at this company for less than a year. This is my first job working in my role. The majority of the positions I see online say at least 2years of experience as a requirement.\n\nTalk to HR? There is no HR, it is a small company with less than 15 employees.\n\nEdit: But I will see what I can do about a new job.",
            "Q_score": 597,
            "Id": "122l4u4",
            "Url": "https://www.reddit.com/r/Advice/comments/122l4u4/accidental_date_with_boss_what_to_do/",
            "Aswer": "If he asks you out again, say you had a wonderful time, but you don’t want anyone to get the wrong idea about you both since you value your professional relationship. If he won’t back off, document everything.",
            "A_score": 915
        },
        {
            "Question": "Am I being groomed?\nAlt because he knows my main\n\nI (F15) recently got messaged through Reddit by a guy (M28?). It was on a post asking for relationship advice I won't get into as its not relevant. he messaged me saying \"Aye beautiful hru I'm dj\". He started off respectful for the most part asking how I was doing after what I said in the post. He then randomly asked if I had sex with my boyfriend, how big his dick was then bragged about having a 10 inch dick then sent a pic with no warning. He asked if I was turned on from the pic and asked for nudes but I ignored it then he blew up at me (I couldn't respond as I was practicing driving). I've been through similar situations before by men at my church so I'm afraid of making a wrong move, that's why I came here.\n\n I'm afraid to talk to my mom about it as she blamed me for my rape trauma, and my father isn't in the picture. \n\nAs I'm typing this he's blowing up my phone trying to guilt trip me and I'm afraid of what he can do. He knows what I look like but hopefully nothing else.\n\nI apologize if this is messy, a lot's going through my head.\n\nTLDR: 28y/o guy messaged me 15f asking for nudes and sex",
            "Q_score": 166,
            "Id": "122tbda",
            "Url": "https://www.reddit.com/r/Advice/comments/122tbda/am_i_being_groomed/",
            "Aswer": "He’s committing a crime.  Think about this logically — no good relationship has ever begun with a fully grown adult messaging a teenager about sex.\n\nKnowing what you look like doesn’t matter. As long as he doesn’t know where you live, there’s nothing he can do. He’s probably hundreds of miles away.  Even if he knows your town, he can’t find you.  Even if he knows your address, it’s unlikely he would actually get on a plane and come to where you are, which would 100% get him arrested.\n\nHe’s a random internet creep, block and move on.",
            "A_score": 376
        },
        {
            "Question": "I feel so heartbroken. Person I thought I’d be in a relationship with decided he just wants to be “friends”\nI don’t know why I’m so heartbroken. We weren’t even technically dating. We flirted a lot, went on a couple of dates, and exchanged a kiss or two on the cheek once\nor twice. Just when I thought things were going well, he messaged me saying he just wants to be friends. \n\nTo his credit, he did recently come out of a long-term relationship with someone else. So in a way, I understand if he’s not emotionally ready. But I also feel a little lead on. I just wish he would’ve told me before all these dates that he wasn’t ready.",
            "Q_score": 30,
            "Id": "1236sbp",
            "Url": "https://www.reddit.com/r/Advice/comments/1236sbp/i_feel_so_heartbroken_person_i_thought_id_be_in_a/",
            "Aswer": "I say cut contact. Being friends is  not possible.  It will only make you sad.\n\nBest to say good bye. In time you will get over him. If you keep in touch,  you will not be able to move on.\n\nTime heals.",
            "A_score": 31
        },
        {
            "Question": "Looked through girlfriend’s search history\nHi all, just want to start off by saying I know I'm wrong for taking advantage of my girlfriend's trust to use her Google account to use as access for one of her logins.\n\nI couldn't help but look through her search history - one of the searches was \" have a crush on my friend but I already have a boyfriend\" which was a search from January. I'm not panicking because I am the \"friend\" in question since this search was before we got together (we’ve been together since February) and I know she recently broke up with someone else.\n\nThe only problem is that she told me she broke up with him in November. I can't confront her about this because she'll know I looked through her history. I'm still deciding whether I should confront her or not. \n\nShe never usually lies to me, and when I asked if she was sure she broke up with him later she reassured me it was in November.\n\nI don’t want this relationship to end because I love her a lot. I just want to know why she lied about breaking up with him later than she told me. \n\nWhat should I do?\n\nEDIT: I should also mention there was another search titled “why am I pulling away from my boyfriend when he kisses me?” And “why does my boyfriend never want to kiss me?”  that was also from January .Why would those searches be there if she wasn’t in a relationship?",
            "Q_score": 206,
            "Id": "122mwkm",
            "Url": "https://www.reddit.com/r/Advice/comments/122mwkm/looked_through_girlfriends_search_history/",
            "Aswer": ">I couldn't help but look through her search history \n\nWell your first step should be to take ownership of your behavior. You absolutely COULD have helped invading her privacy. You CHOSE to do so. You've been together less than 2 months. Sit and think why you felt entitled to go through her search history, why you feel insecure, and focus on what you can do to rectify that. Also, you should tell her what you did.",
            "A_score": 619
        },
        {
            "Question": "Should I ruin my relationship with my sister to help my mother?\nI don't know what to do... For about a year, my mom and big sister has been in a huge feud. Basically my mom sent quite a sum of money over to my sister's account, because of some early pension stuff. \nA huge feud began and now my mom wants the money back in full. However, my sister refuses to pay back the full amount rn. My mom has tried everything, and now they can't speak together without screaming at eachother. \nMy mom wants me to go to my sister, demand she pay back the money, or my mom will take it to the court of bailiffs. I love my sister, dearly, even though I know she has done wrong in many many ways. But I know, if I do as my mom has said, it will ruin my relationship with my sister, and my nieces/nephews. \nWhat would you have done? Chosen a side or...?",
            "Q_score": 50,
            "Id": "122yhul",
            "Url": "https://www.reddit.com/r/Advice/comments/122yhul/should_i_ruin_my_relationship_with_my_sister_to/",
            "Aswer": "I think it is wrong of you mother to involve you. This is not your business. Refuse to meddle",
            "A_score": 160
        },
        {
            "Question": "Career Advice\nI have been working for Doordash about a year and a half now. I make $900-$1,000 per week after expenses, tax, gas, and food. I work 7 days a week so that means I don’t have time to spend any of the money I make so that basically means I save $900-$1,000 per week. Last year I bought a 3-plex in my hometown right near main street and moved into one of the apartments. The two other apartments cover my mortgage which basically means I pay no rent. When I’m working, I stay home in between orders and play video games. When I get an order, I pause my game, go deliver the order, then come back home. It’s the best job I ever had, and it’s the most money I’ve ever made. I’m 22, guy, degree in pre-med (dropped out of university), no special experience in any sector of employment, basically a nobody. \n\nBut here’s my quandary, right. My family has a hard time to wrap their heads around my job. Actually, they don’t even consider it a real “job”. So they offered to pay for my schooling if I went and got a DEP in something. I’m not complaining, it’s very generous of them, so I told them I’d get a DEP in electricity, signed up, got admitted, and now I start my course in about 3 months. The thing is, I keep having second thoughts about it, but I don’t want to pull out because it’s kind of a recurring joke that I never finish what I start and always reverse course last minute. It’s just that I love my job and I’m making good money but at the same time I do agree with them that getting a “real” job (electrician) would be to my benefit. I don’t know, what do you guys think? What would you do?",
            "Q_score": 24,
            "Id": "1233gn7",
            "Url": "https://www.reddit.com/r/Advice/comments/1233gn7/career_advice/",
            "Aswer": "Does Door Dash provide benefits?   Sometimes it’s worth a pay cut for stability, health insurance, paid time off and a matching 401k.   \n\nIf a career in electricity doesn’t spark your interest, don’t do it.  Don’t do something you don’t want to do to please your family.",
            "A_score": 19
        },
        {
            "Question": "My dads using my computer to look at porn.\nJust as the title says. Im 15, and i play a lot of video games. I have a PC, and today i was watching some horror movies (pretty messed up stuff) and went to clear my browsing history cuz the title of the movie was weird and saw some stuff i didnt expect. I let my dad use my pc to look at his emails and stuff since he doesnt have one and doesn’t want a mobile phone, he was looking up porn and nude photos. Its made me feel really uncomfortable knowing he’s looking at this stuff in MY room on MY computer while im out or at school. Is there any way i can bring this up to him without it being weird?",
            "Q_score": 71,
            "Id": "122nibl",
            "Url": "https://www.reddit.com/r/Advice/comments/122nibl/my_dads_using_my_computer_to_look_at_porn/",
            "Aswer": "You should probably just put some type of XXX blocker extension on your browser. Then you won’t have to bring it up to your dad (which no matter the way you do it, it will be weird).",
            "A_score": 111
        },
        {
            "Question": "How do men feel about OnlyFans / only fans girls?\nPretty much what I said above. I’ve been wondering how regular men feel about onlyfans and girls who do it. I’ve been thinking about making one and opened an account but I’m hesitant. Do you guys have interest in onlyfans or would ever date a girl on onlyfans. I’m afraid it’s an unattractive way to make some money. Let me know your opinions",
            "Q_score": 224,
            "Id": "122dp88",
            "Url": "https://www.reddit.com/r/Advice/comments/122dp88/how_do_men_feel_about_onlyfans_only_fans_girls/",
            "Aswer": "Generally, I don't care. Personally, I wouldn't want to be with them. I don't feel comfortable with someone meeting my partner and paying $9.99 to see her naked and get dirty messages 15 seconds later. She's free to do whatever she wants and I'm free to be with someone I'm comfortable with.",
            "A_score": 916
        },
        {
            "Question": "My mother left me, and I have nowhere to go. Over a goddamn argument, she left me. I work 2 small jobs and I barely get payed 250 a month. What do i do, and where do i go? My mother is toxic, and she expects me to sit outside and bawl my eyes out.\n",
            "Q_score": 77,
            "Id": "122gmjt",
            "Url": "https://www.reddit.com/r/Advice/comments/122gmjt/my_mother_left_me_and_i_have_nowhere_to_go_over_a/",
            "Aswer": "At 17, you are legally still a child. What your mother has done is called child abandonment. \n\nCall Child Protective Services in your area. They will act rather quickly to ensure you find safety and security.\n\nIt may seem scary involving legal authorities, but it is necessary to get the help you need and for your mother to be held accountable for her actions.\n\nMake no mistake, her actions are abusive. This is mental abuse, emotional abuse, and ultimately, child abuse. \n\nYou have a right to access safe shelter, food, education, etc. CPS will ensure any adults who can be held liable, will be.\n\nIt's going to be okay.",
            "A_score": 125
        },
        {
            "Question": "My HS bully died, and I am conflicted as what to add, if anything, to his memorial post on FB.\n",
            "Q_score": 549,
            "Id": "1221hzy",
            "Url": "https://www.reddit.com/r/Advice/comments/1221hzy/my_hs_bully_died_and_i_am_conflicted_as_what_to/",
            "Aswer": "Why would you need to put anything? They won't see it, only their grieving family will. \n\nUnless you've truly forgiven them and can post without bitterness or rancour, steer clear. If you still have some trauma, it's a valid reason not to write flowery niceties. You owe them nothing.",
            "A_score": 2229
        },
        {
            "Question": "Gf got mad someone put their name in a raffle don't know how to deal with this.\nGF sent our neighbors and a friend out for grocery shopping with our money, the grocery was doing a give away where if you purchase a certain item you get to take part in a raffle but you need a membership card to join. \n\nNone of our neighbors had a membership card but our friend did and wrote down his info. \n\nWhen they arrived back home now Gf got mad because one our neighbors allowed it to happen while the other said that if he wins he would just share, Gf got upset and gave my neighbor and friend a stern talking too. How do I deal with this?",
            "Q_score": 333,
            "Id": "12250q7",
            "Url": "https://www.reddit.com/r/Advice/comments/12250q7/gf_got_mad_someone_put_their_name_in_a_raffle/",
            "Aswer": "I don't even understand what there is to be upset about??",
            "A_score": 659
        },
        {
            "Question": "I accidentally found out my coworker is a s** offender\nI have a coworker who we will call Sam. Sam does not work in my department but we've worked on a few projects and committees together. He's a few years older than me (im 30f) and has always made me a little uncomfortable because he's just kind of an awkward guy. I've also heard rumors about him watching explicit material on his phone at work. Recently, Sam has started making it known that he wants to come work for me in my department and has been looking for ways to help out on projects. He's been sending me emails and asking for info about projects I'm working on, and I'm not comfortable sharing with him.  I did a Google search on him to creep on his social media pages and ended up discovering he is a registered s*x offender for crimes against children.\nI'm so uncomfortable and I don't know what to do. All this aside, Sam does not have the skills or qualifications to work in my department, so I would never hire him anyway. But I want him to leave me alone. We have a great HR department, should I bring this up with them?",
            "Q_score": 543,
            "Id": "121oikc",
            "Url": "https://www.reddit.com/r/Advice/comments/121oikc/i_accidentally_found_out_my_coworker_is_a_s/",
            "Aswer": "Business is business. He’s not qualified. That should be the end of it",
            "A_score": 677
        },
        {
            "Question": "Should I cover my tattoo around my friend?\nI got a tattoo last December as a birthday gift, it's of a crow perched on a branch on my right upper arm, by my shoulder, and I'm so happy with it. A few days after I got it, I excitingly showed all my friends of it who all but one loved it. The one who didn't love it physically backed away while repeating \"no, that's not real\" like he was in a nightmare. He fathered me over it, telling me it was permanent. I showed my dad it and he was so happy for me and asked questions about it.\n\nFor reasons I won't go into, I usually wear baggy shirts with sleeves that hide my tattoo, it isn't because of the tattoo though.\n\nI recently saw that friend and I was wearing a shirt that slightly revealed the tattoo, he lifted my sleeve up and muttered \"still can't believe you have that\". I asked him why he's reacting like this and he said it's because he's against tattoos. I'd understand if this was his sibling or partner but not me.\n\nShould I cover up my tattoo to make him comfortable each time we meet up?\n\nETA - 1. Spelling mistake fixed. 2. Thank you for everyone who replied, I'm going to stick to what I wear because I love my tattoo",
            "Q_score": 86,
            "Id": "1221mqk",
            "Url": "https://www.reddit.com/r/Advice/comments/1221mqk/should_i_cover_my_tattoo_around_my_friend/",
            "Aswer": "Nope! You're going to run into a lot of judgmental busy bodies who want to opine on how you should live your life. Take this as practice for standing up for what you believe in. Let him know you are no longer interested in his opinion about it.",
            "A_score": 199
        },
        {
            "Question": "Pregnant and need advice.\nHi. I am a 27f who is single and found out 3 days ago that I am pregnant by my long time on and off (34m). I have been in shock and reeling the last few days, because I was on birth control as well as took a plan b after we had sex the last time. We live about an hour away from each other, and he has a daughter who is about to turn 3. I didn’t tell him for a couple days due to being in shock, I never saw my first pregnancy playing out this way and it’s been a lot to process. We talked today and he says he thinks we should get an abortion because we don’t live in the same city, he can’t leave his current daughter, and job etc. i am having a really hard time making a decision. On one hand, I feel like I should get an abortion but that is something that would haunt me for the rest of my life, as I am not 17 anymore and am able to own up to my shit. It feels like a selfish decision at my age. I feel like if I keep it I should have him sign away his rights and do this completely on my own, I have a support system who loves me. I have never felt more alone, and I could really use some advice or just someone to tell me what to do. Please leave the judgment out of any comments this is the hardest thing I’ve ever been through.",
            "Q_score": 53,
            "Id": "12257zf",
            "Url": "https://www.reddit.com/r/Advice/comments/12257zf/pregnant_and_need_advice/",
            "Aswer": "For starters, take a deep breathe and slow down for a second. You’re going to be ok. Said so yourself; you aren’t 17yrs old and have a support system. \n\nNext up: PREGNANCY IS NOT A PUNISHMENT FOR HAVING SEX. You said you can “own up to your shit”; this isn’t really you causing a mess of shit in your life, though. You were on birth control (and Plan B), and it failed for whatever reason. It’s an accident. It happens because that’s generally what happens when people have sex; someone gets pregnant. \n\nAsk yourself: do you WANT to have a baby now? Fuck whatever sperm-donor over there says - especially the part about “WE should get an abortion”. HE faces no physical consequences of his ejaculation. YOU do, and if you choose to go that route, YOU will be having the abortion, not him. It’s easy for him to go to this conclusion quickly because he’s not the one facing the consequences of such a decision, you are. \n\nSo, circle back around: DO YOU WANT TO HAVE A BABY? You said you are financially able to support having a baby. You said you’d have him sign away his rights (which does not mean he won’t be paying child support, by the way; he’s still financially on the hook for this), and handle things on your own. Ok, so you have the rest of the boxes checked, but do you WANT a baby? That’s entirely up to you, and you’ll get no judgement from me (pro-choice here, for the record).\n\nMy advice: take some time to really reflect on if you are really ready for a baby. See the doctor, and gather your inner circle for support. In most places, you have up to 24 weeks pregnant to obtain an abortion. \n\nGood luck to you.",
            "A_score": 114
        },
        {
            "Question": "Not sure how to reply\nFor a bit of context I told a girl i liked about how I felt in a couple heartfelt messages. I don’t know how to respond with the way she did: “Thanks for the message, sorry yeah no.” Anyone got any ideas?\n\nEDIT: I thank you all for the assistance. At the time of the post I was still angry at myself for coming on too strong. I have since realised I was in the wrong and I regret my actions. My reply was “cheers for being straight forward and I hope you are well.”",
            "Q_score": 203,
            "Id": "121rn7b",
            "Url": "https://www.reddit.com/r/Advice/comments/121rn7b/not_sure_how_to_reply/",
            "Aswer": "“Ok thanks for letting me know”\n\nAnd then you just move on",
            "A_score": 561
        },
        {
            "Question": "My mom disapproves of shaving.\nI (13m) tried to ask my mom if I can try shaving because I am quite hairy. But my mom said no and stated that it would just grow back thicker and longer, what should I do?",
            "Q_score": 33,
            "Id": "12259vu",
            "Url": "https://www.reddit.com/r/Advice/comments/12259vu/my_mom_disapproves_of_shaving/",
            "Aswer": "It’s a myth that it grows back thicker and longer. I think you are at an appropriate age for shaving legs, arms and pits but maybe your mother isn’t. Try asking her what age she feels is appropriate.",
            "A_score": 85
        },
        {
            "Question": "My neighbor has been in the shower for like 4 or 5 hours\nSooo pretty much as the title says. I live in an apartment and the neighbor’s upstairs bathroom is right on top of mine so I can always hear when they run their shower/bath. Their water has been running for like legit 5 hours. No sign of flooding though (it would’ve spilled down to my bathroom). Should I like call maintenance or somebody or something? Thanks!\n\nUPDATE: Sorry for the delay, after contacting police I fell asleep and it took them like a few hours to even come out and check. Neighbor is fine, they (for whatever unknown reason) left the shower on and left the house. They’re not elderly, but may be mentally unwell. \n\nAnyways, shower is off now and it ran for a total of like 10 hours. Weird shit and complete waste of tons of water I’m water. Thanks for everyone’s advice and concern",
            "Q_score": 1237,
            "Id": "121807h",
            "Url": "https://www.reddit.com/r/Advice/comments/121807h/my_neighbor_has_been_in_the_shower_for_like_4_or/",
            "Aswer": "Yeah I’d call a property manager. Sounds like a welfare check may be needed",
            "A_score": 905
        },
        {
            "Question": "How do I make a meal in a college dorm\nI need food ideas because I'm basically starving, I'm not allowed to have a hot plate, toaster, air fryer, etc. I have a microwave, minifridge, and an electric kettle, but that's all that's allowed. I have IBS and the food at the dining hall is really messing with my stomach, I can't do a lot of soy, which *everything* has soy in it, and I'm allergic to tree nuts and stone fruits, so I can't eat a lot of there vegetarian or vegan options, and I don't eat pork, which is the meat they mainly serve. \n\nI'm at a loss because I would be okay if I was allowed to cook, but I have no idea how to make food that doesn't require a stovetop, baring microwaving soup or ramen.  Does anyone have any ideas?",
            "Q_score": 68,
            "Id": "121tjek",
            "Url": "https://www.reddit.com/r/Advice/comments/121tjek/how_do_i_make_a_meal_in_a_college_dorm/",
            "Aswer": "Microwaveable packets of rice, quinoa etc, cans of beans or microwaveable chicken pieces, chopped up veggies that you can eat uncooked and some kind of cheese or dressing makes a good meal in a bowl.",
            "A_score": 95
        },
        {
            "Question": "Being pressured to buy my first home for my grandparents\nI'm 23 years old, currently living at home with my family, which includes my grandparents (in their late 80s) who live in our finished basement. My grandparents have been giving rent money to my parents from their pension ever since they bought the house. In recent years, my mother has been cooking for her parents, and also helping my grandmother with more tedious tasks (cleaning, etc.).\n\nAfter working full time this past year post-graduation, I feel confident I could buy a small property.\n\nI had been debating whether I should live in that property and pay off the full monthly mortgage OR rent it out to tenants who would pay off the big bulk of my payments.\n\nRecently, my mother approached me saying that maybe when I've saved up enough, I should buy a small townhouse and have my grandparents live with me. My grandparents would then give me rent money that I would use to pay off my mortgage, and I would be able to help them out in case of emergency. My mother would be stopping by frequently and bring food as well.\n\nThe thing is that I don't know how to feel about that. I wanted to buy a house that I would be living in either by myself or to rent out while staying at home. I always figured that my first \"big\" home purchase wouldn't be until I get married and start a family.\n\nWhile my mother is not forcing any of this burden on me, the fact that she asked me makes me feel bad for not being totally on board with it. I want to help my grandparents and my mother out, especially since the basement has had a lot of heating issues. I don't want to regret not helping out my family, but at the same time I don't want to regret spending my early-mid 20s as a caretaker for my grandparents as roommates.\n\nMy cousins, who live far away, are living their lives, either living with roommates in an apartment/townhouse or newly buying property where they live alone or with their partners. It bothers me that I get the \"short end\" of the stick, and while I can still go out on weekends and see friends, having my grandparents more close with me (and likely needing me) makes things complicated. Again, I have the final say and I'm not being forced. But I don't know how I could ever tell my mom or my grandparents that i can't do that for them (if that's what I choose).\n\nI really want to help my mom with her parents, but I don't want to sacrifice my 20s either. What should I do?",
            "Q_score": 22,
            "Id": "121u916",
            "Url": "https://www.reddit.com/r/Advice/comments/121u916/being_pressured_to_buy_my_first_home_for_my/",
            "Aswer": "So basically she wants to dump her parents on you.",
            "A_score": 47
        },
        {
            "Question": "My boyfriend constantly tells me he’s going to “slip up” and have sex with another woman if I don’t give him any, what should I do?\nI’m (21) f and he’s (26) m and his sex drive is absolutely ridiculous.  He always tells me how important sex is for men and how they can’t function without it. I can’t see him as much because I’ve been working a lot and I also go to school part time. He barely works and always have time on his hands. Just laying in his house. \n\nAs soon as he gets sexually frustrated he starts with his nonsense. Yesterday he told me “there’s a lot of girls that’s been asking me (to have sex) but I’ve been turning them down, imma end up saying yes.”  \n\nMind you, I’ve been having his back while he’s been down and out. Buying him food, giving him money, being a shoulder for him to cry on. \n\nIs this sexual manipulation? What should I do?\n\nEdit: I just wanted to add that our most recent argument was because I’ve recently got over a really bad illness that left me sick for two weeks and bedridden. And he immediately started threatening me with the cheating. He told me that a women would never let her man leave the house sexually frustrated.\n\n\nUpdate: I’ve broken up with him! I sent him a text telling him how I felt about everything and I used some of the stuff you guys said. I blocked him on every single social media site including regular phone. I want thank you guys for all your support and patience. You guys really helped me a lot today. I’m  going to take time to just heal and worry about myself. ❤️",
            "Q_score": 1346,
            "Id": "120jvez",
            "Url": "https://www.reddit.com/r/Advice/comments/120jvez/my_boyfriend_constantly_tells_me_hes_going_to/",
            "Aswer": "Dude got no job, no money and keeps threatening to cheat on you... Move on sister",
            "A_score": 3811
        },
        {
            "Question": "How do I (17f) handle the death of my boyfriend (19m)\nMy boyfriend is the most amazing person i’ve ever met. He’s the only person i’ve ever felt comfortable around and he’s my only friend. He was diagnosed with leukemia (AML) in june 2022 and not even 2 weeks ago they said he wouldn’t make it longer than 3-4 more weeks because the leukemia was doubling even with all the chemo. I stayed in the hospital for so long and I left for a second to give his mom space to say goodbye to him, I had already been saying my goodbyes so I let her have her privacy. As soon as I get home I get a call saying he passed away in his sleep. I don’t feel like i can breathe without him i’m just too attached to try to live without him and I just don’t know what to do and I really need some serious advice.",
            "Q_score": 162,
            "Id": "1214rf7",
            "Url": "https://www.reddit.com/r/Advice/comments/1214rf7/how_do_i_17f_handle_the_death_of_my_boyfriend_19m/",
            "Aswer": "I am so sorry.  You don't get over things like this but you do get through them, you survive his loss even though the pain of it will sometimes feel like you can't.   \n\n\nGet yourself into grief counseling, or a grief  support group.    \n\n\nI found it helpful to read poems and other things on grief.   \n\n\nOne reddit user really described grief so well when someone lost their best friend and asked what to do: [https://www.reddit.com/r/Assistance/comments/hax0t/comment/c1u0rx2/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/Assistance/comments/hax0t/comment/c1u0rx2/?utm_source=share&utm_medium=web2x&context=3)    \n\n\nFind ways to carry him with you through your life. Write out memories of him.  Tap into the feelings you had when you were around him, that love will stay with you for a lifetime.",
            "A_score": 91
        }
    ]
}