{
    "Posts": [
        {
            "Question": "I met up with my son after four years of no contact.\n \n\nOriginal Post: [https://www.reddit.com/r/relationship\\_advice/duplicates/11lcng9/my\\_son22m\\_cut\\_contact\\_with\\_me\\_43f\\_four\\_years\\_ago/](https://www.reddit.com/r/relationship_advice/duplicates/11lcng9/my_son22m_cut_contact_with_me_43f_four_years_ago/)\n\nFor the few that gave me actual advice, I went to meet up with my son without Max or my daughter. It was at a local coffee shop. I found him sitting in one of the booths at the coffee shop. He was on his phone. I was really scared. A part of me wanted to tackle him with a hug and beg for his forgiveness. Another part of me, wanted to leave before he noticed me. I said his name to get his attention. He didn't even leave his seat; he just looked at me and said hi. I asked if I could sit. I started asking about how is he doing. He said he was fine. I was about to apologize, but he interrupted me by saying, \"Before you apologize, I want to understand how the relationship between Max and you even started.\"\n\nI started telling him everything. When it came to mentioning my meet-ups, he interjected me and started asking me questions that were difficult to answer. He asked \"So all the times that you were going out you were lying to me about where were you going. Weren't you?\" I nodded. \"What about the times I asked to spend time with you? Did you lie to me so you meet up with Max instead?\" I started tearing up. It was hard being there. \"Did you miss out on events to be with Max? What about my birthday?\" That's when I started crying. He told me to save my tears. He said he figured that out soon after he learned about the relationship with Max. He just wanted to hear it from me. He then asked me if I was still with Max. I told him I was married to him and I have a daughter with him. He seemed to need a minute to process that.\n\nThen he started speaking. He told me he never had an issue with me dating or meeting someone. In fact, he hoped I found love. He understands that I needed companionship and a type of love he couldn't offer as my son. He told me throughout all these years he felt conflicted because both Max and I were both consenting adults and adults have a right to find happiness. My son admitted he shouldn't Max and was glad he didn't press charges. He said despite all of that, they were some things that he can't get over. He told me he can't get over the fact that I didn't take him into consideration when it came to pursuing the relationship. It was also hurtful to realize that I would value a romantic relationship to the point of being willing to throw away a close relationship with him for it. If I had the attitude of being done raising him and finally pursuing my own life, then that's valid, according to him. However, I would have no right to want to have a close relationship with him in return. Again, that's what he said he believes. He told me he wouldn't have forgotten me when he left for college. He would have wanted me to move close to him after he got a job if he couldn't move close to me. In this ideal world we would live close by so he we could still see each other even after he had a family.\n\nHe said he loves himself and his life too much to have back in my life.. My son said he works as a mechanical engineer now. He is engaged to the love of his life. She was also raised by a single mom like him until she was 16 when her stepdad into the picture. Both of them have welcomed him into the family. He told me his future in-laws and his fiance are his family now. He said he was getting a job near them.\n\nHe finally admitted that he just wanted closure before permanently cutting me off. He told me not to contact him or his family at all. He made it clear he wouldn't be there for me at my last stage of life or even come to my funeral. He made it clear he won't even hold my hand when I pass away. I won't have the privilege of knowing his fiance or his future kids. He made it clear that if his half-sister ever contacts him as an adult he'll be upfront on why he doesn't want a relationship with her. He said good bye to me and left. I cried so hard that I got the attention of the people in the coffee shop. I was crying on the way back home. I don't even know how therapy can even help. I never felt so much emotional pain in my life before. What do I do now?",
            "Q_score": 263,
            "Id": "11pfgyz",
            "Url": "https://www.reddit.com/r/Advice/comments/11pfgyz/i_met_up_with_my_son_after_four_years_of_no/",
            "Aswer": "Now, you respect him and move on with your life.",
            "A_score": 327
        },
        {
            "Question": "My(F19) own siblings(M17 M22) show signs of wanting to sexually assault me\nThis is not my main account for privacy reasons.  \nWe were at the house and my older brother told me to take the trash out, I was angry because of his tone and how he always sounds like he is bossing me around, so I told him he can take it out himslef. He proceded to yell at me and calling me names, my younger brother was also there and they started talking about how I am a b\\*\\*\\*\\* and they also made fun of the way I look and the fact that my ex was ugly and bla bla.   \nI didn't really care about all of this because it's not uncommon in our house (probably the only person who loves me in our house is my mom). but what was really disturbing is that they joked about how they would want to gang bang me so I can 'shut up'. this was absolutely disgusting and creepy  \nI am not making a big deal of this because like 3 months ago I found semen on one of my panties and and don't know which one did that but they both are really trash human beings and can definitely do this.  \nI don't know if I should finally tell my mom about this or if it is even a good idea to tell her. and I don't have anywhere to go.",
            "Q_score": 60,
            "Id": "11pdlkz",
            "Url": "https://www.reddit.com/r/Advice/comments/11pdlkz/myf19_own_siblingsm17_m22_show_signs_of_wanting/",
            "Aswer": "You should definitely tell your mom about what’s going on if you suspect that they will harm you. Brothers should not be saying things like that. Be safe please.",
            "A_score": 96
        },
        {
            "Question": "Can’t control my laughter\nI be talking to my mom and I giggling non stop and I stg she said she’s gonna drug test me came in my room at 2am and I was just giggling at her I can’t talk to anybody without giggling ik yous are gonna think this mad dumb but I’m honest I can’t stop laughing non stop is there a medical reason for that or sum anybody got an idea",
            "Q_score": 38,
            "Id": "11peprw",
            "Url": "https://www.reddit.com/r/Advice/comments/11peprw/cant_control_my_laughter/",
            "Aswer": "If it’s genuinely constant it’s either caused by a neurological disorder or brain injury. Go to your doctor.",
            "A_score": 34
        },
        {
            "Question": "Should a married woman (me) be “allowed” to go out dancing with a group of women without her husband?\nA little background info; We’ve been together since I was 13 and married for 10 years in April. I’m 33 and he’s 34.\n\nMy husband guilted me out of going out saying he wasn’t comfortable with it but not because he doesn’t trust me. I rarely do anything besides work, take care of my children and home and visit family. My best friend invited me out for a night of dancing at a local bar. It was her sister’s birthday and 5 or 6 other women were going. He said a married woman shouldn’t be going out without her husband and at first suggested that he go and just “hang out” in the bar. I told him that I thought that would be weird, him just standing in a corner of the bar watching us. He then sent me several pictures of posts where people had asked if their wives should go out without their husband which of course supported his opinion. He also sent me a very long text explaining that he wasn’t comfortable with it. Saying that he doesn’t trust other people and he thinks it’s just wrong for a married woman to go out to a bar where people go looking to “hook up”. I just wanted to go out with a group of ladies to dance.",
            "Q_score": 812,
            "Id": "11oq8g6",
            "Url": "https://www.reddit.com/r/Advice/comments/11oq8g6/should_a_married_woman_me_be_allowed_to_go_out/",
            "Aswer": "I literally shook my head after reading the title. This really shouldn't really even be a question. Everyone deserves a night out w/ friends.",
            "A_score": 1205
        },
        {
            "Question": "Taking his daughter’s kidney\nI have a friend who is in the middle of renal failure. Dialysis has gotten him this far. His daughter is a match, and wants to give him her kidney. \nHe wants to take it, but has so far refused.  He keeps saying that he can’t take his little girl’s kidney. \nWhat in the fuck should I tell him? He called me and talked to me about it. But how am I supposed to either tell him to take his daughter’s kidney, or not to and he’ll probably die without it. Never seen him cry before, but I just heard it over the phone…",
            "Q_score": 221,
            "Id": "11otfm5",
            "Url": "https://www.reddit.com/r/Advice/comments/11otfm5/taking_his_daughters_kidney/",
            "Aswer": "I gave my Dad one of mine. He didn't want to take it but did in the end.  He woke up from the op looking and feeling a million times better straight away. I've never regretted the decision. He got 6 years longer than he would have done, something unrelated got him in the end.",
            "A_score": 344
        },
        {
            "Question": "I'm being forced to betray 1 of my 2 best friends.\nso basically, i have 2 best friends, a girl (Maddie), and a guy (Aiden), both of them have had many relationships and aiden is a player and doesn't really do relationships, Maddie is a huge lover, she's been \"attached\" to him for over a year now, she's absolutely obsessed with him, she's cried, screamed, even self harmed over him, she knows he doesn't like her at all but still says \" we're meant to be \" and all that stuff, he recently told me that he honestly hates her guts and is just playing her, and she doesn't know, i either tell her about it all and betray Aiden because i had promised to never tell anything he tells me to anyone, or let it be and let Maddie get hurt, what should i do?",
            "Q_score": 139,
            "Id": "11ovcms",
            "Url": "https://www.reddit.com/r/Advice/comments/11ovcms/im_being_forced_to_betray_1_of_my_2_best_friends/",
            "Aswer": "Well Aiden is a huge asshole here so you should do the right thing and protect Maddie. And maddie needs to quit with the \"we're meant to be\" nonsense because she's being delusional and setting herself up for disappointment. \n\nYour friends suck but this shouldn't be too hard. If you have to pick between the asshole and the victim, protect the victim.",
            "A_score": 316
        },
        {
            "Question": "is it offensive to say hats off to you\nthere was a guy jogging near me and i said hats off to you and then he jogged away and then he came back to me and shoved me into a wall and said \"hats to who?\" and i explained i said it to him to support him and he walked off. im wondering if this is offensive he was black and i really didnt mean anything by it but it did scare me alot as ive been in hospital recently and have almost no muscle s i couldnt push him away or anything.",
            "Q_score": 44,
            "Id": "11ozb3t",
            "Url": "https://www.reddit.com/r/Advice/comments/11ozb3t/is_it_offensive_to_say_hats_off_to_you/",
            "Aswer": "Not offensive at all. His fault for getting so angry. He might’ve had earbuds in and didn’t hear you correctly. Sorry you were scared",
            "A_score": 97
        },
        {
            "Question": "Are any teen moms, dads, or parents, in general, able to advise me on caring for a baby at 16?\n# I got my girlfriend pregnant and she doesn't want an abortion but neither do I. Im gonna be 16 in about 2 weeks so I can get a decent amount of jobs but pretty low pay. I don't know how my mom is going to react, she could kick me out but I'm not sure. Would it be better to move in with my GF and care for the baby or stay with my mom? I also need help knowing what I need for a baby. ",
            "Q_score": 554,
            "Id": "11oelh3",
            "Url": "https://www.reddit.com/r/Advice/comments/11oelh3/are_any_teen_moms_dads_or_parents_in_general_able/",
            "Aswer": "I'm 30 now. But when I was 17 my girlfriend and I got pregnant. We opted for adoption, my father knew of a couple who wanted but couldn't have kids. They were super awesome, well off, amazing jobs. Needless to say the kid was going to be set, better off than i ever was and I was raised middle class. They paid for all the hospital expenses, pampered her, let us stay at their house. It was the best option for us at the time, cause neither of us felt right getting an abortion, but knew we weren't ready to be parents. Flash forward to now, that girl and I broke up more than a decade ago, good riddance honestly. I met my NOW wife a few years after the break up, we have two boys, and life is good. Parenting is hard, I do not regret what we did and the choices we made. The way our relationship went after the adoption was horrible. She cheated, manipulated, tormented. The true colors showed once we were out of high school and got to expirence the real world. Just weigh your options man, think about your future self. Good luck and hope you the best.",
            "A_score": 912
        },
        {
            "Question": "(Update): My ex-bestfriend, who is married to my ex-husband hired me to make a cake for her son's birth.\n Hi, guys. I have read your advice and suggestions. You all made some really good points. So, I decided to talk to my mom about it. I just needed her insights about this matter. She told me I should do what I want to do. My boyfriend also encouraged me to take the order. He says that if I had to stay to organize the dessert table he would be there for me. I took the order. And it turns out, it was my ex husband’s idea to hire me. Because one of his colleagues recommended my services to him. And it was sort of short notice so I had to rush this. Anyways, I kept it strictly about business. I did take the payment in advance just like some of you have mentioned. I always ask for advance payments. I mostly maintained communication through email. I have an assistant who is also a family friend of mine to handle all communications. My ex-bsf tried many times to meet with me in person, but I told her to just email me because I do have cake orders for other people too. I only had to meet her 1 time in person regarding the order. She sent me the details of the party over the email. \n\nAnd like I mentioned it was a huge order. I didn’t just have to make a birthday cake for the baby (it is pokemon themed). There were also cake pops, cupcakes and macarons. Luckily, I had my friend Marie over for some help (yes, I did pay her). So, like usual I went to deliver the cakes and other stuff for the party. There was already a table set at the venue. My boyfriend, Josh (35M) came with me to support me and to keep me away from my ex-husband and ex-bsf as much as possible. As I was busy with myself, my ex approached me and said hello. Ngl, seeing him after so many years my heart just stopped. This man has given me the worst pain you could possibly give to a human. I am glad I held my composure. I also said hello back. He tried to have a small talk with me by saying that he is sorry about how things went down and what he said and also I looked better than the last time he saw me. Then he drops a big bomb, he said all these years he has thought of me, wondering what I was doing even though he is happy with his married life. I was silent. I didn’t say a word. He just kept spewing that he misses me and my cooking. My homemade french onion soup is still his favorite. He misses that every time he gets sick with a flu. I didn’t know what to say. At that moment Josh noticed that my ex was making me uncomfortable and he rushed towards me with a fake emergency. He asked if I was ok, I said yes. \n\nAfter the table setting was done, I was about to leave, that’s when I saw my ex-FIL along with other guests. He noticed me and came to give me a hug. My ex-FIL is a very humble man. In fact he was the only man who was on my side when I was going through a divorce with his son. He looked really happy to see me and asked me how I was. He started to chat with me. I talked to him about my business and he gave me some advice. He even talked to my boyfriend. He called Josh a “pretty standard guy” (whatever that means). Ex-FIL was nice and said he would suggest my services to his friends too. He insisted that I stay until lunch is served. I said no a couple of times but he managed to convince me. I only stayed for 1 more hour or so. But I was fine. I did notice that my ex-bsf was eyeing me from the corner. I was fine because Josh was beside me the whole time. I chatted with some guests. They appreciated my service. I didn’t have any more conversations with my ex. I didn’t even stay for the cake cutting. I left the first chance I got but my assistant stayed to make sure everything was fine and for the clean up. \n\nIt was overwhelming for me. I saw some of my old friends and my in-laws. My MIL avoided me and some of my old friends just said hello. Later that day I got a message from my ex-bsf on my work email that she liked my service and that her guests really liked my cakes and desserts. She also said sorry. That’s not where it ends. I got to know from my friend Marie, who is still in contact with some of my old friend group that my ex-bsf is not happy with her marriage. When my ex and her are in public they would often fight a lot. They also fight on the day of their kid’s birthday. Tbh I just told her to not bring me the gossip about her. But the silver lining is I got a huge fat check lol. I can finally buy a new sugar printer or maybe a good quality oven. Also, I just want to appreciate my boyfriend Josh. He has been incredibly supportive of me. He has protected me from my ex and ex-bsf like a knight. I think he deserves his own cake from me. 😉 And I know a lot of you told me not to take it. But I guess I am just a greedy Mr. Krabs who cares more about the money rather than being classy hehe. But this is the last time I will be taking any orders from them. I know they have a 3 yr old daughter whose birthday will be in 2 months. I think they might try to hire me again. I will not take it if that happens. \n\nP. S. Yes my ex-bsf did try to communicate with me during the party but I managed to avoid it thanks to Josh and my ex-FIL. My ex-FIL knows about my situation and my discomfort with my ex-bsf. He kept me busy with small talk.",
            "Q_score": 209,
            "Id": "11oj5ek",
            "Url": "https://www.reddit.com/r/Advice/comments/11oj5ek/update_my_exbestfriend_who_is_married_to_my/",
            "Aswer": "Your bf needs his favorite cake mad stat. He deserves 2 cakes.",
            "A_score": 106
        },
        {
            "Question": "3 missed periods\nI’m a teenage girl, i’ve had regular periods for around 6-7 years and suddenly i’ve missed around 3. i’ve had no of my pre period signs and i’m not really sure if this is something to be worried about. \n\nis it worth bringing up to my parents/doctors or anything?",
            "Q_score": 25,
            "Id": "11owpsp",
            "Url": "https://www.reddit.com/r/Advice/comments/11owpsp/3_missed_periods/",
            "Aswer": "Absolutely. A simple blood test to at least find out what your hormonal are doing is in order. \n\nIf you've been sexually active, a pregnancy test will needed too.",
            "A_score": 70
        },
        {
            "Question": "Hidden Cameras—should I warn my sibling?\nMy sibling (in their late 30s) is moving in with one of my parents due to mental health issues. My parent has hidden cameras in their home due to their own mental health issues, and has used them to surveil people (myself included) who were temporarily staying in their home to take care of pets and such while they were out of town. Should I warn my sibling that they are there? I felt very violated after the fact when I found out, and since my sibling deals with paranoia and psychosis, I worry. On the other hand, my sibling has no where else to go and I don’t want to drop that information in their lap because I don’t want it to exacerbate their challenges. \n\nI have a complicated (read: bad) relationship with this parent so I’m conscious that this could read as shit stirring. Any help is appreciated!",
            "Q_score": 58,
            "Id": "11onwqm",
            "Url": "https://www.reddit.com/r/Advice/comments/11onwqm/hidden_camerasshould_i_warn_my_sibling/",
            "Aswer": "I would let them know for sure",
            "A_score": 108
        },
        {
            "Question": "My cousin is asking for sexual favors\nI’m 17F and he’s 27M. My entire family is kinda fucked up, so I like to stay away from them but when we go on trips he’s always there, and my parents allow him and his family to visit us. \n\nOver text and phone calls he’s always asking me if im interested in having sex, I usually brush it off cause wtf… who says that? But last night he sent me over $100, asking if I’d send him nudes. I said no, and he sent me a pictures of his nudes. ( he’s also in the army)\n\nHe also has said he likes that I’m skinny, because I’m “easier to bruise and hurt”. I’ve since blocked him but how can I explain this to my parents, I don’t want to be around him ever again and I’m not sure how to tell them, or if they’d think I’m being dramatic or lying.\n\nUPDATE: I told my dad, he’s extremely pissed, he spoke to his dad, and his dad said this isn’t the first time he’s done this. His dad kinda brushed it off, we’ll see where we go from here\n\nANOTHER UPDATE: We told his dad because we wanted to make sure he wouldn’t be around any of the other kids from now on. They moved him from his previous base to another because of something similar. Given this will be the 2nd time he should be getting dishonorable discharge, won’t know for sure until we speak with them on Monday and go through that process.\n\nThanks In advance.",
            "Q_score": 866,
            "Id": "11ny2md",
            "Url": "https://www.reddit.com/r/Advice/comments/11ny2md/my_cousin_is_asking_for_sexual_favors/",
            "Aswer": "Tell your father and show him the texts.",
            "A_score": 718
        },
        {
            "Question": "Wife’s Friend Is Cheating.\nAs the post says, we learned that my wife’s friend is cheating on her husband. We’ve all known each other for years. We want to tell him, but her friend says she will tell him when she’s ready. What should we do?",
            "Q_score": 520,
            "Id": "11ntiri",
            "Url": "https://www.reddit.com/r/Advice/comments/11ntiri/wifes_friend_is_cheating/",
            "Aswer": "I dunno, I sure wouldn’t want to have to answer the question “You knew? Why didn’t you tell me?” You’re supposed to tell on the person doing the shitty thing, not protect them. And that’s exactly what you’re doing.",
            "A_score": 784
        },
        {
            "Question": "My client is “openly racist” to white people, how do I deal with her?\nAccording to my boss (who is black) she warned me that she is “openly racist to white people”, and it’s quite obvious. Anyone on our team that is white she constantly belittles, insults, and blames. She has used cuss words when speaking to us, she gives me attitude every time I open my mouth, and has made multiple people have panics attacks and cry due to her extreme rudeness. \n\nShe will not allow my white boss to be on any communications with the them even though shes been on the account for years and if she is accidentally included, she questions it and gets mad. She does not act like this to any of our black employees. Not sure if you can call it racism cause I know people say that can’t be experienced by white people, but damn she’s making my job hell.\n\nI’m constantly stressed and anxious because I know if anything bad happens, even if it’s HER FAULT, she will somehow blame me or my white boss. I feel like I can’t talk or ask questions because she will get mad. Our bosses know about this and we all hate her but they are trying to get them to resign our contract so they won’t say anything. \n\nAny advice or suggestions on how to deal with this? I feel terrible especially for my white bosses who take constant insults and rudeness from her and have continuous panic attacks over it.",
            "Q_score": 451,
            "Id": "11nu94t",
            "Url": "https://www.reddit.com/r/Advice/comments/11nu94t/my_client_is_openly_racist_to_white_people_how_do/",
            "Aswer": "Document everything. Get everything in email or writing and save printed copies. Any time there is a question, email for confirmation. \n\nAny time she does anything racist in writing, email, etc, document it and save a copy. Have others do the same.",
            "A_score": 760
        },
        {
            "Question": "Need advice. Is this cheating?\nI feel so broken. My husband of 15 years, been together 25 did something that really upset me a month and a half ago, and instead of apologizing, he has been acting like I don't exist..(which is the cycle in our marriage, it happens almost every month) not talking to me, acknowledging me..just spending all of his time with our kids until there a huge blow up and we rencile after months and months of this treatment.\n\nWell, one of our daughter's friends mom is a widow. My husband has jokingly said in the past that if anything happens to me that she can be his sugar mama as she has a full time job and a house and I'm a stay at home mom with no income coming in.\n\nWell, we're at a soccer game the other day and our daughters (mine and the daughter of widow )are playing in the gym. I'm sitting next to my husband on the bleachers and we're not talking. I look over and he's texting the mom asking if she was able to make it (she wasn't there yet). I flipped out, demanded to see the phone and its a bunch of texts.\n\nSome background..our daughter went over for a playdate a couple weeks ago and my husband picked her up. They didn't come home for an hour, even though they live 10 minutes away. When I asked my daughter why it took so long, she said that the girls didn't want to stop playing and that my husband and the mom were in the kitchen talking.\n\nA week after that, we had her daughter here for a playdate. That night, husband texted a picture of our dog in the snow as he was taking her for a walk saying \" See, this is what you have to deal with when you have a dog lolol\" and then they were texting about that.\n\nThere were like 15 texts back and forth that I could see and a smiley a face from her that seemed to be in response to something he said that I think he quickly deleted before handing me the phone. I was SO upset and in the middle of a crowded gym so I really couldn't absorb everything. I know there was nothing sexual.\n\nI am so upset about this as I consider it cheating, but he is saying I'm crazy. He hasn't spoken to me in months, he's sitting next to me on the bleachers texting this woman as I'm sitting there. I feel so hurt, emotionally violated and disrespected.\n\nAm I being crazy or is this completely unacceptable behavior?",
            "Q_score": 131,
            "Id": "11o3b56",
            "Url": "https://www.reddit.com/r/Advice/comments/11o3b56/need_advice_is_this_cheating/",
            "Aswer": "Like, whether this is cheating or not, are you happy in this relationship? It sounds *super* lonely.",
            "A_score": 532
        },
        {
            "Question": "someone half naked outside my neighbours house\nAs title suggests there is someone outside my neighbours house in just pants(underwear)\n\nHe began by knocking and shouting to be let in and then sobbing. Finally he just sobs and try to resist the cold(about -1°C).\n\nIdk what I should do as I do not want to endanger me or anyone in my house but I also don't want to do nothing. \n\nIts currently 3:15am and haven't done anything hoping the neighbours would have came out as he's clearly someone they know. \n\nWhat should I do if anything (there isn't an adult home and I'm oldest)\n\nEdit:  If it lasted any longer I would've called the police (I was going to anyways before this post) but thankfully the neighbour had woken up and took him home so that should be fine now. I was just really scared and obviously didn't want to do nothing but also not make it worse somehow.",
            "Q_score": 28,
            "Id": "11o9bta",
            "Url": "https://www.reddit.com/r/Advice/comments/11o9bta/someone_half_naked_outside_my_neighbours_house/",
            "Aswer": "Call the police.",
            "A_score": 30
        },
        {
            "Question": "Bullying in kindergarten teachers and principal are powerless to address it, help!\nHi All, begging for some advice here.\n\nLong story short my daughter is getting bullied and on occasion, pushed and shoved around by a bully in her class.  There have been 4 occurrences within the last 6 weeks of bullying to the extent that my daughter is throwing up before school due to anxiety and has now missed a number of days.  This is Kindergarten for Christ's sake.\n\nWe have sent 4 emails detailing each occurrence.  The teachers and principal are involved, and after the 3rd occurrence, the parents of the bully were informed.  After this 4th occurrence we again sent an email and the principal essentially responded with \"all we can do is inform the other parents\".\n\nThis tells me that the school cannot address bullying.  They have told me they have \"safety plans\" but won't go into detail what those plans are, except that they are designed to address bullying etc.  Clearly these plans are not working.\n\nI'm really thinking that either the school is trying to protect itself, or that the teachers and principal have had their wings clipped to the extent that they can't actually use discipline etc.  I'm at a loss as to what to do here.\n\nI'm thinking of either escalating to the school board and / or engaging the media at this point.  Is this advisable or can anyone think of a better alternative?  I really don't want my daughter to switch schools.\n\nThanks",
            "Q_score": 269,
            "Id": "11nr53y",
            "Url": "https://www.reddit.com/r/Advice/comments/11nr53y/bullying_in_kindergarten_teachers_and_principal/",
            "Aswer": "This happened in our school. The parents of the bullied child threatened restraining order. This action alone made the school change the bullied child's classroom. The special ed dept had been trying to manage the situation internally but after the restraining order threat, they sent the bully to be outplaced.",
            "A_score": 269
        },
        {
            "Question": "I am really scared of zombies\nSo i am 14 years old and i am extremely afraid of zombies, every night i fear one of them somehow might get in my house or something like that and it usually keeps me up, i feel really bad about it because i am too old to be scared of such nonsense and i myself know they’re not real, but something about them is uncanny enough to scare the living shit out of me every time i see them in pictures/movies/shows, i try my hardest to stay away from any kind of content related to that but they are so popular i usually still catch a glimpse of them before going to sleep, do you have any advice to get rid of my fear?",
            "Q_score": 84,
            "Id": "11nmanh",
            "Url": "https://www.reddit.com/r/Advice/comments/11nmanh/i_am_really_scared_of_zombies/",
            "Aswer": "Good news: there have been zero zombie- related deaths or injuries in the last 14,000 years.",
            "A_score": 410
        },
        {
            "Question": "My bestfriend sends me (a guy) a D pic and now idk what to do.\nHi I'm a guy and this has never happened to me before, I'm also not the best in social situations being autistic and awkward. This morning my best friend where chatting like normal, even making the few innuendo jokes like most guys do, just a bit of banter, when he started talking about having a hard on and sent me a d pic. I didn't appreciate this, I'm straight and seeing another guys private parts does make me feel a bit sick, I tired to ignore it and made more banter and told him to not do it again, he apologised and we continued talking like usual, but I can't help but think why, is this normal behavior around guys? Or is it something else that I don't know about, as far as I know he's straight so I'm just confused, anyone got any advise?",
            "Q_score": 69,
            "Id": "11nlgxs",
            "Url": "https://www.reddit.com/r/Advice/comments/11nlgxs/my_bestfriend_sends_me_a_guy_a_d_pic_and_now_idk/",
            "Aswer": "Its certainly not classy behavior. He's potentially not entirely straight or just somewhat the clown. If he's under 18 he just sent you child porn and I would make it clear in text that you never what to receive that again and delete and empty the trash on the phone.",
            "A_score": 77
        },
        {
            "Question": "Hey guys, how do I get myself not to talk too much?\n",
            "Q_score": 47,
            "Id": "11noeky",
            "Url": "https://www.reddit.com/r/Advice/comments/11noeky/hey_guys_how_do_i_get_myself_not_to_talk_too_much/",
            "Aswer": "Ask people questions, then they will talk more",
            "A_score": 77
        },
        {
            "Question": "EX GF spread false allegations that I'm an abuser and it cost me my dream job.\nTitle says it all. My ex (as of 19 months ago) contacted me about a month ago about a kitchen utensil she wanted back. I told her I would get it to her but was busy with my job, and wouldn't be able to get it to her until the next week. When I returned from my trip, she had made an account on social media impersonating me and making fun and slandering my name. I told her to take it down or that I would get the authorities involved and she called me an abuser and asked me to leave her alone.\n\n2 hours later my friend calls me and tells me about a video on her story that states that I'm an abuser. I go to the police and do the legal stuff.\n\n3 weeks later (yesterday) I received a message informing me that I was no longer employed, and was wished the best of luck. This job was my DREAM. It was the perfect job for me, the one I'd grew up wanting. I called a coworker and they agreed that it was because of her messaging my boss and telling him i abused her when we dated and am still now. Now I'm in debt, can't pay bills, and feel lost and defeated. I'm blown away that this whole thing got this far, and I don't know what to do.\n\nTLDR: Ex gf accused me of abuse back when we dated. Now I've lost my dream job, have rumors effecting my work and life, and am financially in a bad spot.",
            "Q_score": 109,
            "Id": "11niu6f",
            "Url": "https://www.reddit.com/r/Advice/comments/11niu6f/ex_gf_spread_false_allegations_that_im_an_abuser/",
            "Aswer": "Did your boss actually hear your side of the story, or did they just decide for themselves what your ex is saying is true?\n\nIf they fired you without hearing you first, you could get yourself some legal help (something you should anyway for suing your ex).",
            "A_score": 173
        }
    ]
}