{
    "Posts": [
        {
            "Question": "I left a family reunion early after my uncle slapped my daughter in the face. Now everyone including my parents is saying I overreacted.\nHello everyone my name is Alena I’m 33 years old and my daughter Quinn is 11. Last Saturday was my family’s annual reunion and I went and took my daughter with me. Everything was going good for about the first two hours before my daughter came running to me crying. She said that my uncle who’s known to be a grouchy person slapped her in the face after she bumped into him while playing with one of the other kids. She looked up at me and she had a big red handprint on the right side of her face. I confronted my uncle and he said that my daughter needed to watch where she was going and I told him that I didn’t care and he was never to raise a hand towards my child then I took my daughter and we left. Since then my parents and some other family members have been calling and texting me saying I overreacted and that I know how my uncle is to which I have said I don’t care he is not to ever hurt my child. I don’t think I overreacted at all what do you guys think.",
            "Q_score": 885,
            "Id": "1214s2h",
            "Url": "https://www.reddit.com/r/Advice/comments/1214s2h/i_left_a_family_reunion_early_after_my_uncle/",
            "Aswer": "Definitely not an overreaction. Uncle is lucky you didn't call the police.",
            "A_score": 1159
        },
        {
            "Question": "My neighbor has been in the shower for like 4 or 5 hours\nSooo pretty much as the title says. I live in an apartment and the neighbor’s upstairs bathroom is right on top of mine so I can always hear when they run their shower/bath. Their water has been running for like legit 5 hours. No sign of flooding though (it would’ve spilled down to my bathroom). Should I like call maintenance or somebody or something? Thanks!\n\nUPDATE: Sorry for the delay, after contacting police I fell asleep and it took them like a few hours to even come out and check. Neighbor is fine, they (for whatever unknown reason) left the shower on and left the house. They’re not elderly, but may be mentally unwell. \n\nAnyways, shower is off now and it ran for a total of like 10 hours. Weird shit and complete waste of tons of water I’m water. Thanks for everyone’s advice and concern",
            "Q_score": 327,
            "Id": "121807h",
            "Url": "https://www.reddit.com/r/Advice/comments/121807h/my_neighbor_has_been_in_the_shower_for_like_4_or/",
            "Aswer": "Yeah I’d call a property manager. Sounds like a welfare check may be needed",
            "A_score": 396
        },
        {
            "Question": "My boyfriend constantly tells me he’s going to “slip up” and have sex with another woman if I don’t give him any, what should I do?\nI’m (21) f and he’s (26) m and his sex drive is absolutely ridiculous.  He always tells me how important sex is for men and how they can’t function without it. I can’t see him as much because I’ve been working a lot and I also go to school part time. He barely works and always have time on his hands. Just laying in his house. \n\nAs soon as he gets sexually frustrated he starts with his nonsense. Yesterday he told me “there’s a lot of girls that’s been asking me (to have sex) but I’ve been turning them down, imma end up saying yes.”  \n\nMind you, I’ve been having his back while he’s been down and out. Buying him food, giving him money, being a shoulder for him to cry on. \n\nIs this sexual manipulation? What should I do?\n\nEdit: I just wanted to add that our most recent argument was because I’ve recently got over a really bad illness that left me sick for two weeks and bedridden. And he immediately started threatening me with the cheating. He told me that a women would never let her man leave the house sexually frustrated.\n\n\nUpdate: I’ve broken up with him! I sent him a text telling him how I felt about everything and I used some of the stuff you guys said. I blocked him on every single social media site including regular phone. I want thank you guys for all your support and patience. You guys really helped me a lot today. I’m  going to take time to just heal and worry about myself. ❤️",
            "Q_score": 1026,
            "Id": "120jvez",
            "Url": "https://www.reddit.com/r/Advice/comments/120jvez/my_boyfriend_constantly_tells_me_hes_going_to/",
            "Aswer": "Dude got no job, no money and keeps threatening to cheat on you... Move on sister",
            "A_score": 3490
        },
        {
            "Question": "How do I (17f) handle the death of my boyfriend (19m)\nMy boyfriend is the most amazing person i’ve ever met. He’s the only person i’ve ever felt comfortable around and he’s my only friend. He was diagnosed with leukemia (AML) in june 2022 and not even 2 weeks ago they said he wouldn’t make it longer than 3-4 more weeks because the leukemia was doubling even with all the chemo. I stayed in the hospital for so long and I left for a second to give his mom space to say goodbye to him, I had already been saying my goodbyes so I let her have her privacy. As soon as I get home I get a call saying he passed away in his sleep. I don’t feel like i can breathe without him i’m just too attached to try to live without him and I just don’t know what to do and I really need some serious advice.",
            "Q_score": 74,
            "Id": "1214rf7",
            "Url": "https://www.reddit.com/r/Advice/comments/1214rf7/how_do_i_17f_handle_the_death_of_my_boyfriend_19m/",
            "Aswer": "I am so sorry.  You don't get over things like this but you do get through them, you survive his loss even though the pain of it will sometimes feel like you can't.   \n\n\nGet yourself into grief counseling, or a grief  support group.    \n\n\nI found it helpful to read poems and other things on grief.   \n\n\nOne reddit user really described grief so well when someone lost their best friend and asked what to do: [https://www.reddit.com/r/Assistance/comments/hax0t/comment/c1u0rx2/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/Assistance/comments/hax0t/comment/c1u0rx2/?utm_source=share&utm_medium=web2x&context=3)    \n\n\nFind ways to carry him with you through your life. Write out memories of him.  Tap into the feelings you had when you were around him, that love will stay with you for a lifetime.",
            "A_score": 37
        },
        {
            "Question": "I (32m) just discovered the girl (21f) is 11 years younger than me. Is that too big of a gap?\nEdit: I called it off. Thanks y’all!",
            "Q_score": 134,
            "Id": "120xkbt",
            "Url": "https://www.reddit.com/r/Advice/comments/120xkbt/i_32m_just_discovered_the_girl_21f_is_11_years/",
            "Aswer": "There is a high chance that y’all will not be in the same life stage right now. \n\nAt 21, I was in college partying a lot. I was in no means ready to settle down. If you’re looking for a partner to settle down with, my first choice would *not* be the woman over a decade younger than you. \n\nMy parents are 8 years apart and started dating at 30 and 38. They knew each other at 21 and 29, but by no means were they compatible until much later.\n\nEdited a typo",
            "A_score": 194
        },
        {
            "Question": "I need help on how to talk to my son about sexual abuse\nMy son 10yo who lives with his mom, stepdad, and 2 other brothers (one older 13yo and one younger 8yo) all three kids have different fathers and I have shared custody of my son, the middle child. Today when I picked him up for spring break she told me they caught the oldest bending over the youngest doing stuff. After that the beans were spilled that the oldest had done oral stuff with my son and my son has done oral stuff with they youngest. All were on separate occasions. She tried talking to my son and he laughed and said it was just a joke. When I try talking to him he won't say anything. So I told him when he's ready to talk/wants to talk I'm here and I love him no matter what. What else can I do to get him to open up about what happened?",
            "Q_score": 40,
            "Id": "1211r2q",
            "Url": "https://www.reddit.com/r/Advice/comments/1211r2q/i_need_help_on_how_to_talk_to_my_son_about_sexual/",
            "Aswer": "This is to the point where you want to get professionals involved ASAP.",
            "A_score": 123
        },
        {
            "Question": "Should I go to the er without health insurance.\n33 yo male I think I've may have had a heart attack on Valentine's day. It's been over a month and my heart feels a little weird and has been stressing me out a lot. What also is stressing me out is how much it'll cost to go to the er.\n\nCan someone help convince me to go or maybe help me with a solution to look into for services.\n\nI grew up in a family that never went to the hospital for anything.. so I'm just worrying myself more this making my heart feels worse.\n\nThanks for any response",
            "Q_score": 65,
            "Id": "120x2kh",
            "Url": "https://www.reddit.com/r/Advice/comments/120x2kh/should_i_go_to_the_er_without_health_insurance/",
            "Aswer": "A visit to a regular doctor would be cheaper, but if you feel like it's an immediate emergency then definitely go to the ER.",
            "A_score": 119
        },
        {
            "Question": "My wife threatens divorce if i stay up after her and the kids go to sleep. What should i do?\nIt's literally my birthday and 12:15 and she screams (wakes up both kids) I WILL DIVORCE YOU IF YOU KEEP PLAYING GAMES LIKE THIS! I'm a night owl. I'm not goin to lay in bed and stare at the ceiling. I enjoy competive gaming (i dont scream lets go and wake  everyone up). It's something I'm good at and she is belittling it saying it's for kids. I was # 2 in the world with a character and she calls me a fa***t for my efforts. I support her and our 2 kids 100% they have everything they could ever want. Even bought her a new bronco that she has given to her parents to drive after she put all of 3000 miles on it. . I just don't understand how it effects her or anyone if i stay up late if it doesn't effect what I get up and do everyday. Day by day by day.",
            "Q_score": 368,
            "Id": "120ahh6",
            "Url": "https://www.reddit.com/r/Advice/comments/120ahh6/my_wife_threatens_divorce_if_i_stay_up_after_her/",
            "Aswer": "Call her bluff. She will back down. Sounds like she's a leech anyway, and if she does scream divorce, tell her if she dont like it, she's welcome to leave and get a job.",
            "A_score": 817
        },
        {
            "Question": "My boyfriend did the deed with me while I was sleeping?\nIs this rape or normal in relationships? How do I tell him if it was rape? He doesn’t think it’s rape. I told him to not do it again and that I’m uncomfortable.",
            "Q_score": 295,
            "Id": "1208ovg",
            "Url": "https://www.reddit.com/r/Advice/comments/1208ovg/my_boyfriend_did_the_deed_with_me_while_i_was/",
            "Aswer": "it's rape. relationship or not, consent still matters. since you were asleep and did not give an OK to it beforehand, it is rape.",
            "A_score": 1109
        },
        {
            "Question": "How should I deal with my nan discovering I have a tattoo?\nTo start this I am 18f and my nan is a big figure in my life. I see her almost weekly and she does so much for me and my family. She’s currently watching me and my siblings for a month while my parents are on vacation. On to the problem. \nWhen I was 16 I got my first tattoo with parent permission. It’s about the size of my fist and is a gorgeous floral design that I’m absolutely in love with. My nan is very religious (Jehovahs witness) and very much against tattoos. I hadn’t told my nan but she saw it yesterday while I was eating dinner. She called me out telling me how disappointed in me she was, how Im too young, how I am just “following the crowd”, She called my heavily tattooed mother revolting and is now not speaking to me. I understand her point but I had been planning on getting a tattoo since I was like 10 and was set on my design for more then a year before I got it. I don’t really know what to do and I’m worried that things will never go back to normal. I’m pretty anxious and just want some advice on how I should approach this topic.\n\n\nEdit: thanks everyone for your advice. I’m going to talk about it on the drive to a friends house that I’ll stay at for the night. Everyone has been really helpful thank you all so much. I’ll update later on how it goes <3\n\n\nEdit 2.0: hi guys this is for anyone in case they were curious. I talked to my nan and told her that she doesn’t have to respect my choices but she needs to respect me enough to not bring them up and some more. She’s still upset that I got it but she knows that won’t change anything. We are on proper speaking terms but now just to keep the piece I’m making sure to keep the tat out of sight. Thanks again for all the advice <333",
            "Q_score": 43,
            "Id": "120ecqr",
            "Url": "https://www.reddit.com/r/Advice/comments/120ecqr/how_should_i_deal_with_my_nan_discovering_i_have/",
            "Aswer": "She believes you're (possibly?) going to hell (I think, not exactly sure their beliefs). You can't convince someone with a religious foundation to their \"argument\" because you're arguing with a belief system that is faith based; there is literally no logical argument that can work.\n\nI'd go with, \"I'm sorry you're disappointed\"\n\nAnd otherwise not engage in her histerics.",
            "A_score": 89
        },
        {
            "Question": "Nephew turning 12 and says he doesn’t want anything for his birthday. What can I get him that he’ll want/not hate?\n",
            "Q_score": 307,
            "Id": "11zw2lt",
            "Url": "https://www.reddit.com/r/Advice/comments/11zw2lt/nephew_turning_12_and_says_he_doesnt_want/",
            "Aswer": "money",
            "A_score": 734
        },
        {
            "Question": "My girlfriend (22F) won’t change her shampoo even though I’m (25M) allergic to it?\nWe’ve been dating for about 6 months now. When we first started dating things were okay, but a couple months in, every time we would sleep over at eachothers place my face would break out in a crazy rash, my eyes would get super swollen and gunky, and I just looked and felt terrible. \n\nShe seemed slightly concerned at first. I told her that the only thing that has made this happen to me before is an ingredient in a lot of soaps and shampoos that I’m allergic to. We looked through everything we own and use together and didn’t find it in anything, except her shampoo. I told her that’s probably what was causing it, since her hair would be near/on my face when we slept together. I asked her if she could possibly get new shampoo, and she said no.\n\nI asked her why not; she said that she really likes the way that shampoo feels and that she spent $100 on it (they’re pretty big bottles). I told her I could give her some money to get new shampoo and she said no, she’s not changing it. This conversation was 2 months ago. I try to bring it up every couple weeks, because my eyes and face have been red and swollen for months, but she kind of just laughs it off or changes the subject. It bugs me too because she always mentions “oh my god your eyes look so bad babe” and I’m just like… yeah, and we both know why? It’s literally your soap.\n\nI’m kind of at a loss, I understand that she likes the shampoo but it’s physically affecting me negatively and I’m getting kind of sick of people at work asking if I got beat up in a fight lol. Is there something I could do or say to her to make her change her mind? Am I asking too much of her? I kind of feel like I’m going crazy.",
            "Q_score": 423,
            "Id": "11zmoc0",
            "Url": "https://www.reddit.com/r/Advice/comments/11zmoc0/my_girlfriend_22f_wont_change_her_shampoo_even/",
            "Aswer": "Tell her that one of the two things is going to be leaving, you or the shampoo.\n\n  \nSounds like she already made her choice though.",
            "A_score": 967
        },
        {
            "Question": "He’s going to dump me if I don’t watch Star Wars. What do I do?\nI’m a 39 year old woman with a lot to offer the world, but everywhere I go someone’s mind gets blown because I’ve never seen Star Wars. It makes me feel like a stupid idiot even though I’m a really good person. It gets worse, my boyfriend of 7 months has been telling me that it’s  an embarrassment and unless I get with the program (and like it) I can hit the road. I love my boyfriend but don’t feel like spending 492592 hours getting caught up on a thousand movies starring mystical green babies and robots. What do I do?",
            "Q_score": 433,
            "Id": "11zjuwa",
            "Url": "https://www.reddit.com/r/Advice/comments/11zjuwa/hes_going_to_dump_me_if_i_dont_watch_star_wars/",
            "Aswer": "Break up with him then watch Star Wars.",
            "A_score": 1646
        },
        {
            "Question": "My Boyfriend Deleted All Photos of Me\nI was looking though his phone photos for pictures of us that I wouldn’t have and noticed there wasn’t any pictures of me on his phone. So, I checked his recently deleted and all photos of me are in there. I asked him about this immediately and he promised he didn’t do it. I am still overthinking and now worried there’s something he’s not telling me. However, he does have a three year old sister who plays on his phone sometimes; maybe it’s possible she did it on accident. -but it was hundreds of photos so, I am having a hard time rationalizing this as well.",
            "Q_score": 170,
            "Id": "11zltat",
            "Url": "https://www.reddit.com/r/Advice/comments/11zltat/my_boyfriend_deleted_all_photos_of_me/",
            "Aswer": "My ex did that right before he broke up with me. Said he did it before so he wouldn’t have to after…heads up girl. Idk if a 3 year old would be capable",
            "A_score": 440
        },
        {
            "Question": "Friend ruined my surprise for my birthday\nI was on the phone with my friend earlier and she asked me “you know what (husbands name) is doing for your birthday right?” I said no and she goes oh well I got confused because he said it was a “surprise” in quotes so she didn’t know what that meant, and then went on saying who she thinks will be invited. I told her to stop because I didn’t want the surprise totally ruined! I feel bad because last year he also tried to plan a surprise birthday party which didn’t go as planned. Im pretty annoyed at her for telling me about it and not sure if I should let my husband know?",
            "Q_score": 48,
            "Id": "11zy2n7",
            "Url": "https://www.reddit.com/r/Advice/comments/11zy2n7/friend_ruined_my_surprise_for_my_birthday/",
            "Aswer": "Do NOT tell your husband. He will be so sad. Your friend is an asshole though. You need to be clear with her that she is not to tell your husband you know and that what she did was unkind.",
            "A_score": 101
        },
        {
            "Question": "Ultimate Karen Mamabear, help\nMy 2nd grade son was involved in a scuffle at recess. Before I even heard anything of it from school, I received an email from the mother of one of the boys involved. At the end of it she threatened to file a police report.\n\nPeople are absolutely insane these days but I laughed and dismissed her bizarre behavior. Didn't reply.\n\nUntill one night at 730, a knock on the door to reveal 2 armed patrol officers looking to interrogate my 7 year old son. \n\nThis psycho really called the cops on a 2nd grader. I'm floored.\n\nI'm thinking about going with a Harassment or Restraining Order but what do you all think?\n\nIf she is so mentally unstable as to call police on a 7 year old, what's she liable to do or say if she ever sees my son around school, for example, and I am not there?\n\nThoughts?",
            "Q_score": 83,
            "Id": "11zqjfp",
            "Url": "https://www.reddit.com/r/Advice/comments/11zqjfp/ultimate_karen_mamabear_help/",
            "Aswer": "This is a matter for school administration since it happened during recess. Make an appointment with admin to discuss the next steps.\n\nUsually if police are involved they will contact the school. I'm surprised you haven't heard from the school.\n\nThe thing is schools easily label kids and sometimes those labels affect how they are dealt with going forward. You will want to get their take on the event. It will give you a good idea of how they viewed and recorded the event.\n\nDon't escalate. Investigate.",
            "A_score": 129
        },
        {
            "Question": "How do i handle this feeling of guilt as an (ex?) gay muslim?\nIt is the first day of Ramadan, what used to be one of my favourite “holidays” in the muslim agenda. However, as a college student living away from family it is so difficult for multiple reasons. \n\nI am a gay male, with that comes completely being considered a sin in the muslim community or even within the religion, apparently. So, why would i be apart of a religion that doesn’t accept me? I began to push myself away from the religion and now it’s Ramadan. I cannot even explain that feeling of guilt thats just rooted within me because I don’t want to partake in it. I have to lie to my parents and family in saying i am doing it, but im not. \n\nI was never given a choice in whether I wanna be religious or not anyways, I was simply just born into it. And that is so unfair and no one should EVER be born into a religion, it should be a choice. Anyways, after realizing and accepting myself in that I am not a straight male (and  because of that, my literal existence is a sin), and that i don’t agree with most of the views in that religion, I dont wanna be apart of it. But, that feeling of guilt will always be with me, forever. Being told growing up that your parents will have to suffer if their kids are not religious, or following the religion is traumatizing. It sucks and it is so mentally draining.\n\nHow can i ease this feeling of guilt?",
            "Q_score": 56,
            "Id": "11znneh",
            "Url": "https://www.reddit.com/r/Advice/comments/11znneh/how_do_i_handle_this_feeling_of_guilt_as_an_ex/",
            "Aswer": "Well if you think about it, you were never given the choice to become a Muslim, yes. But you were also not given the choice to continue being Muslim. Others around you decided to kick you out and banish you for how God made you. You don't kick a ball then be mad it rolled away.\n\nOn another note, its easy confuse guilt with other emotions. Regret, loneliness, longing; holidays are strong, cultural times. Maybe you miss the cultural side of it. You may not be able to celebrate Rahmadan with your family, but your college community may have you. Do it for you, not God or Muhammad or anyone else.\n\nPlenty of former Christians Celebrate \"Christian\" holidays because its often not about Christ. It's about community.",
            "A_score": 40
        },
        {
            "Question": "Should I take a loan out for my friend?\nA friend hit me up saying they’ve fallen on financial hardships and needs 2,500$ or for me to co-sign a loan for them. Obviously I want to help them, however I’ve lent a close friend of mine money in the past and they never paid me back which in turn ruined our friendship. \n\nI don’t want this to happen again but my friend will end up homeless other wise. She works under the table jobs and since I have a stable job I could help her out. I don’t know much about loans but I heard they help credit.Could it benefit me in the long run? What should I be cautious about? Any advice?",
            "Q_score": 23,
            "Id": "11zvovn",
            "Url": "https://www.reddit.com/r/Advice/comments/11zvovn/should_i_take_a_loan_out_for_my_friend/",
            "Aswer": "Noooooo!!!! Absolutely never cosign for anyone except maybe your children. You should assume you will be fully responsible and it will wreck your credit when they miss payments. \n\nThey can get a prepaid debit/credit card to help their credit and won't need a cosigner.\n\nDo not do this.",
            "A_score": 106
        },
        {
            "Question": "been talking to a guy for a while now and our relationship is getting kinda romantic should i disclose my medical issues to them?\nso ive taken some lab tests today and i got the result of one of the tests but still waiting for the results of the other tests.\n\nanyway so there's a guy ive been talking to and our relationship has started to go the romantic way should i disclose my medical issues with him or no im kind of scared it would scare him off or something\n\ncan someone just tell me what to do i hate being an adult haha",
            "Q_score": 24,
            "Id": "11zr9ek",
            "Url": "https://www.reddit.com/r/Advice/comments/11zr9ek/been_talking_to_a_guy_for_a_while_now_and_our/",
            "Aswer": "If he's the type of person who wouldn't date you over this medical issue, why waste his and your time?",
            "A_score": 63
        },
        {
            "Question": "How to amicably break up with a friend without ghosting them or causing a scene?\nSort of in an awkward situation. I have this friend who I used to enjoy or at least not mind hanging out with. We’ve had two falling outs and the last one was kind of their fault. I don’t want to make a big scene but I also don’t want to continue our friendship. They actually have a lot of friends, and I’m the more introverted one. I honestly don’t know how we even became friends in the first place; I feel like we don’t have much in common and I honestly don’t love spending time with them (sometimes they say things that aren't the kindest - e.g. made a comment about someone being introverted and sitting alone, even though I'm introverted and often do that). They think we’ve “made up” and want to even work on this group project with me. I was prepared to just say, hey, I think I need some time away, but when they came to apologize, I just chickened out and felt so awkward being rude to them (especially since they didn't do anything majorly wrong) and now they think we’re good again. Idk how to “break up” with them without hurting their feelings.",
            "Q_score": 24,
            "Id": "11zkudl",
            "Url": "https://www.reddit.com/r/Advice/comments/11zkudl/how_to_amicably_break_up_with_a_friend_without/",
            "Aswer": "Do you really have to formally break up? They did didn't do anything seriously wrong correct? You do get to choose who you spend time with for sure. My advice to spend less time with the people you don't get along with. It's not always necessary to formally \"break up\" with friends. Its better to maintain a circle of acquaintances. Some of these people are close friends, some are just friends, and some are just people you know from school. No need to formally reject anyone. Just tell this person that you're good with the people already on the group project.",
            "A_score": 17
        }
    ]
}