{
    "Posts": [
        {
            "Question": "My boss has asked some employees, including myself to work for free for a charity night.\nHi everyone!\nSo my boss is putting on a fund-raiser for a former member of staff who sadly passed away around Christmas time and we want to raise money for her children. \nHe is hosting the event at his restaurant and guests are paying $150 a ticket to attend plus some auctions and such that the money will go to the children.\nNow here is my problem that I would like some advice on.\nThe boss approached the whole kitchen and wait team and asked if we would be willing to work for free on the night of the fund-raiser. \nIt is being held on a Friday night and almost all the staff are casual and alot of us depend on our entire pay to basically survive. \nWould it be wrong to decline this? I really would like some advice because I feel bad but I also have my own children to think of and can't afford to lose 8hrs of pay.\nThankyou!",
            "Q_score": 143,
            "Id": "11yh0pj",
            "Url": "https://www.reddit.com/r/Advice/comments/11yh0pj/my_boss_has_asked_some_employees_including_myself/",
            "Aswer": "\"I'm sorry boss, I would love to help but I cannot afford my bills if I'm not paid for the time I work\"\n\nYou can do this privately. If they shame you in any way you should probably look for another job.",
            "A_score": 274
        },
        {
            "Question": "My husband just passed away this morning\nHi r/advice…. I’m on mobile so I’m going to apologize for my formatting now but, \n\nMy husband just passed away this morning and I need help figuring out what to do. I (25f) and him (34m) just moved into our own apartment 4 days ago. Not to mention the fact that I can’t stop thinking about the moments before he died(I had with him all day up until it happened) I also have a bunch of bills and things like his phone and computer, that need to be paid off but won’t be used anymore. So I guess I’m just looking for some guidance, also a therapist would be nice…\n\nEdit: Thank you all so much for the overwhelming support, also him and I worked the same job(local truckers that team drive.) I’ve talked with my boss already and he is going to cover funeral/cremation costs for me. The main problems I’m having right now are: where am I going to live and what am I going to do for work?(I don’t really want to go back to trucking cause that’s what brought us together)",
            "Q_score": 804,
            "Id": "11xxdca",
            "Url": "https://www.reddit.com/r/Advice/comments/11xxdca/my_husband_just_passed_away_this_morning/",
            "Aswer": "r/griefsupport",
            "A_score": 414
        },
        {
            "Question": "I'm being scammed and need advice\nI sent nudes to a girl and she is threatening to post the nudes on the internet unless I pay her a huge amount of money. Please, I'm scared and need advice",
            "Q_score": 34,
            "Id": "11yg66i",
            "Url": "https://www.reddit.com/r/Advice/comments/11yg66i/im_being_scammed_and_need_advice/",
            "Aswer": "Block and delete here.  And move on. \n\nLife lesson.  Never send anything or say anything online.  That you do not want the world to see. \n\nOwn it and move on.",
            "A_score": 110
        },
        {
            "Question": "I lost my best friend in a car accident two weeks and my father told me that I was weak to cry over it and that I’m weird for taking it so hard.\nHello my name is Brian I’m 17 years old. Two weeks ago I lost my best friend Hayley to a car accident she was 18 years old. I met her in kindergarten and we were best friends ever since. She was so nice to me and we were pretty much like siblings we talked every day. Not being able to call her or be able to just go see her whenever I want to and give her a hug is just killing me. I’ve been calling her phone just to hear her voice on her voicemail. My father saw me crying in my room yesterday and told me to man up and that I was weak. He also told me that it was weird that I was taking this so hard since she was just a friend and not family. I’m really struggling right now and could use some advice I just feel lost right now.",
            "Q_score": 28,
            "Id": "11ydsjq",
            "Url": "https://www.reddit.com/r/Advice/comments/11ydsjq/i_lost_my_best_friend_in_a_car_accident_two_weeks/",
            "Aswer": "old man here... your dad, is wrong.\n\nit's a left over of a time where men were to stupid to allow life to actually be life.\n\nyou feel what you must, do what you must, just ignore his stupidity and ignorance of a time that should be long gone",
            "A_score": 27
        },
        {
            "Question": "How would be the best way for me (18 F) to talk to my boyfriend (18 M, who is circumcised) about not wanting to circumcise our son?\nHello everyone, me and my boyfriend are going to have a baby soon and we've never talked about this before so I'm not really sure how he feels, I could be overthinking things and be worried for nothing. But even so, I'd like to hear some other men's thoughts on this before I bring it up him if I can, thank you for any input.\n\nI don't want this to be too long so I'll just give a brief explanation. I'm a woman and I do not want to circumcise our son. My boyfriend is circumcised (not for any cultural or religious reasons, we live in the US so it's just the norm) and I'm worried if I bring this up and tell him my reasons for not wanting to he could be hurt or insulted. This would never be my intention and I wouldn't say anything that could be offensive on purpose, but I'm worried I may come off that way. This is really important to me and I don't want to just not talk about it because when the baby is born and the time comes to make a decision it may cause issues if we aren't on the same page.\n\nI'm writing this here because I'd like to hear from men how they feel about this or would feel if their girlfriend brought this up to them and how would be the best and most sensitive way for me to bring this up and explain my reasons for not wanting to circumcise our son? Has anyone ever been in this situation and if so how did you feel about it and do you wish the conversation went differently?\n\nAgain I may be overreacting and he could have no opinion or feeling about this at all lol, but I want to be prepared and mindful just in case! Thank you again for any input, sorry this ended up being long!",
            "Q_score": 107,
            "Id": "11xs92r",
            "Url": "https://www.reddit.com/r/Advice/comments/11xs92r/how_would_be_the_best_way_for_me_18_f_to_talk_to/",
            "Aswer": "It's a two yes, one no type of deal. You both have to agree to it, but if one person says no, it's a no. Body mutilation on someone who can't consent is pretty freaking bizarre when you think about it, so I would say \"let's wait until our son is old enough to consent, and then we can ask him what he wants to do\"\n\nedit: also, as a man, I want my foreskin back",
            "A_score": 174
        },
        {
            "Question": "I’m a male survivor of SA and I’m struggling to cope with it.\nHey all I’m not quite sure what to say here but I’ll just get to it. So I’m guy in my 20s who grew up REALLY religious. As a kid we had a close family friend who I’d spend many nights at his house and he at mine. On a few occasions his older cousin in her teens baby sat us when our parents went out or did events with our church. His cousin was also a member of our church and his family had a lot of prestige within our parish. \n\nWith that as the backdrop, when she would baby sit us she’d let us play and do whatever. But after a while she would call us down to the family computer and porn would be one. She’d have her hand in her pants and call us over. She’d then have me and my friend do things to each other, to her, and she’d do it back to us. It felt good to me but I knew it was wrong, even at 9 years old. She told us not to tell anyone or else our parents would get kicked out of the church. \n\nThis same pattern went on when I was well into my teens until we no longer needed a baby sitter. During puberty this was especially confusing because I didn’t like men but was forced to do sex acts on my friend. Adding to that, i also lost my virginity to her and felt so impure. I didn’t date anyone in HS because of this. I felt undeserving of love and confused about my sexuality. \n\nI experimented plenty when I went off to college and don’t really have ties to the faith anymore. There is still a level of catholic guilt that I don’t know if I’ll ever escape but that’s not all that present in my thoughts these days. The first girl I opened up to about my past left me because I was “with a man” and I just don’t know that I ever will be willing to be vulnerable like that again. \n\nI guess the reason for this post is to ask if anyone out there has had a similar experience and how you manage? I’ve done therapy in the past but can’t afford it at the moment. \n\nI also want to explore my sexuality further but have a lot of trust issues. Is there a place on Reddit to do so? The anonymity here provides me some comfort and this and r/sex sub was the first place I figured I should look.",
            "Q_score": 73,
            "Id": "11xqtg5",
            "Url": "https://www.reddit.com/r/Advice/comments/11xqtg5/im_a_male_survivor_of_sa_and_im_struggling_to/",
            "Aswer": "I don't have the experience or many answers you seek but hopefully others will jump in with some.\n\nThat's horrible what you went through and I'm sorry that a person you trusted to share this with was unable to handle the trauma you've suffered. \n\nQuickly, \"with a man\" doesn't count unless you want it to count. In my book, that which is done to the defenseless cannot be held against them in anyway against their wishes.\n\nGood luck, I hope you find the support you're looking for.",
            "A_score": 48
        },
        {
            "Question": "Me and my boyfriend of 5 years are going to break up tomorrow, I know I'm headed toward a long journey of different emotions. I could use some advice on how to approach this.\nAnyone here has been through this? It's my first relationship. I could use some advice on how to handle things after he's gone. I could also use some support rn. thank you\n\nAnd no working on the relationship is no longer an option\n\n&#x200B;\n\nEdit: Absolutely appreciate all of you for taking the time to write your replies, truly your words mean a lot right now. Thank you all ",
            "Q_score": 24,
            "Id": "11xyo62",
            "Url": "https://www.reddit.com/r/Advice/comments/11xyo62/me_and_my_boyfriend_of_5_years_are_going_to_break/",
            "Aswer": "There will be moments you miss him and moments you regret the breakup. Just understand it’s done and the more you look back the harder it will be to move forward. \n\nClean breaks are always the best, and don’t be harsh on yourself. Treat yourself well both in how you speak to yourself and what you do to relax.",
            "A_score": 47
        },
        {
            "Question": "Finally had the courage to talk to my gym and im so embarrassed\nI’m 25 (f) I’ve been seeing this guy every time I’m at the gym for the past few months, we’ve made eye contact with eachother and even cracked a smile passing eachother but never had a conversation…well today I walked over to the back machines and he followed me and got on the machine next to mine. When he finished his set we made eye contact and I said “I sure do see you here a lot” he laughed and said “yeah its like we’re on the same schedule” we had small talk..found out he’s in college and I told him I work for the government and he mentioned he had a brother that does the same thing. Well he ended up just saying “it was nice to meet you” I was sure he was going to ask for my number he he didn’t…maybe he’s not interested ? Or should I just leave him alone ?",
            "Q_score": 30,
            "Id": "11xvbym",
            "Url": "https://www.reddit.com/r/Advice/comments/11xvbym/finally_had_the_courage_to_talk_to_my_gym_and_im/",
            "Aswer": "Since you see each other on a regular bases at the gym, there was no need for him to hurry. In this situation, I wouldn't have asked for your number during the first conversation either, since there is plenty of opportunity.",
            "A_score": 90
        },
        {
            "Question": "I'm not interested in anything career-wise.\nI (25F) have been largely unemployed for three years. I had a job briefly but they laid me off and I haven't been able to find anything else since. Like, *anything* else, not even retail jobs or call centers or anything like that. I've gone back to school but I don't even like the program I'm in, I just didn't know what else to do. I could drop out but that would look bad and I don't know what I'd do instead.\n\nI ask for help finding a job and people ask me \"well, what do you want to do?\" and I never have an answer, so they tell me they can't help me. I go to career fairs and networking events and everyone expects me to be eager about whatever industry the event is about, but I'm not. I can't even pretend to be. I don't really \\*want\\* to do anything, I just need a job, hopefully one I don't hate and that will give me stable income. All my friends have at least some idea of what sort of work they want to do (to the extent that people in their 20s do at least) but I don't have that. Even my college major I chose based on what I'm good at, not what I'm interested in. Because again, I'm not interested in anything so what else was I supposed to do?\n\nI just have no career ambitions at all and people are treating me like I can't do anything until I have them. But I can't just sit around waiting to suddenly be interested in something. I don't know what I'm supposed to do.",
            "Q_score": 22,
            "Id": "11xsi5j",
            "Url": "https://www.reddit.com/r/Advice/comments/11xsi5j/im_not_interested_in_anything_careerwise/",
            "Aswer": "My last 2 jobs i never thought to  make a career in, it just happened.\n\nIm not passionate about data analysis or bookkeeping, but i am passionate about my life outside of work. I look for jobs that allow me to live the life i want.",
            "A_score": 23
        },
        {
            "Question": "[18f] [18m] my boyfriend won’t get the surgery he needs for his dick\n\nWe’ve been going out a year and a half now. One thing with my boyfriend is that his dick, or specifically the band on the back of the head the “frenulum” frequently tears. \n\nWhen we first started having sex it would tear in any position. But now he goes extra gentle (which gets annoying) and it’s fine but when I ride him there’s a good chance it tears so I have to feel bad every time I want to go that. \n\nAnd every time it happens we have to wait a week or two for it to heal before he can use it again. I would there’s seriously like a 30% every time I ride him it’ll tear and a 5-10% that if he’s doing it it’ll tear. \n\nI googled and there’s surgery you can get to lengthen the band so it stops tearing. But apparently there’s a slight chance it’ll reduce sensitivity in the dick because the frenulum is pretty sensitive. \n\nHe said he’s not losing feeling in his dick so he won’t get it. I ask what he plans to do then and he said nothing, like literally he plans to do nothing.",
            "Q_score": 514,
            "Id": "11wxnd0",
            "Url": "https://www.reddit.com/r/Advice/comments/11wxnd0/18f_18m_my_boyfriend_wont_get_the_surgery_he/",
            "Aswer": "This is his body.... he has every right to say no to this surgery. Just like you have ever right to leave the relationship if the sex isn't how you want it.",
            "A_score": 2150
        },
        {
            "Question": "What should I do with people that wouldn't leave me alone in the gym at night?\n\n\nI [M27] am a, although thankfully functional, neurodivergent person.\n\nI am not comfortable around people and I relax and calm myself through repetitive behaviour.\n\nFor this reason I love going to a nearby 24/7 gym and at night. I can use the same machine for one or two hours (I usually take three hour sessions in total) without anybody else waiting for me to finish and often there isn't anybody else in the first place. (Mostly running or other repetitive things).\n\nRecently I have been approached by people that are making me very uncomfortable. They insist on asking questions about me, my work, my salary and don't seem to take kindly me not willing to answer al talk at all. They grab stuff from my bag (like my brush when I am done with it, they then use it on their own hair and give it back to me but it still grosses me out and it's unnerving).\n\nI just want to be left alone, but I don't want to lose the place that has been my coping mechanism for so long.\n\nWhat should I do?",
            "Q_score": 34,
            "Id": "11xgqq8",
            "Url": "https://www.reddit.com/r/Advice/comments/11xgqq8/what_should_i_do_with_people_that_wouldnt_leave/",
            "Aswer": "Grabbing your brush is not normal behavior. \n\nIt is acceptable for you to firmly state \"Put that back. Do not touch my stuff.\"\n\nIf you don't feel comfortable doing that, tell the staff. \"These people keep harassing me and taking things out of my bag. I don't want them to. Please make sure they leave me alone.\"\n\n&#x200B;\n\nIt's also okay to say \"I prefer to work out alone.\" and put your headphones back on. Even if you're not listening to music, you can play a podcast, some white noise, whatever you want. Or just leave them on so people see them and realize you aren't interested in hearing them.",
            "A_score": 60
        },
        {
            "Question": "Is it irresponsible to hit a dab pen if you’re the only one watching your kid but they’re asleep?\nI thought it might help me relax, so I hit a dab pen that I keep safely put away in a box at the top of my closet where you’re supposed to put hats. I rarely ever use it and it’s been about 6 months since I hit it. Anyway, I wasn’t expecting to get as high as I just got from one hit. Now I’m thinking there’s a small chance my daughter might wake up, and I don’t know if this was an irresponsible move. I have everything around here taken care of, and I’m not struggling to get by or provide, but yet getting high just now has made me question all of that and wonder if I’m even fit to be a parent. \n\nI’m sure I’m just high and it’s actually not that irresponsible, because I’m not impaired or unable to look after her if she wakes up, but I need a little bit of reassurance. My mom called a few minutes after I got high. Everyone always acts so concerned about me, and they always give me advice on what to do and check in on me, because they all think I’m not cut out to be a single parent. None of my family or former in laws trust me at all. That’s the only reason my mom called, and that made me start to wonder if maybe they’re all right about me. I think this was a minor mistake, I didn’t know I was going to get as high as I did, but I don’t think this was irresponsible. Was this pretty bad and a sign that they’re right, or not that big of a deal? If I wasn’t high I would probably be able to know, but I can’t work it out at the moment",
            "Q_score": 22,
            "Id": "11xi2i9",
            "Url": "https://www.reddit.com/r/Advice/comments/11xi2i9/is_it_irresponsible_to_hit_a_dab_pen_if_youre_the/",
            "Aswer": "If you're too high to respond responsibly to an emergency, then yes. That would be irresponsible.\n\nCompare it to alcohol. It's fine to have a beer at the end of the day right? You're still sober enough to drive or make important phone calls. If an emergency comes up you'll still be able to be the responsible adult as long as you don't get drunk.\n\nSame with weed. Keep it mild enough that you'd be safe driving (and don't give that \"I drive better when I'm high\" BS, I hope you aren't one of those types)",
            "A_score": 119
        },
        {
            "Question": "My husband cheated on me and then left me for his affair partner. How do I recover from this?\nI (28F) was married with my husband (35M) for 3 years, together for 6 years total. He was the first person I dated. I absolutely adored him. He was the love of my life, my best friend, my life partner. It's sad to say, but I thought he would be the last person on earth to cheat. But here we are.  \n\nI've had so much issues with my mental health since finding out about the affair. I feel so naive. I trusted this man 100 percent. He always portrayed himself as someone with a high moral compass. I remember him expressing how much disdain he has for people who cheat. I did sense something off about him and this girl. I confronted him about it and he managed to look me in the eye and deny everything. He looked me in the fucking eye and told me he loved me and only me. That he would never cheat on me. Only for me to catch him a week after. And then subsequently, leaving me for his affair partner. I just can't imagine trusting anyone again. \n\nFor people who have gone through the same situation, how did you recover?  \n\nEdit: I feel so moved by everyone's responses. Thank you so much for the kind words, advices, perspectives, and stories. I hope to be at a better place in the near future. I'll do my best.",
            "Q_score": 68,
            "Id": "11x7pe9",
            "Url": "https://www.reddit.com/r/Advice/comments/11x7pe9/my_husband_cheated_on_me_and_then_left_me_for_his/",
            "Aswer": "You thank your lucky stars that you found out now and did not waste anymore time on this douchebag. You get a good lawyer and take him to the cleaners. And then you take a well-deserved vacation and live happily ever after because you are free of someone who obviously didn't care about you as much as you cared about them.\n\nBe free.\nAnd love yourself enough to not waste another tear on this dirt bag.",
            "A_score": 82
        },
        {
            "Question": "my bf's friend sent videos of his gf performing sexual acts on him to my bf and his friends without her consent... help\nMe (f25) and my boyfriend (m29) have been talking for half a year and dating for a month. In conversation, my boyfriend nonchalantly brought up that his friend (m29) had sent him and his other friends videos of his girlfriend performing oral sex on him through snapchat. I asked if this was consensual and he said no, probably not. I flipped out and said this is a crime and so deplorable etc. and my boyfriend was like \"I didn't expect you to react like this.\" I told him that I couldn't date him if he thinks that's okay and he said that he didn't think it was okay but it wasn't his place to say something since it happened 5 years ago. My boyfriend doesn't want to give up his friendship with this person saying that he's been there for him through some tough times and everyone makes mistakes. To me, this is not a mistake, this is a CRIME. Not to mention he did it multiple times. I'm disappointed in my boyfriend for not saying anything and continuing to be this disgusting man's friend. Not to mention, the guy is still dating this girl and she most likely has no idea! I care about my boyfriend so much but I didn't expect something like this from him at all.\n\nAm I overreacting or am I right? I want my boyfriend to stop being friends with him or at least call him out on it, even if it happened years ago. Would this be a justifiable reason to break up with someone even though he wasn't the one who did it?",
            "Q_score": 169,
            "Id": "11wx9x1",
            "Url": "https://www.reddit.com/r/Advice/comments/11wx9x1/my_bfs_friend_sent_videos_of_his_gf_performing/",
            "Aswer": "Tell the girlfriend. She deserves to know what happened and if she already knows then you can have a conversation about consent and hold men responsible for treating women like actual people instead of using them like inanimate sex dolls. \n\nAt least take a break from your current boyfriend. He's never thought twice about this behavior and won't realize the humanity of women immediately. You're right to freak out because it's a crime but give him some time to see why. It actually hurt and demeaned someone his friend is suppose to love and care for.",
            "A_score": 184
        },
        {
            "Question": "I am a piece of shit.\nHey guys throwaway for obvious reasons. I cheated on my now fiancee when we first started dating(6 months in) almost 6 years ago now. It has only happened once. I was so scared of losing her. I'm a piece of shit for it. I never came clean about it. It was selfish.  It has never happened gain. We are engaged now soon to be married we bought a house together. I am gonna ruin her life by having her marry me (I feel at least). I want to come clean and try to live up to the person she thinks i am. We have been together since high-school. What should I do? Please help me even though I don't deserve it",
            "Q_score": 87,
            "Id": "11x2jmz",
            "Url": "https://www.reddit.com/r/Advice/comments/11x2jmz/i_am_a_piece_of_shit/",
            "Aswer": "I mean I’ll be honest- if this were my husband posting this I’d want him to keep it to his damn self lol. It was 6 years ago- and you clearly feel bad about it. There are a few things that would change my mind.. does she personally know the person you cheated with?",
            "A_score": 330
        },
        {
            "Question": "I got my gf pregnant\nSo Im 17 and my girlfriends 16 and she’s pregnant. We are so fucking dumb thinking that birth control alone would stop it from happening and we were careless. I know this is all my fault. What the actual fuck should i/we even do.",
            "Q_score": 776,
            "Id": "11whawo",
            "Url": "https://www.reddit.com/r/Advice/comments/11whawo/i_got_my_gf_pregnant/",
            "Aswer": "You both have to go talk to your parents.",
            "A_score": 1108
        },
        {
            "Question": "Found out my SIL is a possible groomer and my family wants to sweep it under the rug and act like everything is normal\nTLDR: Recently found out my SIL didn’t quit from her school/coaching position for the reason I was told and the real reason is that she was caught messaging a minor that she was coaching and my family wants to pretend it all didn’t happen.\n\nBackstory: months ago my SIL quit her teaching position at a small town school because the stress of it all was destroying her mental health, so she quit but quickly got a new job teaching at another school. SIL was also a coach for a high school team at the first school and is now looking at tying to be a coach again at the new school. \n\nProblem is all of this was a lie.\n\nThe real story is that she “quit” (told to quit or else they would fire her and put it on her record) because she was caught inappropriately messaging a boy on her team. My brother caught her the first time and told her to stop or he’d leave her and tell the school, well she didn’t quit and the school found out on their own.\n\nThing is though that she got another teaching position really soon after losing the first job and even after my brother told her not to, she is pursuing getting another coaching position at the new school. \n\nI’m being kept in the dark as to what was contained in the messages to/from the minor other than being told it was “inappropriate”, but my position is that a coach who is messaging a student at all hours of the night and whose relationship has cause a minor to have to start counseling is a predator, as she either groomed him or was attempting to. And while our family agrees that this behavior is predatory, they are more concerned about whether or not my brother will divorce her and are encouraging marriage counseling.\n\nI feel like I’m going insane here and I’m the only one taking this seriously, like yes it’s sad and unfortunate that my brother may lose his wife, but how are we not addressing that she GROOMED A CHILD and seems to be putting herself in the position to do it again.\n\nI just got off the phone with my mother and asked what the hell I’m supposed to do as Easter where our family will all get together is coming up, am I just supposed to treat her like nothing happened?!\n\nHer answer: yes\n\nAs a survivor of child sexual abuse, I’m not only offended that she’s being invited, but I’m pissed that it’s expected of me to treat her like she didn’t 1) attempt to cheat on my brother 2) attempt to cheat with a MINOR\n\nDoes anyone have any advice? I don’t know what to do, I’m considering not going to our typical family Easter because I don’t know if I can treat her normally and frankly I don’t want to. She has faced zero consequences for her actions, my brother stayed with her and she got a good job after she “quit”. Do I call the new school and tell them to ask around for what really happened at her old job?\n\nI’m sorry if this is all a mess to read, as I’m quite flustered after all this information was dumped on me and I seem to be the only one concerned about her actions and not about the status of their marriage. What do I do?",
            "Q_score": 58,
            "Id": "11x2neo",
            "Url": "https://www.reddit.com/r/Advice/comments/11x2neo/found_out_my_sil_is_a_possible_groomer_and_my/",
            "Aswer": "I'm not sure what to do about the new school, but an anonymous call wouldn't hurt, especially if she has nothing serious to hide. As for your family, I think you have every right to put your foot down and not attend gatherings if she's there and makes you uncomfortable. I know this sucks and puts you in a situation of \"choose me or choose her\", but there's 1. A possibility there is more to the story than you're being told, and 2. Yourself to protect in the long run no matter what. You have to be prepared to take that to whatever end is necessary for reason #2.",
            "A_score": 33
        },
        {
            "Question": "So my dog almost died yesterday and I don’t have the guts to see him anymore. I’m currently in school and don’t really want to go home cause I am scared like there is a pit in my heart. Anybody got advice?\nUpdate: I have hung out with my dog and felt 200% better. Thank you guys for all the love and support. This is my biggest post and I wish you guys all love!❤️❤️❤️",
            "Q_score": 163,
            "Id": "11wrv8c",
            "Url": "https://www.reddit.com/r/Advice/comments/11wrv8c/so_my_dog_almost_died_yesterday_and_i_dont_have/",
            "Aswer": "We, as people, have whole lives outside of our pets- school/work, friends, family etc \nBut our pets just have us. We are their world, their happiness and comfort. \nGo see your dog and give him the comfort he needs;  the same comfort that he’s always given you.",
            "A_score": 215
        },
        {
            "Question": "how do I stop my friend from talking to this much younger girl?\nMy friend will be turning 18 within a month. She met a girl in a party, they had a making out session and she really enjoyed it. She's gay but that's the first girl she ever hooked up with. Since then they've been sharing some spicy texting and plan to hook up again. The problem is, the girl is 12.\n\nI already told her she should find someone a bit older, maybe 15, and to please stop talking to that girl and not hook up with her. But she's been walking around with some bad influences who told her it's okay, it's not a big deal, that girl hooked up with someone who's 20 before (needless to say they do similar stuff and make out with people much younger and much older). \n\nI don't know what to do. She's a very sweet and almost naive girl, but this is just wrong. A 12yo shouldn't be hooking up with randoms at parties much less a goddamn 18yo, no matter their character.\n\nedit: I can't call the cops on her, first because I DON'T want her to get in trouble, I'm trying to keep her out of it. Besides, age of consent is a thing people overlook around here specially since they haven't even had sex. Adult men impregnate tweens and no one bats an eye.\n\nI can't talk to parents either, specially her parents. Her mom is super strict, super homophobic and quite literally insane. If she finds out about her sexuality she will probably kick her out or spank her and forbid her from having any contact from the outside world for life. That's not what I want. I don't want to punish her, she doesn't even realize what she's doing, I want her to stop from doing something that'll fuck her up or this girl.",
            "Q_score": 109,
            "Id": "11wnnng",
            "Url": "https://www.reddit.com/r/Advice/comments/11wnnng/how_do_i_stop_my_friend_from_talking_to_this_much/",
            "Aswer": "If your friend thinks hooking up with a 12 year old is okay, then you should probbably report them to the police",
            "A_score": 386
        },
        {
            "Question": "How to quit my therapist who has been very helpful but we have very different values.\nI’ve been seeing my therapist for about 3 years now. She’s helped me tremendously over the years through several big life situations. However, several red flags have come up that I just can’t shake and I think I need to part ways: \n\n1) I fall in the middle of the road (but leaning more towards caution) with COVID. I got my shot, I masked when masking was required and followed the guidelines. She is very anti-vax and makes it clear that she doesn’t believe COVID is a big deal. Regardless where anyone falls on the Covid scale, her being so vocal to me about her thoughts somewhat pushed me to alter what I would talk to her about, if it involved something Covid-related. \n\n2) I was taking to her about someone who I have some conflict with. She asked me if they are “re***ded”. Not in a way of thinking they really could have Down syndrome, but in a derogatory way. I am passionate against using that word. \n\n3) Last session, when I showed up, I was outside because a fire alarm went off. Once it was all clear, my therapist and I went inside and she said she was “literally saved by the bell because she was having to listen to a client who goes on and on - and won’t stop talking.” It put me off that she’s down talking a client of hers. \n\nI’m a bit of a baby when it comes to conflict and would love some advice on how to stop seeing her, in a way that is not massively stressful.",
            "Q_score": 103,
            "Id": "11wjgoe",
            "Url": "https://www.reddit.com/r/Advice/comments/11wjgoe/how_to_quit_my_therapist_who_has_been_very/",
            "Aswer": "Your relationship with her is a business relationship. In other words, you owe her nothing. You can just stop going and leave it at that. \n\nIf you want to let her know that's fine, but she sounds like the type who might try to talk you out of it.",
            "A_score": 146
        },
        {
            "Question": "My wife just dropped a truthbomb I can't handle\nAfter almost 6 years of being together and getting married this winter, my wife just came out of left-field with a truthbomb I can't cope with. She essentially worked out in therapy that she's always loved the idea of me, but doesn't know to what extend she actually loves me. \n\nShe has a lot of unresolved youth trauma and never had counseling. She's always \"latched on\" from bf to bf before we got together, which according to her psychiatrist is because of the feeling of not having to go at it alone - something she's had to do all her life as her parents were.. preoccupied. I practically had to force her into therapy.\n\nLast week I've been told she's trying to work out where she stands, because living like this has gotten her numbed off and desperate. She's getting anti-depressants today, and confessed that she just wants to be alone right now. She went as far as preparing me that depending on how the next few months go for her in terms of developing a sense of self, we might not be married anymore by (what would've been) our first anniversary. If she realized she does not love me like that after all, she might decide it's too hard to leave anyway. I just don't see a way where you don't known if you love someone you married 4 months ago, but after a few bouts of therapy you realize you do..\n\nI realize I played a big part in this because she's always had issues expressing herself and I figured it'd get better with time. I guess this is her expressing herself, just not the way I imagined it would go. There are so many questions I can't even begin to ask her, because she doesn't know the answers for herself let alone how to convey them to me. My world's just been shattered, and I'm supposed to keep truckin' on like nothing happened. I can't get any work done, I have a constant feeling of dread pitting in my stomach and I just want to shut down. My boss has been so kind to allow me to WFH for a few days to gather myself, but as I can't focus I'm afraid they'll think I'm just loafing around.\n\nWhat hurts me the most is thinking about our weddingday, when I was bawling my eyes out on for the love of my life and she just went through the motions because that was what was expected of her..\n\nI'm expected to give her space, but all I want to do is crawl in bed next to her and cuddle all day. But the tighter I grip the harder the pulls away. Am I just looking away from the inevitable? I feel like this is the beginning of the end.. How do I get anything productive out of my hands ? How do I stop from spiraling myself out of control ?",
            "Q_score": 69,
            "Id": "11wkrps",
            "Url": "https://www.reddit.com/r/Advice/comments/11wkrps/my_wife_just_dropped_a_truthbomb_i_cant_handle/",
            "Aswer": "Oooof that must have been incredibly painful to hear.\n\nThe thing with therapy is that it drags up all kinds of things and you start questioning everything. On one hand it’s great that felt able to tell you how she’s feeling and on the other hand her doing that has completely eroded your own sense of safety in your relationship.\n\nI think you should have another conversation and have some set check in conversations over the next few months. You obviously don’t want to continue feeling this way indefinitely (who would?), but it’s also going to take her some time to organise her thoughts and feelings. Right now she’s at a stage where she’s recognising historical patterns of behaviour and is figuring out where your relationship fits within that.",
            "A_score": 67
        },
        {
            "Question": "my family is trying to blackmail me with porn from when i was of the ages 8-16\nits a lot that goes into the story but recently i came into a lot of money and my family wants to use these videos as a way of getting money out of me and trying to damper my image. the videos were not recorded with consent and i was not of age when they were recorded what can i do? im going to get a lawyer but i really need ease of mind that this is not going to hurt me. mind you my entire family has the videos not just one person.\n\nedit: hello i just wanted to add that i used to have actual evidence of the abuse but they broke my phones and beat the shit out of me to delete the evidence. they've edited me into literal child porn videos where i was not physically there. they've used voice editing apps to fake me \"confessing \" to child abuse. they have videos of me crying and going on rampages after the abuse. i know there will always be someone out there who doesn't believe me but to those who do i thank you a lot. i didnt expect over a hundred people to come and actually believe me. im so used to people calling me a liar and pouring salt on fresh wounds! when i eventually get this case on the move which will be soon i will keep you guys updated! this is also a throwaway account just in case my family finds this because they do know i browse reddit. \n\nany other advice or tips on how to navigate this situation is greatly appreciated! thank you everyone for listening to me and supporting me! my mind is kind of frazzled right now so im sorry if this message is wonky.",
            "Q_score": 995,
            "Id": "11vzz6x",
            "Url": "https://www.reddit.com/r/Advice/comments/11vzz6x/my_family_is_trying_to_blackmail_me_with_porn/",
            "Aswer": "I'm not a lawyer but there are two obvious illegal things here, blackmail and possession of child porn. If you have proof they're trying to blackmail you you can just go to the police.",
            "A_score": 1972
        },
        {
            "Question": "I called the police on my stepdad after he pushed my twin sister down the stairs. Now my mothers mad at me for supposedly ruining her life.\n\nHello everyone my name is Ella I’m 15 years old. My parents are divorced and my father has primary custody and we are with my mother every other weekend. My twin sister Mia and I are extremely close and always have been. \n\nMia is gay and that’s the main reason my stepfather has been mean to her ever since he met her but Saturday he crossed a line. I’ve talked to my father about how my stepfather behaves towards my sister and he’s had multiple conversations with my stepfather telling him to quit some of which have gotten very heated. Most of what he’s been doing is calling her names and being very rude and disrespectful towards her. \n\nSaturday my sister had just gotten out of the shower she had gotten dressed walking out of the upstairs bathroom which is a few steps away from the top of the stairs. My mom and stepfather’s bedroom right beside it. As my sister was walking out of the bathroom she had turned to walk down the stairs when my stepfather came out of the bedroom. He called her a homophobic slur then pushed her from behind and sent her falling down the stairs. \n\nI ran to check on my sister and aside from a broken arm and busted lip she was ok. I then called 911 and asked for the police and an ambulance. The police arrived first and I told them what had happened and they arrested my stepfather for aggravated battery. The ambulance arrived not long after to take my sister to the hospital. I rode in the ambulance with my sister and called our father who met us at the hospital. \n\nMy sister is ok they took X-rays and checked her for other injuries then put a cast on her arm that she’ll get off in about two months. They kept her overnight for observation then sent her home the following morning. So she’s going to be just fine. \n\nSince then my mother has been calling me nonstop and sending me text messages telling me that I ruined her life and should be ashamed for calling 911 and not giving her time to make up a story before taking my sister to the hospital. My father has called my mother and told her to knock it off and that she’s lucky the police handled my stepfather and not him. It’s safe to say that we won’t be having to stay with my mother for awhile if ever and my sister and I both are happy about that. I have my mothers number blocked and so does my sister. \n\nI just don’t understand how someone can be so hateful. I don’t feel like I did anything wrong but I could use some advice.",
            "Q_score": 348,
            "Id": "11w7jaw",
            "Url": "https://www.reddit.com/r/Advice/comments/11w7jaw/i_called_the_police_on_my_stepdad_after_he_pushed/",
            "Aswer": "You should be very proud to have handled this situation so well at a young age.  You were 100% correct to call the police.  \n\nYour mom is in the midst of an enabling dysfunctional relationship.    She can’t see straight right now.",
            "A_score": 410
        },
        {
            "Question": "I almost cheated on a work trip. What do I do now?\nI’ve been together with my girlfriend now for 3 years and I wouldn’t trade it for anything. I’ve been so happy with her and I genuinely find a future with her. \n\nI was out on a work trip for a week and met this wonderful lady at the event. We spent some time together between our crew and theirs and had a couple nights out of drinking. Some sexual innuendos came from her to me, such as “I’d love to cuddle with you” and “if you roofied me I wouldn’t mind”. \n\nI don’t know why but for some reason this turned me onto her but I was feeling uneasy about the situation too. On the last night her, my coworker, and I were in her hotel room talking for hours. After we left, she texted me and was asking if I was single. (Obviously hinting to hooking up). Never have I felt more tempted to get up, knock on her door, and spend the night. But I didn’t, I told her about my relationship and she was very happy for me and understood my position.\n\nIt is now the next morning and I feel like I am regretting not getting up and going to her room. I don’t know why, I’ve never been in this situation before, no other woman has came onto me like that. I don’t know how to feel now.\n\nDo I tell my girlfriend about my experience? Should I just keep it to myself? What should I do if I see her again?",
            "Q_score": 248,
            "Id": "11w8v3g",
            "Url": "https://www.reddit.com/r/Advice/comments/11w8v3g/i_almost_cheated_on_a_work_trip_what_do_i_do_now/",
            "Aswer": " “if you roofied me I wouldn’t mind”\n\nIs this how people flirt nowadays?",
            "A_score": 747
        },
        {
            "Question": "Boyfriend constantly not sure if he wants me\nLong story short:\n\nMe (26F) and my boyfriends (26M) were together for 2 years. Everything was ok the first 6 months. I fell into a horrible depression, that kind that makes not to be able to eat, sleep, stay alone. He was not supportive and cricitized me for taking medication and not doing things to get better. That was just a month or two. He also confessed that has thought about separation and couldnt stand the situation with me being depressed, because he was feeling ok and wanted someone that motivates him to be productive and do things. Also he left me alone after a panick attack at a doctor's appointment (I also had health issues, this being the main reason for my depression), because it was his lunch break and wanted to get back home to eat.\n\nFast forward I recovered quickly and forgave him. After 3 months he wanted again to separate because we had a routine and he didnt feel challanged by the relationship. We stayed together.\n\nFast forward again after 6 months he wanted again to separate and start telling that he doesnt know what he wants. He also said he wanted separation and after 5 min said he didnt. We stayed together.\n\nAgain fast forward 2 months I felt he  has changed behaviour and asked him if moving together was still on the table as we decided a month ago. He said no, I am not the girl he sees his future with and also he has seen his high school love with whom he had been in a \"relationship\" for 3 weeks and compared feelings and the ones for her were stronger. I broke up with him.\n\nHe begged me to stay, promised he will change, came to see me in the hospital, was extremely nice to me, said to move together. I forgave him.\n\nFast forward 2 weeks later(he was very nice and caring)  I made a joke that I want to eat meat again (we both dont eat meet). He said he wanted to break up, that he had these thoughts about not knowing what we wants again. After 5 min he regreted and wanted to stay together. I left.\n\nNow he tells me to forgive him that he loves me and doesnt know why he behaves like this and he is depressed.\n\n\nOpinions are welcomed:)",
            "Q_score": 54,
            "Id": "11wg0tj",
            "Url": "https://www.reddit.com/r/Advice/comments/11wg0tj/boyfriend_constantly_not_sure_if_he_wants_me/",
            "Aswer": "This man sounds like he looks for any reason to break up. My question is: why do you stay with this man that makes it plain that you’re the back up plan?",
            "A_score": 134
        }
    ]
}