{
    "Posts": [
        {
            "Question": "Neighbor called police on me for staying indoors too much\nI work from home, and before this happened thought I went outside a regular amount. I've been doing errands related to stuff around the house since I moved here 3 months ago, pretty routinely, and went out (and back) several times in the last day alone for several things. I check the mail nearly every day. I put the trash and recycling out. I get groceries and packages delivered constantly, have had furniture delivered, and have mowers who come regularly.\n\nYet this morning a police officer came, and apparently a neighbor \"hasn't seen anyone come or go for weeks.\"\n\nI didn't introduce myself to my neighbors when I moved here because, well, I'm shy.\n\nIs a neighbor watching me so intently that their inability to peg a 9-5 schedule for me made them suspicious? Am I missing something?",
            "Q_score": 1846,
            "Id": "12cly71",
            "Url": "https://www.reddit.com/r/Advice/comments/12cly71/neighbor_called_police_on_me_for_staying_indoors/",
            "Aswer": "I work 3 different jobs and am relatively busy. \n\nI took a week off to just relax and didn't go out for 2 days. Someone called in a wellness check to the police because they didn't see me for 2 days. \n\nLike, what if I went on vacation and left my car parked? Am I required to let people know I'm gone? \n\nMade me uncomfortable OP. I get how you're feeling.",
            "A_score": 1365
        },
        {
            "Question": "Neighbors keep going through my trash. Want to put something in there to scare them. Any idea’s?\n",
            "Q_score": 204,
            "Id": "12czcsr",
            "Url": "https://www.reddit.com/r/Advice/comments/12czcsr/neighbors_keep_going_through_my_trash_want_to_put/",
            "Aswer": "I picture of them going through your trash taped to the inside of the lid with \"Why?\" Written on it.",
            "A_score": 553
        },
        {
            "Question": "My son’s father wants to “come back into his life. “\n&#x200B;\n\nSo I divorced my husband when my son was six years old (he is 19 now), and from then, his father didn’t bother to spend time with him. It was pretty tough because I decided to learn some “boyish“ activities, such as surfing, fishing, and hunting, so that I could sort of be like a father to my son and engage with him in a certain type of “son and father activities. “ I never liked any of those, but I did them for my son, so it was tough to raise him, and the fact that his father didn’t even spend the weekends with him made it worse. So my son was diagnosed with leukemia recently. His father found out (not like I was trying to hide it from him, but I didn’t tell him myself because I knew that it wouldn’t help in any way.), so today he called me and told me, “I want to be a part of his life, I always loved him, you we’re the only thing which kept me from my son. “ \n\nSo to make things clear: when I was 21, and his father found out I was pregnant, he insisted on an abortion, and I refused to do it, and he got outraged and emotionally blackmailed me, later when we married (he was from a strict Christian family so he begged me to marry him because his parents would “kill him“) (and no his parents didn’t know that he wanted me to abort my son, they would be pretty mad if they ever found out), so when my son was born he started to cheat regularly. Eventually, it led to divorce, and I started raising my son alone, with zero support. And no, I never stood against him meeting his father. I begged him to spend time with him, but he didn’t; he married the person he used to cheat on me with, had kids, and never even wanted to recognize his son as his’s. At this point, I don’t know what to do; my son has cancer, and meeting his father and finding the truth would be tough. He is already going through lots of stuff, and “reconnecting” with his father would worsen it. So I don’t know if I should let him into my son’s life…",
            "Q_score": 237,
            "Id": "12cenw5",
            "Url": "https://www.reddit.com/r/Advice/comments/12cenw5/my_sons_father_wants_to_come_back_into_his_life/",
            "Aswer": "I will start by saying that your ex-husband has failed as a father. If he truly wanted to see his child, he would have tried. If you were keeping him from seeing his son, which I doubt, there is a legal process he could go through for visitation.\n\nAs for letting him into your son's life, unfortunately it's really not up to you anymore to decide. Your son is 19 and is recognized as a legal adult in most countries. So, in this situation it's up to him to decide if he wants to give his father a chance. The best thing you can do is be open and honest with your son about how you feel about his father. I hate to say this but your ex sounds highly manipulative and might try to make you look like the bad guy if they do meet so be prepared for that.\n\nGood luck.",
            "A_score": 241
        },
        {
            "Question": "Update: I'm getting a series of cosmetic surgeries and my boyfriend is acting like I'm going to pass away\nHere is the original post: https://www.reddit.com/r/Advice/comments/125zmj8/im_24f_getting_a_series_of_cosmetic_surgeries_and/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button\n\nI ended up delaying the surgeries, at least untill I had spoken with a therapist to double check my mental state. I hadn't told my boyfriend yet when he asked me to talk.\n\nHe sat me down and told me that he couldn't stay silent any longer. He says he can't support me in changing my face and skin \"without any good reason\". Also he thinks I am \"risking my life for nothing\" and \"ruining myself, when I'm a perfectly normal and beautiful girl\".\n\nHonestly I was crying by that point, then he asked me if I didn't think that he likes me and why his opinion worth less than the opinion of random people. I told him that I know he loves me, but I couldn't answer the second question.\n\nHe was happy to hear I had delayed the surgeries, since he doesn't want to break up, but he can't promise me he could love the new me.\n\nKnowing all this, I don't think I will have the surgeries done. I love my boyfriend more than I dislike my looks. He is now helping me to find a good therapist that helps me to feel better.",
            "Q_score": 21,
            "Id": "12cyvgx",
            "Url": "https://www.reddit.com/r/Advice/comments/12cyvgx/update_im_getting_a_series_of_cosmetic_surgeries/",
            "Aswer": "well, that's good.  The therapist is a really good idea, unlike bichectomy, which is a terrible idea",
            "A_score": 22
        },
        {
            "Question": "I can’t get my bf off his phone and it’s ruining our relationship\n \n\nI’ve been with my boyfriend now for 5 months and we’re generally very happy. We don’t fight, we have similar interests, and he treats me well.\n\nHOWEVER, he has become addicted to his phone over the last few years. Twitter specifically. He sits and scrolls for hours on end and it’s gotten worse since the pandemic.\n\nIt’s really taken a toll on our relationship. It makes him lazy, uninterested in conversation, and highly distractible. We used to have so much fun doing activities and having stimulating conversations. Now it’s almost like he isn’t interested in the same things anymore outside his phone.\n\nI want him to change and for him to realize how it’s hurting our relationship, but I don’t want to make him feel like I’m controlling or judging him.\n\nHas anyone experienced something similar and successfully dealt with it?",
            "Q_score": 24,
            "Id": "12ct2ph",
            "Url": "https://www.reddit.com/r/Advice/comments/12ct2ph/i_cant_get_my_bf_off_his_phone_and_its_ruining/",
            "Aswer": "I used to be in the EXACT same position as you. Unfortunately, so many people our age have become addicted to our phones. It has a significant impact on our relationships with others but also ourselves. Most people don’t realize it, but it rewires our brains to make us more lethargic and decreases our social capacity. I’m not surprised it’s an issue for you too.  \nThe way I fixed it was with this app [Present](https://apps.apple.com/app/apple-store/id1644737181?pt=125390894&ct=redditrelationshipadvice&mt=8) that turned staying off your phone into a game. You earn points, awards, and streaks + you can challenge others.  \nI went to my significant other with the app and said it could be a fun game we could play together to both be more “present” in our life. Next thing I knew they were motivating themselves to reduce their screen time and our relationship was basically back to normal within a few weeks.   \nThe key was I didn’t try to say “you need to stay off your phone more” or force them to install an app blocker (which don’t even work anyways). This way we were able to turn it into a game we could play TOGETHER.",
            "A_score": 16
        },
        {
            "Question": "Had sex with a man and am now full of guilt and disgusted by myself\nIdk how to start this so I'll get straight to the point.\nSo yesterday I (M 21) had sex with another man. I've never been attracted to men romantically or even sexually (I'm fact I've always been and am still attracted exclusively to women) but I suppose curiosity got the better of me.\n\nNow I'm overwhelmed by guilt, it was my first time having sex (I've never dated seriously either) and now I'm borderline disgusted by myself for what I did. I initially thought I might be gay or bi but I'm still not attracted to men in any way shape or form. In fact, even the idea of being with a man now actively disgusts me so I'm sure I'm straight.\n\nI'm sorry if this is coming off as homophobic, I'm not but I just needed to get this off my chest and if possible some advice on how to get over the guilt. Any help would be welcome.",
            "Q_score": 86,
            "Id": "12cbteu",
            "Url": "https://www.reddit.com/r/Advice/comments/12cbteu/had_sex_with_a_man_and_am_now_full_of_guilt_and/",
            "Aswer": "No point in feeling guilty over it, you wanted it at the time, went through with it and now you know you don’t enjoy it, it’s not as if you’ve done anything wrong so there’s really no point in beating yourself up.",
            "A_score": 232
        },
        {
            "Question": "Should I keep my virginity?\nI’m a 22F who wants to do it, but can’t help to wonder if any future partner would’ve prefered to be my first. Is virginity important to men or is it completely irrelevant? Am I getting too old and should lose it asap?\n\nI’ve never had a boyfriend (I’ve had multiple chances, but just wasn’t interested). Never been kissed properly either, I’ve only given out about 3-4 pecks at parties in my whole life. It’s not like I have the opportunity to lose it rn, but I’m sure it wouldn’t be a problem if I set my mind to finding someone to do it with.\n\nEDIT: This was NOT a request for dick pics. Of course I wouldn’t lose it to some random guy from reddit. Stop sending me dms offering to travel to wherever I live. Thank you.",
            "Q_score": 455,
            "Id": "12byonn",
            "Url": "https://www.reddit.com/r/Advice/comments/12byonn/should_i_keep_my_virginity/",
            "Aswer": "I (28f) just got in a relationship with a guy literally 4 days ago. He was shocked that I'm a virgin. But... you know what? He has been so freaking sweet about it. He wants to make my 1st time special, has been completely set about making sure I am comfortable, and asks consent for honestly way too many things. I wouldn't want to lose it to anyone else. That's when you know. There is no rush. You will find the right person. Don't rush into an awkward encounter to just get it over with. Find someone who cares about you because you deserve it. Don't settle.",
            "A_score": 635
        },
        {
            "Question": "MY friends secret is hurting my conscience. What do I do?\n**UPDATE 4/4/23 - To address all additional questions that people keep asking that's already addressed in this post!**\n\n* **I AM 100% SURE HE DOESN'T KNOW that she's MTF. Personally recently hired someone from the LGBTQ community that's FTM. When I met up with Jared lately to catch up we were discussing what's new in life and how business was. We came on the topic of the person I hired, and there were remarks made by Jared that made it quite obvious that he isn't pro LGBTQ.**\n* **We also discussed how common testosterone replacement therapy has became. I mentioned that I heard if you did TRT for awhile it makes you sterile. He said that he would wait until he was done having kids with Stephanie.**\n\n**I completely understand that it's not my secret to tell, and that she deserves the right to come out when she would like.**\n\n**To also address the question \"How do you know she's trans\". I did some digging and found actual proof that it's true before I even came to reddit to ask for advice.**\n\n**I'm not trying to be a hero. I'm considering both parties and just want to know that is the ethical/morally correct thing to do.**\n\n&#x200B;\n\nI need advice! (Names of ppl will be altered to conceal identity.)\n\nI'm a late twenties male dating a female by the name of Karen for roughly 4 years now.\n\nKaren has a friend name Stephanie that's MTF(Full transition)\n\nStephanie doesn't tell anyone that she's MTF ( Her privacy ).\n\nKaren only learned about this through a mutual friend that knew Stephanie before her transition.\n\nTherefore Stephanie doesn't know that most of us know that she transitioned.\n\nStephanie's currently dating a guy name Jared. **(HAVE DATED FOR 4 YEARS)**\n\nJared is a very nice/innocent guy that has no idea that shes MTF.\n\nKaren, Stephanie, and her friends want me friends with Jared since he doesn't have many.\n\nThe closer I get to him the more guilty I've became knowing this secret.\n\nIf you were in my shoes what would you do?\n\nDo I tell him? Do I talk to her about it? The reason it bothers me so much as well is that if I was Jared, I would want to be told if someone knew about this.\n\n(We accept her for who she is and have no problems with her transition)\n\nThank you\n\n&#x200B;",
            "Q_score": 270,
            "Id": "12btx3f",
            "Url": "https://www.reddit.com/r/Advice/comments/12btx3f/my_friends_secret_is_hurting_my_conscience_what/",
            "Aswer": "Heads up man, you only have this “information” second hand and it could easily be a bad intentioned rumor. This is really non-actionable and getting involved in others’ relationships is usually unwise.",
            "A_score": 669
        },
        {
            "Question": "I (F29) have no desire to have sex with my (M32) husband. I prefer my vibrator over him\nWe’ve been together for about 9 years. When we first met I was so in love with him and I desired him all the time. As we got older and life started happening the desire has went away. Things changed after I became pregnant. He stopped loving me and never wanted to have sex and  he desired other women. Of course that made me extremely insecure and confused because I felt like I couldn’t please him anymore. He made it very clear that he wasn’t sexually attracted to me. He’s admitted that around that time. He never looked at me or touched me. He would please himself knowing I would want to have sex. 4 years later we’re back to normal and we’re great together. We take care of our daughter, we laugh, pay bills, go for walks and do everything that a normal couple does and we rarely bicker about things but I have ZERO sex drive. When we have sex I just want it to be over. I’m not sure if I’m sexually attracted to him anymore now. I don’t want to hurt his feelings.\n\nI have a vibrator that I use 3x a week. I wake up, scroll for something to help with the urge and I’m done. I’m not even horny I just have the feeling to do it. I don’t think about the person in the video or another person or even my husband. My mind just completely shuts down and I’m just thinking about how good it feels. I just like to see the action. I’m not attached to anyone romantically while I’m masterbating. I just want to start my day off good. I just want to get it over with basically. Maybe I’m addicted to porn? I’m not sure but I have no desire for my husband anymore. I love him but every night I lay in bed with him I hope he doesn’t want to fool around. \n\nI’m not sure how to resolve this or if anyone has gone through this. I feel like I’ll be completely fine with not having sex ever again as long as I have my vibrator. Edit: I also suggested couples counseling but he does not like that idea",
            "Q_score": 122,
            "Id": "12bqp7c",
            "Url": "https://www.reddit.com/r/Advice/comments/12bqp7c/i_f29_have_no_desire_to_have_sex_with_my_m32/",
            "Aswer": "you guys haven't resolved the problems that happened 4 years ago.\n\ntry communicating.  \n\nyou cant have good sex if you are on the defensive, hiding, feel threatened, or have shit in the back of your head all the time.",
            "A_score": 295
        },
        {
            "Question": "I can’t stop being physically attracted to my ex\nI’m gonna make this short and to the point as best I can. Me and my ex broke up in October. So it’s been almost 6 months and still, I find myself thinking about her in that way.\n\nThe emotional attraction is gone. She did not treat me very well, and since then she has not left me alone even tho I’ve begged for no contact. I mostly ignore her as I figure it is the best for both of us. \n\nBut the thought does not leave my head. I want her in such a bad way, and it’s like I’m addicted to her only physically and idk how to break it. Any advice?",
            "Q_score": 41,
            "Id": "12c13m7",
            "Url": "https://www.reddit.com/r/Advice/comments/12c13m7/i_cant_stop_being_physically_attracted_to_my_ex/",
            "Aswer": "Well I mean you clearly found your ex attractive, so just because you two didn’t work out doesn’t mean she’s going to some how not being attractive any more. That said, sometimes the harder we focus on something the worse it becomes. Even if we’re trying to fight it off. I think this will pass in time. The things you’re attracted to with develop and change as you explore your way through life more. I understand this probably doesn’t exactly help you right this second. But the best thing you can do is just accept that you find her really attractive. Which is normal and makes sense, and just continue on with your life.",
            "A_score": 44
        },
        {
            "Question": "is it bad for me (25f) to fill a water bottle up with wine and drinking some when arriving to a place you’re nervous about going?\ni’m plan on doing a lot of new things this spring/summer and most of them i’ll probably have to do alone considering the fact that i don’t have many friends or a partner. but i like to do things alone anyway because when i’m ready to go, i can go and i don’t have to try to entertain anyone. however, i’m very social anxious and shy so i’m kinda nervous. i plan on doing indoor rock climbing and kickboxing soon. when i arrive in the parking lot of these locations, would it be bad to have some wine before going in? is it bad to keep a water bottle filled with wine in my purse?",
            "Q_score": 189,
            "Id": "12bm5yu",
            "Url": "https://www.reddit.com/r/Advice/comments/12bm5yu/is_it_bad_for_me_25f_to_fill_a_water_bottle_up/",
            "Aswer": "That’s a swift way to alcoholism And drinking before rock climbing and kickboxing is just… unwise.",
            "A_score": 714
        },
        {
            "Question": "Brother taking weird photos of me\nI(17) don’t know what to do I’ve been crying all day. My parents left in the morning and I was slightly awake when I felt my brothers(15) phone go under my covers. I get up immediately and tell him to get out of my room and I realized that he was taking photos of me. I’ve felt like this for a while like when I sit on the edge of the bed hell come in and sit behind me and I don’t think much until I turn my head and I see him put his phone down. Today confirms my suspicions and I have no idea what to do im disgusted and distraught",
            "Q_score": 48,
            "Id": "12bv4ov",
            "Url": "https://www.reddit.com/r/Advice/comments/12bv4ov/brother_taking_weird_photos_of_me/",
            "Aswer": "Sounds pretty serious, OP. I totally get why you are distraught! You should try to calmly sit your parents down tonight and explain what happened today and previously. Explain that you find it really creepy and need help resolving this with your brother. I think I would also request a lock be put on my bedroom door.",
            "A_score": 55
        },
        {
            "Question": "(NSFW) tips on soundproofing my hotel room?\nTo put it bluntly I'm boutta spend a few days at a hotel with my bf and it's gonna be WILD. We're into some hardcore stuff, and even when we try to be as quiet as we can, it can still be pretty loud. So I was hoping for some tips on how to temporarily soundproof our hotel room so that our neighbors don't get too bothered by this\n\nUPDATE: thanks for the advice guys. I'm gonna call the hotel to ask in advance if there's any way to accommodate for potential noise, and if not, then I'll just tell my bf to keep our more intense stuff for another time when we can make noise. Also, I should've mentioned originally, but this isn't a regular hotel, it's a spa hotel for couples, there will not be any children there. Also, a lot of people called me inconsiderate for making this post, im sorry I came off that way. Actually, my intention was to be as considerate as possible. I would've loved to have a super kinky mini vacation at a romantic hotel with my bf, but my first concern above all else was how I could make sure I don't bother anyone else because I know that the things we do can be very loud. But I've never been to a hotel like this before, so I wasn't sure if there was a way to work around it, which is why I asked. But if that just isn't a realistic possibility, then I'm happy toning things down so that there's no noise.",
            "Q_score": 55,
            "Id": "12brozz",
            "Url": "https://www.reddit.com/r/Advice/comments/12brozz/nsfw_tips_on_soundproofing_my_hotel_room/",
            "Aswer": "You can’t really soundproof a hotel room.   Ask if it’s possible to get a corner room, or if a room away from other guests is available.  It will really hinge on whether or not the hotel is at capacity.",
            "A_score": 145
        },
        {
            "Question": "An exchanged student from US called me racist and disrespectful for using chopsticks.\nAs strange as it sounds, let me put some context. I'm (17f) live in Spain since childhood, originally ukrainian/moldavian but never lived there. Currently I study in my first year of highschool. In our school there is a system for exchanging students from European countries or US. Long story short, one of this exchanged student's came to my class half a year ago. Since I am best in my class when it comes to speaking English, teachers asked me to show her some parts of school and help her with learning Spanish, so naturally, we became somewhat friends.\n\nAfter the first trimester we already studied together sometimes after school and in general had a good time with each other company. The last weekend of vacations I asked her to come with me and eat at a sushi bar and she agreed. We used this also as an excuse to show her more parts of the city. \n\nSo here we are, at the sushi bar. I ordered different kinds of sushi and she some meat. In this sushi bar the waiter always gives you chop sticks and fork or spoon at the same time. We finally had our food and started to eat. As always, when eating sushi I took chop sticks and started to eat. I didn't even realize that she wasn't eating but just stared at me or my hand. I asked her if she was okay and she said, \"Yes, but, why are you eating with chop sticks?\" It caught me off guard and I just said that I always use them when I eat sushi, I supposed it's normal. \"But you can't even use them properly, nor you're asian. It just seems a bit disrespectful to me.\" I was in total shock sitting there and be like, is she serious? I know how to use chop sticks by the way... She also said it all with a really judging face as if I was a kid or something and then started to eat as if nothing happened and didn't look at me. I tried to talk about it asking her why it seemed disrespectful to her, I genuinely wanted to know cause I educate myself about other cultures/racism and want to be respectful but no one told me before that using chop sticks while not being asian is bad. Also the irony is that she isn't asian ether, she is half black, half white. After my questions she just told me that I should educate myself, think about the privilege I have and should not appropriate other cultures. Oh my... The rest of the dinner was really awkward, I tried to initiate conversations but it always ended up with some small talks. After we ended eating and paid, she thanked me for the time and went home, I did too. \n\nWhat do you think about it? I just don't know what to actually think. Is it really disrespectful? If there are asian people from countries where chop sticks are used, say what do you think about it. Thank you for reading.\n\nUPDATE: Thank you everyone for the comments. I'm glad that I didn't do anything wrong and the situation was just some bad luck person. Next time would respond her with more confidence! Sorry for my grammar by the way.",
            "Q_score": 119,
            "Id": "12be7r0",
            "Url": "https://www.reddit.com/r/Advice/comments/12be7r0/an_exchanged_student_from_us_called_me_racist_and/",
            "Aswer": "American here and a whole lot of us that are non Asian enjoy using chop sticks when eating Chinese or Japanese foods. You're exchange student is what we refer to as a \"Karen\" getting overly upset over something she has no reason to he upset about.",
            "A_score": 243
        },
        {
            "Question": "Muslim coworkers want to report me for eating at my desk\nI do know what Ramadan is, but as I’m not Muslim I don’t know when it is. No one mentioned anything about Ramadan or anything about food in the workplace recently. Prior to today, I’ve noticed many coworkers eat at their desk, including the Muslim ones. Today was a busy day for me so i ate at my desk (i don’t do this often) as i couldn’t leave for lunch, i had too much work and i was hungry so i ate at my desk. Someone loudly said “ew it smells like food in here. I’m gonna send an email to HR” and everybody looked at me as I’m the only one eating. Now, i will stop eating at my desk during Ramadan and i would not have done it in the first place if anyone would have told me something. Now I’m feeling terrible because I’m being reported for something I didn’t know i wasn’t supposed to do and everybody knows it. After she loudly said that and everyone looked at me, i threw my food in the trash and immediately went outside to catch a breather, im so embarrassed and i feel terrible. Is there anything i can do to make sure it’s clear that i didn’t know and i won’t be doing it again?",
            "Q_score": 827,
            "Id": "12ayk69",
            "Url": "https://www.reddit.com/r/Advice/comments/12ayk69/muslim_coworkers_want_to_report_me_for_eating_at/",
            "Aswer": "Ramadan is about resisting temptation, not forcing everyone around you to concede .🤦🏻",
            "A_score": 2219
        },
        {
            "Question": "Do I choose my best friend or my girlfriend\nHello I’ve been in a committed relationship ship for almost 3 years now, everything has been solid in those 3 years with the ocasional up and downs, but as of recently something came up and I’m at a crossroad. My best friend of 5 years has recently converted to Christianity, alongside of that he also is a very outspoken conservative, one of the things he is very open about is gay people not being mentally right. Which I don’t agree with but it’s something we don’t really talk about because we have many more non-political things we share in common, how this connects to my girlfriend is she is a semi openly biesexual girl, she hates my friend because of the things he has said before,  as of recently she’s asked for me to distance myself from him and stop being his friend. What should I do ?",
            "Q_score": 369,
            "Id": "12aof2h",
            "Url": "https://www.reddit.com/r/Advice/comments/12aof2h/do_i_choose_my_best_friend_or_my_girlfriend/",
            "Aswer": "I would be distancing myself from him without my girlfriend asking, people change and he’s changing for the worse.",
            "A_score": 1424
        }
    ]
}