{
    "Posts": [
        {
            "Question": "[18f] [18m] my boyfriend won’t get the surgery he needs for his dick\n\nWe’ve been going out a year and a half now. One thing with my boyfriend is that his dick, or specifically the band on the back of the head the “frenulum” frequently tears. \n\nWhen we first started having sex it would tear in any position. But now he goes extra gentle (which gets annoying) and it’s fine but when I ride him there’s a good chance it tears so I have to feel bad every time I want to go that. \n\nAnd every time it happens we have to wait a week or two for it to heal before he can use it again. I would there’s seriously like a 30% every time I ride him it’ll tear and a 5-10% that if he’s doing it it’ll tear. \n\nI googled and there’s surgery you can get to lengthen the band so it stops tearing. But apparently there’s a slight chance it’ll reduce sensitivity in the dick because the frenulum is pretty sensitive. \n\nHe said he’s not losing feeling in his dick so he won’t get it. I ask what he plans to do then and he said nothing, like literally he plans to do nothing.",
            "Q_score": 371,
            "Id": "11wxnd0",
            "Url": "https://www.reddit.com/r/Advice/comments/11wxnd0/18f_18m_my_boyfriend_wont_get_the_surgery_he/",
            "Aswer": "This is his body.... he has every right to say no to this surgery. Just like you have ever right to leave the relationship if the sex isn't how you want it.",
            "A_score": 1874
        },
        {
            "Question": "UPDATE: A delusional teenager I work with is telling people we're dating\nFirst of all, thank you for everyone who commented and gave me advice. I wrote a small update in my [original post](https://www.reddit.com/r/Advice/comments/11tqyw2/a_delusional_teenager_i_work_with_is_telling/) about talking to a lawyer friend. I brought this up to a different manager, mentioning new information that I found out (he was showing people a porn video he found of a girl who looks somewhat like me sucking dick and told people it was me) ANNNND... Nothing. Not. A. Thing. He \"apologized\" saying he didn't want it to go this far and the mangers told us to keep it out of the building. No change of schedule, no consequences, NOTHING. So I'm gonna be going to HR and looking for a new job because this is ABSOLUTE bullshit. I feel disgusted with this place's actions regarding this.\n\nAdditionally, I've contacted his school and requested that they notify his parents because I couldn't find a way to contact them, and at the least if a teacher hears about this there's a paper trail showing I tried to notify them about this little fucker's actions. I'm also lucky enough that he only works weekends and I can see the days he works and try to pick up shifts to avoid him as much as humanly possible. But that's all I have for now. If he comes anywhere near me in the future or if I hear anything else I'm gonna lose my shit, and I'm gonna try and burn this restaurant to the ground. If y'all have any other advice I'm very open to it though! Thanks again guys",
            "Q_score": 22,
            "Id": "11xgzl2",
            "Url": "https://www.reddit.com/r/Advice/comments/11xgzl2/update_a_delusional_teenager_i_work_with_is/",
            "Aswer": "It is also sexual harassment. You need to use those magic words in your HR complaint",
            "A_score": 20
        },
        {
            "Question": "My husband cheated on me and then left me for his affair partner. How do I recover from this?\nI (28F) was married with my husband (35M) for 3 years, together for 6 years total. He was the first person I dated. I absolutely adored him. He was the love of my life, my best friend, my life partner. It's sad to say, but I thought he would be the last person on earth to cheat. But here we are.  \n\nI've had so much issues with my mental health since finding out about the affair. I feel so naive. I trusted this man 100 percent. He always portrayed himself as someone with a high moral compass. I remember him expressing how much disdain he has for people who cheat. I did sense something off about him and this girl. I confronted him about it and he managed to look me in the eye and deny everything. He looked me in the fucking eye and told me he loved me and only me. That he would never cheat on me. Only for me to catch him a week after. And then subsequently, leaving me for his affair partner. I just can't imagine trusting anyone again. \n\nFor people who have gone through the same situation, how did you recover?",
            "Q_score": 41,
            "Id": "11x7pe9",
            "Url": "https://www.reddit.com/r/Advice/comments/11x7pe9/my_husband_cheated_on_me_and_then_left_me_for_his/",
            "Aswer": "You thank your lucky stars that you found out now and did not waste anymore time on this douchebag. You get a good lawyer and take him to the cleaners. And then you take a well-deserved vacation and live happily ever after because you are free of someone who obviously didn't care about you as much as you cared about them.\n\nBe free.\nAnd love yourself enough to not waste another tear on this dirt bag.",
            "A_score": 44
        },
        {
            "Question": "my bf's friend sent videos of his gf performing sexual acts on him to my bf and his friends without her consent... help\nMe (f25) and my boyfriend (m29) have been talking for half a year and dating for a month. In conversation, my boyfriend nonchalantly brought up that his friend (m29) had sent him and his other friends videos of his girlfriend performing oral sex on him through snapchat. I asked if this was consensual and he said no, probably not. I flipped out and said this is a crime and so deplorable etc. and my boyfriend was like \"I didn't expect you to react like this.\" I told him that I couldn't date him if he thinks that's okay and he said that he didn't think it was okay but it wasn't his place to say something since it happened 5 years ago. My boyfriend doesn't want to give up his friendship with this person saying that he's been there for him through some tough times and everyone makes mistakes. To me, this is not a mistake, this is a CRIME. Not to mention he did it multiple times. I'm disappointed in my boyfriend for not saying anything and continuing to be this disgusting man's friend. Not to mention, the guy is still dating this girl and she most likely has no idea! I care about my boyfriend so much but I didn't expect something like this from him at all.\n\nAm I overreacting or am I right? I want my boyfriend to stop being friends with him or at least call him out on it, even if it happened years ago. Would this be a justifiable reason to break up with someone even though he wasn't the one who did it?",
            "Q_score": 150,
            "Id": "11wx9x1",
            "Url": "https://www.reddit.com/r/Advice/comments/11wx9x1/my_bfs_friend_sent_videos_of_his_gf_performing/",
            "Aswer": "Tell the girlfriend. She deserves to know what happened and if she already knows then you can have a conversation about consent and hold men responsible for treating women like actual people instead of using them like inanimate sex dolls. \n\nAt least take a break from your current boyfriend. He's never thought twice about this behavior and won't realize the humanity of women immediately. You're right to freak out because it's a crime but give him some time to see why. It actually hurt and demeaned someone his friend is suppose to love and care for.",
            "A_score": 157
        },
        {
            "Question": "I got my gf pregnant\nSo Im 17 and my girlfriends 16 and she’s pregnant. We are so fucking dumb thinking that birth control alone would stop it from happening and we were careless. I know this is all my fault. What the actual fuck should i/we even do.",
            "Q_score": 760,
            "Id": "11whawo",
            "Url": "https://www.reddit.com/r/Advice/comments/11whawo/i_got_my_gf_pregnant/",
            "Aswer": "You both have to go talk to your parents.",
            "A_score": 1104
        },
        {
            "Question": "Found out my SIL is a possible groomer and my family wants to sweep it under the rug and act like everything is normal\nTLDR: Recently found out my SIL didn’t quit from her school/coaching position for the reason I was told and the real reason is that she was caught messaging a minor that she was coaching and my family wants to pretend it all didn’t happen.\n\nBackstory: months ago my SIL quit her teaching position at a small town school because the stress of it all was destroying her mental health, so she quit but quickly got a new job teaching at another school. SIL was also a coach for a high school team at the first school and is now looking at tying to be a coach again at the new school. \n\nProblem is all of this was a lie.\n\nThe real story is that she “quit” (told to quit or else they would fire her and put it on her record) because she was caught inappropriately messaging a boy on her team. My brother caught her the first time and told her to stop or he’d leave her and tell the school, well she didn’t quit and the school found out on their own.\n\nThing is though that she got another teaching position really soon after losing the first job and even after my brother told her not to, she is pursuing getting another coaching position at the new school. \n\nI’m being kept in the dark as to what was contained in the messages to/from the minor other than being told it was “inappropriate”, but my position is that a coach who is messaging a student at all hours of the night and whose relationship has cause a minor to have to start counseling is a predator, as she either groomed him or was attempting to. And while our family agrees that this behavior is predatory, they are more concerned about whether or not my brother will divorce her and are encouraging marriage counseling.\n\nI feel like I’m going insane here and I’m the only one taking this seriously, like yes it’s sad and unfortunate that my brother may lose his wife, but how are we not addressing that she GROOMED A CHILD and seems to be putting herself in the position to do it again.\n\nI just got off the phone with my mother and asked what the hell I’m supposed to do as Easter where our family will all get together is coming up, am I just supposed to treat her like nothing happened?!\n\nHer answer: yes\n\nAs a survivor of child sexual abuse, I’m not only offended that she’s being invited, but I’m pissed that it’s expected of me to treat her like she didn’t 1) attempt to cheat on my brother 2) attempt to cheat with a MINOR\n\nDoes anyone have any advice? I don’t know what to do, I’m considering not going to our typical family Easter because I don’t know if I can treat her normally and frankly I don’t want to. She has faced zero consequences for her actions, my brother stayed with her and she got a good job after she “quit”. Do I call the new school and tell them to ask around for what really happened at her old job?\n\nI’m sorry if this is all a mess to read, as I’m quite flustered after all this information was dumped on me and I seem to be the only one concerned about her actions and not about the status of their marriage. What do I do?",
            "Q_score": 51,
            "Id": "11x2neo",
            "Url": "https://www.reddit.com/r/Advice/comments/11x2neo/found_out_my_sil_is_a_possible_groomer_and_my/",
            "Aswer": "I'm not sure what to do about the new school, but an anonymous call wouldn't hurt, especially if she has nothing serious to hide. As for your family, I think you have every right to put your foot down and not attend gatherings if she's there and makes you uncomfortable. I know this sucks and puts you in a situation of \"choose me or choose her\", but there's 1. A possibility there is more to the story than you're being told, and 2. Yourself to protect in the long run no matter what. You have to be prepared to take that to whatever end is necessary for reason #2.",
            "A_score": 29
        },
        {
            "Question": "I am a piece of shit.\nHey guys throwaway for obvious reasons. I cheated on my now fiancee when we first started dating(6 months in) almost 6 years ago now. It has only happened once. I was so scared of losing her. I'm a piece of shit for it. I never came clean about it. It was selfish.  It has never happened gain. We are engaged now soon to be married we bought a house together. I am gonna ruin her life by having her marry me (I feel at least). I want to come clean and try to live up to the person she thinks i am. We have been together since high-school. What should I do? Please help me even though I don't deserve it",
            "Q_score": 42,
            "Id": "11x2jmz",
            "Url": "https://www.reddit.com/r/Advice/comments/11x2jmz/i_am_a_piece_of_shit/",
            "Aswer": "I mean I’ll be honest- if this were my husband posting this I’d want him to keep it to his damn self lol. It was 6 years ago- and you clearly feel bad about it. There are a few things that would change my mind.. does she personally know the person you cheated with?",
            "A_score": 183
        },
        {
            "Question": "So my dog almost died yesterday and I don’t have the guts to see him anymore. I’m currently in school and don’t really want to go home cause I am scared like there is a pit in my heart. Anybody got advice?\nUpdate: I have hung out with my dog and felt 200% better. Thank you guys for all the love and support. This is my biggest post and I wish you guys all love!❤️❤️❤️",
            "Q_score": 138,
            "Id": "11wrv8c",
            "Url": "https://www.reddit.com/r/Advice/comments/11wrv8c/so_my_dog_almost_died_yesterday_and_i_dont_have/",
            "Aswer": "We, as people, have whole lives outside of our pets- school/work, friends, family etc \nBut our pets just have us. We are their world, their happiness and comfort. \nGo see your dog and give him the comfort he needs;  the same comfort that he’s always given you.",
            "A_score": 192
        },
        {
            "Question": "how do I stop my friend from talking to this much younger girl?\nMy friend will be turning 18 within a month. She met a girl in a party, they had a making out session and she really enjoyed it. She's gay but that's the first girl she ever hooked up with. Since then they've been sharing some spicy texting and plan to hook up again. The problem is, the girl is 12.\n\nI already told her she should find someone a bit older, maybe 15, and to please stop talking to that girl and not hook up with her. But she's been walking around with some bad influences who told her it's okay, it's not a big deal, that girl hooked up with someone who's 20 before (needless to say they do similar stuff and make out with people much younger and much older). \n\nI don't know what to do. She's a very sweet and almost naive girl, but this is just wrong. A 12yo shouldn't be hooking up with randoms at parties much less a goddamn 18yo, no matter their character.\n\nedit: I can't call the cops on her, first because I DON'T want her to get in trouble, I'm trying to keep her out of it. Besides, age of consent is a thing people overlook around here specially since they haven't even had sex. Adult men impregnate tweens and no one bats an eye.\n\nI can't talk to parents either, specially her parents. Her mom is super strict, super homophobic and quite literally insane. If she finds out about her sexuality she will probably kick her out or spank her and forbid her from having any contact from the outside world for life. That's not what I want. I don't want to punish her, she doesn't even realize what she's doing, I want her to stop from doing something that'll fuck her up or this girl.",
            "Q_score": 102,
            "Id": "11wnnng",
            "Url": "https://www.reddit.com/r/Advice/comments/11wnnng/how_do_i_stop_my_friend_from_talking_to_this_much/",
            "Aswer": "If your friend thinks hooking up with a 12 year old is okay, then you should probbably report them to the police",
            "A_score": 370
        },
        {
            "Question": "How to quit my therapist who has been very helpful but we have very different values.\nI’ve been seeing my therapist for about 3 years now. She’s helped me tremendously over the years through several big life situations. However, several red flags have come up that I just can’t shake and I think I need to part ways: \n\n1) I fall in the middle of the road (but leaning more towards caution) with COVID. I got my shot, I masked when masking was required and followed the guidelines. She is very anti-vax and makes it clear that she doesn’t believe COVID is a big deal. Regardless where anyone falls on the Covid scale, her being so vocal to me about her thoughts somewhat pushed me to alter what I would talk to her about, if it involved something Covid-related. \n\n2) I was taking to her about someone who I have some conflict with. She asked me if they are “re***ded”. Not in a way of thinking they really could have Down syndrome, but in a derogatory way. I am passionate against using that word. \n\n3) Last session, when I showed up, I was outside because a fire alarm went off. Once it was all clear, my therapist and I went inside and she said she was “literally saved by the bell because she was having to listen to a client who goes on and on - and won’t stop talking.” It put me off that she’s down talking a client of hers. \n\nI’m a bit of a baby when it comes to conflict and would love some advice on how to stop seeing her, in a way that is not massively stressful.",
            "Q_score": 98,
            "Id": "11wjgoe",
            "Url": "https://www.reddit.com/r/Advice/comments/11wjgoe/how_to_quit_my_therapist_who_has_been_very/",
            "Aswer": "Your relationship with her is a business relationship. In other words, you owe her nothing. You can just stop going and leave it at that. \n\nIf you want to let her know that's fine, but she sounds like the type who might try to talk you out of it.",
            "A_score": 147
        },
        {
            "Question": "My wife just dropped a truthbomb I can't handle\nAfter almost 6 years of being together and getting married this winter, my wife just came out of left-field with a truthbomb I can't cope with. She essentially worked out in therapy that she's always loved the idea of me, but doesn't know to what extend she actually loves me. \n\nShe has a lot of unresolved youth trauma and never had counseling. She's always \"latched on\" from bf to bf before we got together, which according to her psychiatrist is because of the feeling of not having to go at it alone - something she's had to do all her life as her parents were.. preoccupied. I practically had to force her into therapy.\n\nLast week I've been told she's trying to work out where she stands, because living like this has gotten her numbed off and desperate. She's getting anti-depressants today, and confessed that she just wants to be alone right now. She went as far as preparing me that depending on how the next few months go for her in terms of developing a sense of self, we might not be married anymore by (what would've been) our first anniversary. If she realized she does not love me like that after all, she might decide it's too hard to leave anyway. I just don't see a way where you don't known if you love someone you married 4 months ago, but after a few bouts of therapy you realize you do..\n\nI realize I played a big part in this because she's always had issues expressing herself and I figured it'd get better with time. I guess this is her expressing herself, just not the way I imagined it would go. There are so many questions I can't even begin to ask her, because she doesn't know the answers for herself let alone how to convey them to me. My world's just been shattered, and I'm supposed to keep truckin' on like nothing happened. I can't get any work done, I have a constant feeling of dread pitting in my stomach and I just want to shut down. My boss has been so kind to allow me to WFH for a few days to gather myself, but as I can't focus I'm afraid they'll think I'm just loafing around.\n\nWhat hurts me the most is thinking about our weddingday, when I was bawling my eyes out on for the love of my life and she just went through the motions because that was what was expected of her..\n\nI'm expected to give her space, but all I want to do is crawl in bed next to her and cuddle all day. But the tighter I grip the harder the pulls away. Am I just looking away from the inevitable? I feel like this is the beginning of the end.. How do I get anything productive out of my hands ? How do I stop from spiraling myself out of control ?",
            "Q_score": 69,
            "Id": "11wkrps",
            "Url": "https://www.reddit.com/r/Advice/comments/11wkrps/my_wife_just_dropped_a_truthbomb_i_cant_handle/",
            "Aswer": "Oooof that must have been incredibly painful to hear.\n\nThe thing with therapy is that it drags up all kinds of things and you start questioning everything. On one hand it’s great that felt able to tell you how she’s feeling and on the other hand her doing that has completely eroded your own sense of safety in your relationship.\n\nI think you should have another conversation and have some set check in conversations over the next few months. You obviously don’t want to continue feeling this way indefinitely (who would?), but it’s also going to take her some time to organise her thoughts and feelings. Right now she’s at a stage where she’s recognising historical patterns of behaviour and is figuring out where your relationship fits within that.",
            "A_score": 66
        },
        {
            "Question": "my family is trying to blackmail me with porn from when i was of the ages 8-16\nits a lot that goes into the story but recently i came into a lot of money and my family wants to use these videos as a way of getting money out of me and trying to damper my image. the videos were not recorded with consent and i was not of age when they were recorded what can i do? im going to get a lawyer but i really need ease of mind that this is not going to hurt me. mind you my entire family has the videos not just one person.\n\nedit: hello i just wanted to add that i used to have actual evidence of the abuse but they broke my phones and beat the shit out of me to delete the evidence. they've edited me into literal child porn videos where i was not physically there. they've used voice editing apps to fake me \"confessing \" to child abuse. they have videos of me crying and going on rampages after the abuse. i know there will always be someone out there who doesn't believe me but to those who do i thank you a lot. i didnt expect over a hundred people to come and actually believe me. im so used to people calling me a liar and pouring salt on fresh wounds! when i eventually get this case on the move which will be soon i will keep you guys updated! this is also a throwaway account just in case my family finds this because they do know i browse reddit. \n\nany other advice or tips on how to navigate this situation is greatly appreciated! thank you everyone for listening to me and supporting me! my mind is kind of frazzled right now so im sorry if this message is wonky.",
            "Q_score": 997,
            "Id": "11vzz6x",
            "Url": "https://www.reddit.com/r/Advice/comments/11vzz6x/my_family_is_trying_to_blackmail_me_with_porn/",
            "Aswer": "I'm not a lawyer but there are two obvious illegal things here, blackmail and possession of child porn. If you have proof they're trying to blackmail you you can just go to the police.",
            "A_score": 1975
        },
        {
            "Question": "I called the police on my stepdad after he pushed my twin sister down the stairs. Now my mothers mad at me for supposedly ruining her life.\n\nHello everyone my name is Ella I’m 15 years old. My parents are divorced and my father has primary custody and we are with my mother every other weekend. My twin sister Mia and I are extremely close and always have been. \n\nMia is gay and that’s the main reason my stepfather has been mean to her ever since he met her but Saturday he crossed a line. I’ve talked to my father about how my stepfather behaves towards my sister and he’s had multiple conversations with my stepfather telling him to quit some of which have gotten very heated. Most of what he’s been doing is calling her names and being very rude and disrespectful towards her. \n\nSaturday my sister had just gotten out of the shower she had gotten dressed walking out of the upstairs bathroom which is a few steps away from the top of the stairs. My mom and stepfather’s bedroom right beside it. As my sister was walking out of the bathroom she had turned to walk down the stairs when my stepfather came out of the bedroom. He called her a homophobic slur then pushed her from behind and sent her falling down the stairs. \n\nI ran to check on my sister and aside from a broken arm and busted lip she was ok. I then called 911 and asked for the police and an ambulance. The police arrived first and I told them what had happened and they arrested my stepfather for aggravated battery. The ambulance arrived not long after to take my sister to the hospital. I rode in the ambulance with my sister and called our father who met us at the hospital. \n\nMy sister is ok they took X-rays and checked her for other injuries then put a cast on her arm that she’ll get off in about two months. They kept her overnight for observation then sent her home the following morning. So she’s going to be just fine. \n\nSince then my mother has been calling me nonstop and sending me text messages telling me that I ruined her life and should be ashamed for calling 911 and not giving her time to make up a story before taking my sister to the hospital. My father has called my mother and told her to knock it off and that she’s lucky the police handled my stepfather and not him. It’s safe to say that we won’t be having to stay with my mother for awhile if ever and my sister and I both are happy about that. I have my mothers number blocked and so does my sister. \n\nI just don’t understand how someone can be so hateful. I don’t feel like I did anything wrong but I could use some advice.",
            "Q_score": 342,
            "Id": "11w7jaw",
            "Url": "https://www.reddit.com/r/Advice/comments/11w7jaw/i_called_the_police_on_my_stepdad_after_he_pushed/",
            "Aswer": "You should be very proud to have handled this situation so well at a young age.  You were 100% correct to call the police.  \n\nYour mom is in the midst of an enabling dysfunctional relationship.    She can’t see straight right now.",
            "A_score": 410
        },
        {
            "Question": "I almost cheated on a work trip. What do I do now?\nI’ve been together with my girlfriend now for 3 years and I wouldn’t trade it for anything. I’ve been so happy with her and I genuinely find a future with her. \n\nI was out on a work trip for a week and met this wonderful lady at the event. We spent some time together between our crew and theirs and had a couple nights out of drinking. Some sexual innuendos came from her to me, such as “I’d love to cuddle with you” and “if you roofied me I wouldn’t mind”. \n\nI don’t know why but for some reason this turned me onto her but I was feeling uneasy about the situation too. On the last night her, my coworker, and I were in her hotel room talking for hours. After we left, she texted me and was asking if I was single. (Obviously hinting to hooking up). Never have I felt more tempted to get up, knock on her door, and spend the night. But I didn’t, I told her about my relationship and she was very happy for me and understood my position.\n\nIt is now the next morning and I feel like I am regretting not getting up and going to her room. I don’t know why, I’ve never been in this situation before, no other woman has came onto me like that. I don’t know how to feel now.\n\nDo I tell my girlfriend about my experience? Should I just keep it to myself? What should I do if I see her again?",
            "Q_score": 250,
            "Id": "11w8v3g",
            "Url": "https://www.reddit.com/r/Advice/comments/11w8v3g/i_almost_cheated_on_a_work_trip_what_do_i_do_now/",
            "Aswer": " “if you roofied me I wouldn’t mind”\n\nIs this how people flirt nowadays?",
            "A_score": 737
        },
        {
            "Question": "Boyfriend constantly not sure if he wants me\nLong story short:\n\nMe (26F) and my boyfriends (26M) were together for 2 years. Everything was ok the first 6 months. I fell into a horrible depression, that kind that makes not to be able to eat, sleep, stay alone. He was not supportive and cricitized me for taking medication and not doing things to get better. That was just a month or two. He also confessed that has thought about separation and couldnt stand the situation with me being depressed, because he was feeling ok and wanted someone that motivates him to be productive and do things. Also he left me alone after a panick attack at a doctor's appointment (I also had health issues, this being the main reason for my depression), because it was his lunch break and wanted to get back home to eat.\n\nFast forward I recovered quickly and forgave him. After 3 months he wanted again to separate because we had a routine and he didnt feel challanged by the relationship. We stayed together.\n\nFast forward again after 6 months he wanted again to separate and start telling that he doesnt know what he wants. He also said he wanted separation and after 5 min said he didnt. We stayed together.\n\nAgain fast forward 2 months I felt he  has changed behaviour and asked him if moving together was still on the table as we decided a month ago. He said no, I am not the girl he sees his future with and also he has seen his high school love with whom he had been in a \"relationship\" for 3 weeks and compared feelings and the ones for her were stronger. I broke up with him.\n\nHe begged me to stay, promised he will change, came to see me in the hospital, was extremely nice to me, said to move together. I forgave him.\n\nFast forward 2 weeks later(he was very nice and caring)  I made a joke that I want to eat meat again (we both dont eat meet). He said he wanted to break up, that he had these thoughts about not knowing what we wants again. After 5 min he regreted and wanted to stay together. I left.\n\nNow he tells me to forgive him that he loves me and doesnt know why he behaves like this and he is depressed.\n\n\nOpinions are welcomed:)",
            "Q_score": 51,
            "Id": "11wg0tj",
            "Url": "https://www.reddit.com/r/Advice/comments/11wg0tj/boyfriend_constantly_not_sure_if_he_wants_me/",
            "Aswer": "This man sounds like he looks for any reason to break up. My question is: why do you stay with this man that makes it plain that you’re the back up plan?",
            "A_score": 132
        },
        {
            "Question": "Should I pretend I didn’t know my sister is pregnant?\nMy parents and her are planning on telling me in a couple of days time as a surprise but I’ve known for like a month already. Should I pretend to act surprised when they tell me or should I say I already knew.",
            "Q_score": 276,
            "Id": "11vvqfq",
            "Url": "https://www.reddit.com/r/Advice/comments/11vvqfq/should_i_pretend_i_didnt_know_my_sister_is/",
            "Aswer": "I mean, I act surprised every time a pizza is delivered. You can do the same for the baby.",
            "A_score": 841
        },
        {
            "Question": "Stalker came to my work\nHi, I'm skipping the details. \n\nI have a stalker, l don't know him. We met by chance two weeks ago and he's been obsessed. He got my number but I blocked him.\n\nYesterday he showed up at my workplace and today he sent a message from another number asking me out (saying he wants to be my \"lover\"). \n\nWhat can/should I do?\nI only know his phone number.",
            "Q_score": 74,
            "Id": "11w4as0",
            "Url": "https://www.reddit.com/r/Advice/comments/11w4as0/stalker_came_to_my_work/",
            "Aswer": "So I'm in security management, and you might want to notify your work, especially if they have security. They can start documenting it before the police get involved, and advise you moving forward. They also might help you with an escort to your vehicle if you feel unsafe. We do that a lot.",
            "A_score": 122
        },
        {
            "Question": "Is it ok to walk away?\nYesterday I was wearing a pullover of my favorite baseball team. At the grocery store. Doing my thing. Minding my business. \nThis man, a creepy squirrelly type, starts talking to me about the team. He makes zero sense. I can barely understand him and I’m trying to be polite and saying mmmhmm and walk away. Again. I don’t know him. I think that’s generous.\nBut, he turns his cart around and starts following me to talk more. I end up turning again, because … I don’t care to continue this conversation because I feel he’s being a little racist. But, I feel he’s taken advantage of my being nice. \nHe approaches again an aisle over and continues, at this point, I try an uh-huh and walk off. \n\nIn this situation, is it ok to walk off? I don’t know this person. He’s a little on the creeper side. I don’t want trouble. I was just minding my business, shopping.",
            "Q_score": 79,
            "Id": "11w1pld",
            "Url": "https://www.reddit.com/r/Advice/comments/11w1pld/is_it_ok_to_walk_away/",
            "Aswer": "Yes, perfectly fine. Also it would be okay for you to be firm and straight up tell him to please leave you alone. Men can sometimes be persistent unless their directly told to go pound rocks.",
            "A_score": 119
        },
        {
            "Question": "I refused to invite my sister’s new boyfriend to our family dinner because he disrespected me but my sister thinks I'm overreacting.\nHey everyone, I'm in a bit of a predicament and I need some advice. Recently, my sister started dating this new guy who seemed nice at first, but he ended up disrespecting me in a way that I just can't let go.\n\nIt happened at a get-together my sister hosted at our parents' house. We were playing a game when he made a comment about how I was taking too long to make a move, and then he smirked and said, \"I guess that's what happens when you're not very smart.\" To be fair, my sister is way smarter than me and she's really great at these games too. But it was clear to me that he was trying to insult me, and I was taken aback.\n\nI didn't want to make a scene in front of everyone, so I tried to brush it off and continued with the game. But then he made another comment about how I must be bad at strategy games because I didn't go to college. That is not fair, I went to college but just not as good as my sister's. I was shocked and hurt. I couldn't believe he was being so blatantly insulting.\n\nAs the night went on, he made a few more snide remarks that were meant to put me down. It became clear to me that he was deliberately trying to provoke me. I tried my best to ignore him, but it was difficult to enjoy the evening after that.\n\nNow my sister wants to bring him to our family dinner next week, and I'm hesitant to let him come. I don't want to be around someone who doesn't respect me, and I feel like inviting him would just be condoning his behavior.\n\nMy sister thinks I'm being unreasonable and being too sensitive, and that I should give him a chance to make things right. But I just can't shake the feeling that I would be betraying myself if I let him come.\n\nMy parents want him to come too. It feels like I'm the only person who doesn't want him there. \n\nShould I be firm and ask her not to bring him, let her bring him and pretend nothing happened or not attend the dinner at all?\n\nEdit:\nTo clear up some confusion, I'm a female. My sister is 9 years older than me. I live with my parents. This is my sister's first serious boyfriend so she's acting a bit out of character. She's not usually like this. My sister took care of me growing up because both parents were busy working. I don't want to disrespect her because I see her as a mother and a role model.\nI just wanted you all to look at it from every perspective. Thank you for your kind comments so far as well.",
            "Q_score": 725,
            "Id": "11vhc41",
            "Url": "https://www.reddit.com/r/Advice/comments/11vhc41/i_refused_to_invite_my_sisters_new_boyfriend_to/",
            "Aswer": "He's an utter dick.\n\nHe looks down on you because you don't have a degree. And what's worse is, despite feeling smarter than you, he is too stupid to keep those remarks to himself. \n\nYou're absolutely right in not wanting him in your house and not interacting with him.\n\nThe only thing I would do differently is actually telling them why. Very clearly. \"He's an asshole. I'm not ashamed of not having a college degree or whatever, but I also don't enjoy being insulted over it. If he can't be a respectful adult, he has no place in my home. If you want to call that overreacting, you're no longer welcome,  either.\"\n\nHe'll end up breaking more relationships for her and hopefully shell end up seeing it.",
            "A_score": 981
        },
        {
            "Question": "I caught my friend's bf cheating\nHi everyone. My friend (Elise) got in a relationship with a guy about 5 months ago. She really likes him so as her friend I supported her ( we are extremely close friends).  Everything was going great for them until 4 days ago, when I spotted her bf kissing another girl in public. As I was watching to see if the girl was familiar, he stopped kissing the girl and looked at me dead in the eyes. After that I just started walking away and returning to my life as of that never happened. \n\nI haven't told Elise about it yet, but it's really been bothering me. I do not want Elise to get to the point where she absolutely in love with this guy but then is heartbroken and depressed once she finds out he's a cheater. I know I have to break the news to her soon, but I don't know how to do that. How do I tell Elise that her bf is cheating? How could I make the situation better? Any advice would be appreciated.",
            "Q_score": 95,
            "Id": "11vx4ch",
            "Url": "https://www.reddit.com/r/Advice/comments/11vx4ch/i_caught_my_friends_bf_cheating/",
            "Aswer": "\"I have something to tell you, it's going to be difficult to hear and I've been trying to think of the best way to tell you. I can't think of any good way to take this information so I'm just going to say it... I saw your boyfriend kissing another girl 4 day ago. I feel terrible not telling you instantly, but I didn't want to see you upset.\"\n\nSomething along these line is how I would do it.",
            "A_score": 184
        },
        {
            "Question": "i created a fake account and found out my ex dumped me because i'm black\nI was having one of those nights where i was thinking of him again. I never understood why our relationship didn't work out, I felt there was a real reason that only he knew but didn't want to admit. My looks maybe? My personality, how clingy i got? However i am a terrible overthinker so i dismissed those type of thoughts, the silly thoughts that we have like \"it's because you're black\". Despite feeling left in the dark, i tried my best to make the relationship work, every effort made.\n\nBecause why would he date me in the first place if it was that? Why would we go out, why would he pay for our meals, we'd spend hours talking, have all these intimate moments, just for him to not actually want to pursue anything with me... due to my race?\n\nWell, girls, it is the exact reason. I created a fake account last night and started chatting him up. He confessed everything , to a stranger ! (Me using a fake account meant i was a stranger to him). In his words \"I would've kept dating her if she was white.\" My heart dropped when i read the message. He went on to say \" it's the fact that I'd never want a half black child\" ... I could only marry a white woman\". He's allowed his preferences i believe, but why string me along the whole time..?\n\nAnd so after moments of hurt, i tried healing myself, a little self reflection, trying to keep away flashbacks and tears. A little motivational reading, some looking at myself in the mirror and telling myself \"i am worth it!!\" However i'm starting to think, this is something i should get used to?\n\nI am feeling upset more than angry, i feel like a waste if that makes any sense, i feel stupid. I will never talk to him ever again, for sure. But part of me wants to hire a hitman. \n\nWas i ignorant to think that i could be successful in the dating realm, being the colour that i am? This is the reality for us girls ,right? Or could it be a geographical thing, maybe i'm not looking in the right places. Whatever the conclusion i don't know, i'm wondering if any other girls have been in this situation? Or if you have any advice, support to give? I'd appreciate it. Thanks, have a nice day all!",
            "Q_score": 178,
            "Id": "11vj4ir",
            "Url": "https://www.reddit.com/r/Advice/comments/11vj4ir/i_created_a_fake_account_and_found_out_my_ex/",
            "Aswer": "He's an asshole and the fact he dumped you was a blessing in disguise. Stay strong",
            "A_score": 336
        }
    ]
}