{
    "Posts": [
        {
            "Question": "is it ok for me to ask people to bring food and drinks for my 18th birthday celebration?\nthis wasn’t my original plan, originally i was going to pay for food and order pizza and buy drinks myself with my money. but my mum ended up taking it from me for soemthing and she said she’s not going to give it back to me when she gets paid. i’m really sad and i have to cancel and basically already have told everyone. but i don’t want to spend my 18th alone and depressed because i know that will probably happen, should i ask people to bring food and drinks or is that bad?\n\nupdate: so my uncle randomly sent me some money, meaning i can actually do my birthday plans and i’ve also taken everyone’s advice and told people i don’t have a lot of money rn and asked if they can contribute and most of them have agreed :)",
            "Q_score": 290,
            "Id": "127ji6n",
            "Url": "https://www.reddit.com/r/Advice/comments/127ji6n/is_it_ok_for_me_to_ask_people_to_bring_food_and/",
            "Aswer": "The real question is, how soon can you move out and block your shitty mom?",
            "A_score": 279
        },
        {
            "Question": "help\nI'm 18f, a junior in high school (probably dropping out) and am with a 22m who works in construction. He wants to start a family and I'm not comfortable with that because we've only been together for 2 months. I moved out of mom's house (she was abusive ) around 2 months ago as well and moved in with him then we started dating. I've heard the phrase \"if he can't get with someone his age there's a problem.\" This worries me and honestly I would move out but stay with him but i don't have enough money for that. Finally, I think I'm too young for a child and I haven't talked to him about this but if i left I'm worried he'll make me pay him back and once again, i can't afford it.",
            "Q_score": 35,
            "Id": "127sddg",
            "Url": "https://www.reddit.com/r/Advice/comments/127sddg/help/",
            "Aswer": "Absolutely do not drop out of school? You’re 18, so I can assume you’re a senior. Graduation is likely in May or June. Tomorrow is April 1. You are days away from getting that diploma. People like this man count on you dropping out to make it way harder for you to get away from them. Life is extra hard in a world that demands you finished high school at the very least. \n\nDo not start a family you don’t want just because you’re afraid he’ll kick you out or make you start paying for stuff. Sit down, have a conversation about how you’re really feeling about everything, and see what his reaction is. You’ll know if he’s a good guy or if you left one abusive situation for another.",
            "A_score": 76
        },
        {
            "Question": "Is 13 too early to date\nMy parents say I'm too young to date but there's this girl that I really enjoy spending time with and both of our friends say it's really obvious we both like each other but I'm just afraid if I ask her out my parents won't like it, what should I do?",
            "Q_score": 42,
            "Id": "127mmok",
            "Url": "https://www.reddit.com/r/Advice/comments/127mmok/is_13_too_early_to_date/",
            "Aswer": "You can spend time with someone even if you're not dating.\n\nJust ask her to hangout, meetup places with groups of friends. Let her know that you enjoy your time with her, bring her around the house and your parents, they may end up liking her and encouraging movie or dinner \"dates\" in the future. Keep it respectable.",
            "A_score": 119
        },
        {
            "Question": "My dad was diagnosed with ALS a few months ago and is starting to go downhill a bit. He’ll be 75 at the end of the year, and my mom and I are trying to come up with fun things to do, so I’m reaching out! Any ideas are welcome! Thank you in advance ☺️\n",
            "Q_score": 32,
            "Id": "127ml2e",
            "Url": "https://www.reddit.com/r/Advice/comments/127ml2e/my_dad_was_diagnosed_with_als_a_few_months_ago/",
            "Aswer": "My mother had ALS.\n\nChances are, you can expect the following to happen:\n\nYour dad is going to lose his ability to communicate (or at least to communicate without difficulty) at some point.  Use this time now to get him to tell his stories, and record them so that you can write them down for his grandkids to enjoy.\n\nYour dad is going to lose his ability to swallow, and will eventually need a feeding tube.  So cook what he loves, take him out to restaurants he loves, and order in food he loves, while you can.\n\nYour dad is going to lose his mobility, and navigating the world in a wheelchair (especially a power chair, which he is likely going to eventually need) is anything but easy.  So if there are places he likes to go, do it now while you still can.  Your dad is going to tire easily and anything you plan for him needs to account for that.",
            "A_score": 13
        },
        {
            "Question": "My mom has kept $30k in child support money and plans on using it to buy herself a house.\nFor context, I, recently turned 18, and have always lived with my mom since my parents split up when I was around 11. I was never the closest to my dad growing up, but as I got older, that slowly changed. \n\nRecently my divorced parents got into an argument over how much my dad was giving as child support money. He was giving a large sum per month and my mom was arguing that it wasn't enough and she needed even more. She claimed that she needed to cover my wifi, water + electric bill, phone bill, a $500 monthly credit card, my insurances, etc., and that all added up to well over what he was giving her.  \n\nAfter hearing about this, I spoke to my dad directly about it all and listened to all he had to say, his concerns, why the conversation came up, and in my opinion, it was all fair. He has his own life and other things going on obviously, and this whole argument had started because he was thinking about lowering the amount that he would be giving as child support. He had suggested cutting it in half and was asking for a full breakdown of how much my \"monthly expenses\" were in order to figure out if what he was considering giving would still be plenty. Low and behold, it was, way more even. As I mentioned, I recently turned 18 and am a legal adult, there technically speaking is no longer a requirement for him to even continuing offering me aid financially and I am very much grateful for whatever amount I can get, especially since I plan on attending college and moving out of my moms house as soon as possible. \n\nNow for the main issue: In the midst of this debate, after I figured out that my bills weren't anywhere close to what my dad was giving me, I asked my mom where the rest of the money was. She says that she had actually been pocketing the money in hopes of using it as a down payment to a house for \"us\" in a outskirt city a few hours away where I do not want to live. As the title suggests, she racked up about $30k. \n\nI've made it clear to her that I'm moving out and don't want to live in that city at any point, but that's where she wants a house. So now my concern and what'd I'd like advice with is if I'm wrong for feeling like that money should be going to me and not to her potential house? In my mind I sound like an A-hole for even believing it but from what I remember there really was no mention of this money until I found out about it. She claims that she's mentioned it several times before but I honestly am not sure if I remember her bringing it up or not. \n\nI'd also like to make it known that I do not like to talk to my mom about things like this because anytime I do, I end up feeling like the bad guy. For example, the moment I sat down to talk to her about the expenses, she started yelling and saying I'm just like my dad and that if I want to act like him I can just go live with him. \n\nI don't intend on spending the money or going crazy with this huge amount, but college is right around the corner and being able to pay that off fairly easily sounds really good to me. I also have to pay my dad $5k back for my car that he helped me purchase; I currently have two jobs while in high school to ensure I have enough money to support myself, but Im just worrying too much about the near-coming future?\n\nSo again, am I wrong for thinking that I should be able to use that money for my college? What should I do about this situation? Feel free to ask any extra questions for more information.",
            "Q_score": 655,
            "Id": "126x7wh",
            "Url": "https://www.reddit.com/r/Advice/comments/126x7wh/my_mom_has_kept_30k_in_child_support_money_and/",
            "Aswer": " So let’s look at this another way. Your mom used 100% of your dad’s child support money to raise you. That allowed her to put some of HER money in a savings account for a house. There. Fixed it for you.",
            "A_score": 796
        },
        {
            "Question": "is it unreasonable for me to ask my friend not to smoke weed when we're together?\ni Simply dislike it. I don't like the smell nor the way she behaves when she's high. also it gets kinda awkward because i don't smoke and she's by herself giggling all the time and we can't do shit cause she's high.\n\nbefore she stared smoking we would do a lot together but now it's just me going to her place (she never comes to mine) and watching her smoke. \n\nis it selfish of me to ask her to change her habits when I'm around? be brutally honest.",
            "Q_score": 29,
            "Id": "127ipx6",
            "Url": "https://www.reddit.com/r/Advice/comments/127ipx6/is_it_unreasonable_for_me_to_ask_my_friend_not_to/",
            "Aswer": "It's fair for you to not want to chill with her while she smokes. I would just say, \"hey its not really fun for me just to sit at your house and watch you smoke. Maybe if you want to meet at the park before or after and do x y and z that would be more fun for me.\" And if she says nah then cut your loses.",
            "A_score": 40
        },
        {
            "Question": "Alternative ways of saying \"I dropped out of high school\"\n",
            "Q_score": 141,
            "Id": "1278re9",
            "Url": "https://www.reddit.com/r/Advice/comments/1278re9/alternative_ways_of_saying_i_dropped_out_of_high/",
            "Aswer": "I education't",
            "A_score": 349
        },
        {
            "Question": "In a couple weeks I'm meeting my new coworkers and I'm worried they are going to reject me because of my looks\nIn two weeks I'm (25f) starting in my new job and I will have to meet my new coworkers. This makes me nervous because I'm objectively unattractive.\n\nI have considered cosmetic surgery, but I understood that it's not the right thing to do in my case, so I started to accept myself. But that isn't going to make people accept me, so I'm worried my coworkers will dismiss or ignore me because how I look. This happens to me very often, people talk to my friends and ignore me when I'm right there next to them.\n\nHow can I prevent that for happening in my new workplace? Fuck, I'm actually nice, and inteligent! I don't want to be treated like a piece of furniture",
            "Q_score": 45,
            "Id": "127f2yp",
            "Url": "https://www.reddit.com/r/Advice/comments/127f2yp/in_a_couple_weeks_im_meeting_my_new_coworkers_and/",
            "Aswer": "I really don’t care what my coworkers look like as long as they do their job and aren’t a pain in the ass! You’ll be fine!!",
            "A_score": 86
        },
        {
            "Question": "Flatmate has s/o but is getting very close with me\nSo kinda need some outside perspectives on this one, a new flat mate of mine has recently being coming into bed with me at night,we just talk and watch movies but also get into some deep convos we don’t sleep together tho, I can’t tell if she has a thing for me or is just overly friendly, but she does have a long distance boyfriend who I’m sure doesn’t know she goes in my bed, i just go along with it now as we get along good but is it ethical to keep this going? Or is it just someone who’s super friendly?",
            "Q_score": 31,
            "Id": "127foa8",
            "Url": "https://www.reddit.com/r/Advice/comments/127foa8/flatmate_has_so_but_is_getting_very_close_with_me/",
            "Aswer": "that's a bit weird to get into bed with someone when u have a bf",
            "A_score": 83
        },
        {
            "Question": "Update: Trying to call my foster mother, mom.\nSo I told her I wanted to talk with her she said okay and came in my room later that night. She brought me a cup of tea and I started telling her how much she meant to me and how thankful I am for her. She said of course honey you’ll always be my daughter and I broke out in tears and just hugged her but I got scared and never actually told her I wanted to start calling her mom and now I feel like an idiot. How do I go about telling her?",
            "Q_score": 171,
            "Id": "127127z",
            "Url": "https://www.reddit.com/r/Advice/comments/127127z/update_trying_to_call_my_foster_mother_mom/",
            "Aswer": "Don’t tell her, just start doing it. She already calls you daughter she already sees herself as your mom. I don’t think you’d have to warn her or ask permission for that sort of thing.",
            "A_score": 162
        },
        {
            "Question": "My boss is always mentioning how short I am\nMy boss is a very tall woman. I am a very petite woman. She has a habit of constantly mentioning my height. \n\nMost recently at a very large meeting she referred to me as “she may be short and small but she has an important role”. \n\nI am just really sick of this and don’t how to bring this up to her. I am a middle aged professional woman who doesn’t need to constantly be belittled because of my height and stature.\n\nThis situation is really getting me down. How do I deal with it?",
            "Q_score": 529,
            "Id": "126mkfj",
            "Url": "https://www.reddit.com/r/Advice/comments/126mkfj/my_boss_is_always_mentioning_how_short_i_am/",
            "Aswer": "pop your head in her office and be like 'i'd just like to say 'please don't bring up my height with others again. k, thanks, bye!' lol",
            "A_score": 641
        },
        {
            "Question": "Coworker MIA. Should I be concerned?\nMy coworker who’s been working at our company since last summer suddenly stopped showing up to work.  She got along get with everyone in our department and was very friendly and outgoing.  She liked her job and didn’t seem to have any issues that we know of.  No one including our managers have been able to get a hold of her.  Her Facebook status will be active for a little bit but our messages go unread.  I don’t want to invade her privacy but I am concerned because this is unlike her.  What should I do?",
            "Q_score": 317,
            "Id": "126n1zc",
            "Url": "https://www.reddit.com/r/Advice/comments/126n1zc/coworker_mia_should_i_be_concerned/",
            "Aswer": "HR should have an emergency contact to try calling. Otherwise asking local police to do a wellness check is appropriate.",
            "A_score": 707
        },
        {
            "Question": "What do I do? I’m scared and freaking out\nMy Ex girlfriend threatened to leak my nudes to my Freinds And family unless I pay her 500$ By Apr 10, I (13M) And my ex (14F) broke up Yesterday I caught her cheating and I broke it off with her, she then Messaged me today That if I don’t pay her 500$ By apr 10 She will leak my nudes, I’m so stupid for sending nudes but we both sent nudes to each other I never saved hers But I had no idea she saved mines. After we broke up She deleted All her nudes she sent, what’s worst is that we messaged on discord. Meaning she just instantly deleted them the moment we broke up, She met my parents and my siblings Yet I never met hers. She told me it’s because they are always “busy” I don’t know what I’ll do there’s no way I can make 500$ and she knows this. I feel like a complete idiot. She insisted on sending nudes and I gave in. I wish I wasn’t blinded by her\n\nEdit: it may not look it but I’ve read every single one of your comments Thank you so much, I’ve screen shotted the messages of her black mailing and I will be Talking to my parents about this tomorrow. Thank you guys",
            "Q_score": 31,
            "Id": "126v9av",
            "Url": "https://www.reddit.com/r/Advice/comments/126v9av/what_do_i_do_im_scared_and_freaking_out/",
            "Aswer": "She is committing a crime.  Call the police.",
            "A_score": 112
        },
        {
            "Question": "My parents want me (18) to go to jail for my sister (25)\nI don’t know if the title is exactly accurate but it’s closest to what’s happening. And please don’t think I’m being over dramatic I’m only sharing this incident because it’s not too bad and can paint a picture. \n\nHi I’m Jordan (18). Long story short I’m the only “civilian” (what my family calls me) in a family of people that have been in the street life at some point or another. I’m confused on what to do and how to compromise. \n\nMy sister (25) recently got into a fight with this girl and when I was holding her accountable for her actions I was berated and told “you don’t do that to family. It doesn’t matter what happened, you should have her side no matter what”. I was told I was wrong when removing myself from the situation incase a witness was needed, but then told not to tell 100% of the truth if it makes my sister look bad. \n\nI won’t say exactly but through multiple situations my mom has shown me that she has no problem throwing me under the bus if it saves my sister. Which has me totally confused because I’m being told that family should support each other but I’m supposed to take the fall for my sister. I’m supposed to lie for my sister. I’m supposed to put myself in jeopardy to go to jail so that my sister can walk free. But why doesn’t my family try to keep me out of that situation? Why would my family feel comfortable putting me in jail when I’ve never did anything to have any run in with the police? I’m told that I have a bad view of family and I should do better. My only concern is doing what’s right. \n\nI’ve been told by my parents that they’re happy that I never got put into that kind of life but then I’m almost belittled and berated for not being able to understand it. I’m asked for my opinion but then yelled at and told “you’ve never gone through it so you could never understand“. I don’t have the funds to move out because I’m saving to start school. Do they not like me or something? What can I do?",
            "Q_score": 93,
            "Id": "126l7xr",
            "Url": "https://www.reddit.com/r/Advice/comments/126l7xr/my_parents_want_me_18_to_go_to_jail_for_my_sister/",
            "Aswer": "Seems to me you're a good apple in a bad bunch.\n\nThey see you as a mark, a fall person for their more favored offspring, your sister.\n\nRun, do not lie for her, go to the police and tell them they are trying to tamper with witnesses if there is an open case already. As that is a crime, and just find a way to make your own way in life.",
            "A_score": 182
        },
        {
            "Question": "My husband hides my toys!! HELP!\nLet me start by saying this man has an ego problem when it comes to our sex life. He is very inconsistent with everything, down to our finances. The first time, i was looking for my toy in my drawer, and it disappeared for over 3 months. I played along with it and then called him out on it when it reappeared. \n\nMost recently we moved and I put all the contents from the drawer into my bag. I've been looking for this bag for about 2 months  and I finally found the bag and my toys are missing. \n\nI'm so sick of his subtle controlling ways. He looks for ways to take away things I enjoy that intimidate him  but does nothing to actually fix our issues. I can't speak to anyone about this because it's so embarrassing. Should I try to have a real conversation about this?\n\nUPDATE!!!: I spoke to him about it, he didn't say anything at first then he started gaslighting me. Answering questions with questions then denied taking it. He did finally admit to hiding my last toy, stating, \"because he didn't want his step-son to get to it\" which is odd because he denied it for months! These rose toys are expensive, I'm mad I have to buy a new one. FYI - we did therapy in the past. After one session, he said the therapist should focus on her problems first. Would this be grounds for divorce for you?",
            "Q_score": 1012,
            "Id": "1263yki",
            "Url": "https://www.reddit.com/r/Advice/comments/1263yki/my_husband_hides_my_toys_help/",
            "Aswer": "This is not embarrassing for you, it’s embarrassing for him. The fact he is going behind your back and hiding your toys rather than actually speaking to you shows he is a spoilt man child. It is absolutely controlling behaviour OP and a huge red flag. Your husband is putting his ego and pride above your body and pleasure in the most unhealthy way. If he’s jealous of a material item and chooses to deal with it by physically hiding it from you, what will be next? This isn’t about the toys it’s about control.",
            "A_score": 994
        },
        {
            "Question": "My boyfriend of 8 months refuses to do anything most days besides playing video games\nMe (25F) and my boyfriend (44M) refuses to do anything with me out in public most days and seems to think that eventually in time I’ll have to be responsible for all the household tasks and if we ever have kids I’ll have to be the sole provider so all he’ll have to do is pay bills and go to work. He does pay a majority of the bills because he does make more money. I think that we both need to split the needs of work in the house 50/50, I’ve mentioned to him before that it bothers me that we don’t do things together and he’ll usually come back with something like “ well we watched a movie together the other day” or “I’m trying to save money” even though he gets Amazon packages like everyday. Am I being unreasonable or annoying? Or is boyfriend the one who should step up?\n\n\n\nClarification: \nI am not a mom I don’t have children, I don’t really have a desire to have children when America is the way it is. I’m all set. I am however am about to finish my first year of college and I work 30+ hours a week as an LNA. I don’t expect this to make anyone’s opinions change in the comments I just wanted to clarify I am not a mom. But I am one busy chick.",
            "Q_score": 37,
            "Id": "126qhj1",
            "Url": "https://www.reddit.com/r/Advice/comments/126qhj1/my_boyfriend_of_8_months_refuses_to_do_anything/",
            "Aswer": "He wants a maid, a mother, a caretaker, a slave. He's basically flat out told you that.  Hes 44 and is a manchild. Fucking run.",
            "A_score": 194
        },
        {
            "Question": "I walked in on my son doing it😬\nI am a mom of 3 boys. 17, 14, and 11. Tonight I got off early and came home and loud music was blaring from my 17 year olds room. I knocked twice, got no answer so I came in. He had a girl in there and saw them doing the deed. I started screaming and so did they and I ran out. I didn’t think I’d ever have to experience this, or at least not any time soon. I’m so embarrassed and don’t even know what to say to him.  I’m kind of just hiding in my room at this point. I’ve already given him talks about safe sex, and the importance of contraceptive. I just feel more awkward then here. What do I even do? Advice?",
            "Q_score": 512,
            "Id": "12676w6",
            "Url": "https://www.reddit.com/r/Advice/comments/12676w6/i_walked_in_on_my_son_doing_it/",
            "Aswer": "I’d just make sure he’s being safe and then pretend it never happened. I’m sure he’s embarrassed too.",
            "A_score": 848
        },
        {
            "Question": "Bedroom rules for my son with a trans friend?\nI have a 15 year old son. When girls are over we have an open door policy, and absolutely no sleepovers. But my son has this new friend he wants to bring around. He’s trans, female to male. I know he is male, and I am not trying to be transphobic in anyway, but should the rule still apply? He still has working reproductive female parts. I’m very lost at this, there is no handbook on this. Advice please??",
            "Q_score": 194,
            "Id": "12685m7",
            "Url": "https://www.reddit.com/r/Advice/comments/12685m7/bedroom_rules_for_my_son_with_a_trans_friend/",
            "Aswer": "if you think your son is sexually active, you need to have that conversation with him and talk about protection. my parents had this rule, i still found a way to do it and it caused some problems before we had that conversation",
            "A_score": 494
        },
        {
            "Question": "My mom (40) opened a credit card in my name name (18) and I did not know until recently, she doesn’t want to close the account or give me the card. She did this worth the excuse that it will help me, but Ik that’s it’s cuz she has bad credit and the bank won’t approve her for a home loan. Help\n",
            "Q_score": 1132,
            "Id": "125jmdx",
            "Url": "https://www.reddit.com/r/Advice/comments/125jmdx/my_mom_40_opened_a_credit_card_in_my_name_name_18/",
            "Aswer": "She is committing identity theft, which is a felony.  You are completely within your rights to tell her that if she does not close the account forthwith, you will be filing a police report.\n\nDon't let her destroy you financially before you even have a chance to get started in life.",
            "A_score": 1747
        },
        {
            "Question": "I was falsely accused of SA and it’s ruining me\nI’m 20 years old in college and a 30 yr old woman has tried to ruin my life, and it’s worked to an extent. I met this woman through work, I thought she was nice, and she was at first. We talked often and became friends, she wanted it to evolve into something more and became infatuated with me and wanted sex, It wasn’t reciprocated at alI. She showed up to my 2nd job (A grocery store) twice. I never told her where I worked. I was minding my own business working when she first showed up, I was walking to the front of the store to do some stuff and was shocked to see her, she lives 30 mins away from where I work so I didn’t know why she was here at my store. She saw me see her and walked up to me and said “Hey! How are you? I’m just on my break” and i’m thinking… why are you on your break here?? It was very awkward and I told her I was busy and needed to go so I left. The 2nd time she showed up, I had just clocked out and was getting ready to leave the store when I suddenly ran into her on my way out. She was “shopping” and was trying to strike up conversation. The first time was already weird af and I was beyond creeped out at this point. I told her I was busy again and needed to be on my way. One day when I wasn’t working, I checked my snap map to see if she was there, she was. \n\nWhenever I’d take a while to respond to her texts she would post on her snap story and make it private so that only I would see it and title the story “Jason pls pls pls read” (jason isn’t my real name but you get the idea). She showed up to my house one time with gifts I didn’t ask for, it was some merch from my favorite shows and some cheep wish.com clothes. She’d post pictures of me to her instagram and would caption it cringey shit like “#mr.sideprofile” I never asked her to do that, she just did. Overtime her texts to me became increasingly explicit. The final straw was when she asked me to “fuck her savagely” after that I said she was really creepy and blocked her on everything. I could’ve done that ages ago before it got extreme and I should have but that doesn’t make what she did okay. \n\nAfter I blocked her she tried emailing me multiple times through different accounts and started texting my friends and was playing the victim saying “he blocked me and i don’t know why🥺” my friends told me and asked me who this was and i explained everything to them, after which they told her to fuck off. For a couple days that was it, not much happened with her. \n\nOne the first day of the semester at a new school I transferred to, I get a call from campus police, saying I need to talk with them. I meet up in an office with some office worker and a cop. They told me about some comments that were made on the school’s instagram. They showed me a printout of it. It was a bunch of sock puppet accounts commenting on posts saying that I was a rapist and have sexually assaulted many people. I knew instantly it was her doing. She didn’t even do a good job of hiding it. All the accounts names were from things she knew I liked. One was “corpse bride casting” and another was “starplatinum_gold47” They were all references to shows and movies i liked. Luckily I had screenshots of her trying to ask me for sex and other weird crazy shit she did. After i showed them all that and explained who she was, they believed me and said they would open a case against her, nothing ever came of it though and it was eventually closed because apparently the cop couldn’t get in contact with her. The comments were the last thing she did and it’s been quiet from her. The damage had been done though. My reputation was fucked. I’ve lost count of how many times i’ve had to explain to people i’m not a rapist. It doesn’t always work. My peers would talk about it and try to warn people of me. I tried asking the faculty to do something about it but they don’t do shit. \n\nI’m tired and angry all the time. I want to be normal. I want to take action. I don’t want to live like this anymore. I’m so tired of being made out to be a monster. I’m not. I want people to leave me alone and let me live. \n\nPlease offer your advice on how I can deal this. Anything would be greatly appreciated. Thank you",
            "Q_score": 43,
            "Id": "1266er4",
            "Url": "https://www.reddit.com/r/Advice/comments/1266er4/i_was_falsely_accused_of_sa_and_its_ruining_me/",
            "Aswer": "You need to contact a lawyer. I know that all colleges have a legal aid center where you can receive a legal advice for a reduce rate or free. I’m just a law student, but it sounds like you really could go after her civilly for damages(money). She defames your character, you might be able to get a tort against her, and maybe against the school for poor handling",
            "A_score": 74
        },
        {
            "Question": "My mom bought a house under my name without my permission!!!!\nHi some context, my mom lives in Florida and I live in New York. I am currently in school to become a nurse and am supporting myself on my own. I had read to let my credit agencies know to put a freeze on my credit because I knew my mom would do something like this. I guess I forgot that my mom literally knows my social security. What do I do, I am freaking out!!! I don’t know whether I should call the SSA or what, I can’t let my credit take a hit because my mom has a gambling problem and can’t pay her bills.\n\n\nHelp!!!!",
            "Q_score": 142,
            "Id": "125vl04",
            "Url": "https://www.reddit.com/r/Advice/comments/125vl04/my_mom_bought_a_house_under_my_name_without_my/",
            "Aswer": "Are you willing to charge her with fraud for forging your signature?",
            "A_score": 273
        },
        {
            "Question": "I'm (24f) getting a series of cosmetic surgeries and my (27m) boyfriend is acting like I'm going to pass away\nI'm (24f) going to have several cosmetic surgeries (Nose job, bichectomy, laser freckle removal, etc) in the next months. My boyfriend initially was against it, but later he agreed to support me and kind accepted it.\n\nBut his towards me attitude is really startling me. Every day he takes my face in his hands and kiss my nose and cheeks for several minutes. He takes photos of me very often. Last night he believed I was asleep when he went to bed and he kissed me and whispered \"My beautiful girl, how I'm going to miss you\". It's like he thought I'm going to die because of the surgeries or something, when they are totally safe. How can I make him see that he isn't going to lose me?\n\nTLDR: I'm getting cosmetic surgeries and my boyfriend is acring like I'm going to die on the table",
            "Q_score": 74,
            "Id": "125zmj8",
            "Url": "https://www.reddit.com/r/Advice/comments/125zmj8/im_24f_getting_a_series_of_cosmetic_surgeries_and/",
            "Aswer": "I don’t think he thinks you’re going to die, but it sounds like he will miss the way you look now.",
            "A_score": 489
        },
        {
            "Question": "Boyfriend got mad over me wearing a tank top\n(thread closed)",
            "Q_score": 215,
            "Id": "125ncgu",
            "Url": "https://www.reddit.com/r/Advice/comments/125ncgu/boyfriend_got_mad_over_me_wearing_a_tank_top/",
            "Aswer": ">sweet, kind, and he treats me with respect \n\nExcept he blew his lid over you wearing a tank top. Not very sweet, kind, or treating you with respect.",
            "A_score": 593
        }
    ]
}