{
    "Posts": [
        {
            "Question": "How do you handle people asking to be invited to an event you didn’t invite them to?\nSo I invited 15 of my closest friends/coworkers to my birthday party and now I’m having a bunch of randoms messaging me about “what are you doing for your birthday?”. Most annoying is a girl who constantly plans events and has never once invited me (not that I’d care to hang out with her) but she’s been trying to weasel her way in through multiple people. Isn’t it awkward for people to ask to come somewhere they weren’t invited??",
            "Q_score": 281,
            "Id": "11uj0o5",
            "Url": "https://www.reddit.com/r/Advice/comments/11uj0o5/how_do_you_handle_people_asking_to_be_invited_to/",
            "Aswer": "Jist answer truthfully: \"I'm getting together with some friends.\"\n\nNo need to explain, justify or apologise.",
            "A_score": 395
        },
        {
            "Question": "I slept with my female friend even though I am gay. I don't know what else to do.\nI don't know where to start. It is a massive fuck up from my part. For starters, I (30M) was in a relationship with my boyfriend John (30M) for 7 years. I found out he was having an affair with a married man (34M). I got to know because that married man's wife, Kelly (32F) showed up to my place to talk to my boyfriend but he wasn't there at that time. That's when she informed me that my boyfriend and her husband has been having an affair for 3 years. The woman just cried in front of me. And we both confronted each other's significant others. I broke up with John and Kelly got a divorce. Over the last 3 years Kelly and I have started to talk. At first she approached me by saying a lot of her family and friends are against her because she is not happy with her husband coming out and even calling her homophobic. I explained to her that she wasn't homophobic. It is justifiable for her to feel hurt over this. \n\nShe is a nice and kind woman. I liked her. I liked spending time with her. Her friends have also became my friends. She and I helped each other through our tough times. Over the last 3 years we have been in and out of relationships with other people. Last night she called me and said she is alone because that day was her anniversary. I asked her if she needed me to be there, she told me yes if I don't mind. I went there. We were lying on her bed and kinda tipsy from all the alcohol. We were talking and she said how much she feels alone and humiliated by her ex-husband. I said I understand. Then she snuggled closer to me and kissed me. She immediately stopped and said sorry multiple times. I just brushed it off and said it's fine we are just tipsy. The next time I kissed her and one thing led to another we had sex. And it was not like I hated it or repulsed by her. In fact we did it 2 more times before falling asleep. The next morning we talked. She says that she understands that I am going through some stuff and said sorry if I ever felt forced. I told her no, it was consented. I left her place. I don't know what happened to me. I knew I was gay since I was 18. But I did like sleeping with her. I don't know. Maybe I need to rethink my life choices. Is this something normal?",
            "Q_score": 27,
            "Id": "11uqi3b",
            "Url": "https://www.reddit.com/r/Advice/comments/11uqi3b/i_slept_with_my_female_friend_even_though_i_am/",
            "Aswer": "It's okay to not be gay. You can be bi. It's not a screw up.  You didn't ruin others' relationship by doing this.",
            "A_score": 73
        },
        {
            "Question": "UPDATE: I’m having doubts on if my daughter is biologically mine and don’t know if I should do a paternity test and risk my marriage.\n[original post]\n(https://www.reddit.com/r/Advice/comments/11t7w2x/im_having_doubts_on_if_my_daughter_is/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1)\n\nI don’t know if this is the right way to make an update post i did make an edit on my original post as well. \nI wasn’t expecting to make this update especially the day after. \n\nThis conversation with my wife isn’t new. But from the point where I made the comment she’s been very cold and threatening our marriage saying I better not get the test done behind her back and she also would not allow it to happen at all. I read comments from a lot of women saying they’d be pissed too either way if the test positive or negative from mistrust, so I thought that was the case. We did have a long conversation this morning. She looked through my phone last night and found the post. That’s what sparked the conversation again. She said she was hurt I would keep bringing this up and I should trust her and leave my insecurities behind. \n\nIt was long conversation, a lot of tears and words were said. I offered marriage counseling and dropped the topic of the dna test. She refused and said it’s ridiculous and doesn’t want to involve anyone else in our marriage. \n\nI read a lot of comments and stories saying sometimes the guilt will get to them and they’ll just confess without needing to do a test… I didn’t think that would happen in my case but it did. She told me that she didn’t want this to happen but she did cheat on me and my daughter is not mine. She said she wanted me to be the father and loved me and thought this would be her best option. She didn’t want me to take a test and find out on my own which I wish she would’ve come clean way before. I didn’t know how to respond but asked who the father was because my mind already is making a million assumptions. She didn’t tell me and began crying more telling me to not hate her and not end the marriage. I didn’t say anything again waiting for an answer. This happened early this morning and I didn’t an answer until this afternoon. \n\nI had to leave for work this morning so when I came back she had calmed down a bit and was ready to tell me. Her answer was probably the last thing I was expecting. She cried while saying this but said a few years back when I went on a business trip, she slept with my father who she “ran into on a drunk night” I don’t believe it. My father passed away in December from a colon cancer when he was 45. He did meet my daughter, half sister, his daughter idk.. but never said anything clearly. She said they both decided it was a dumb mistake (a major understatement) and it’d be best to erase it and play me as being the father. Me and my father never had the best relationship I grew up with my single mom but he was present in my life and when he passed it hurt my family a  lot. So hearing this broke me. I am currently staying with my brother. I haven’t spoken about what I’ve learned with anyone even him. I don’t think I’ve fully processed so coming here to write this felt like a good place to get my thoughts out. \n\nI didn’t say anything after she told me that and just left after she finished explaining. I don’t know where I even go from here. I don’t want to abandon my child while she’s technically my half sister but do need time to process this. I don’t think any amount of marriage therapy will fix this so divorce is my next step. I am going to seek a therapist for myself and help myself so I can be there for my daughter.",
            "Q_score": 249,
            "Id": "11u7nf8",
            "Url": "https://www.reddit.com/r/Advice/comments/11u7nf8/update_im_having_doubts_on_if_my_daughter_is/",
            "Aswer": "I’d say get the test done anyway because for all you know, she’s pinning it on your father because you can’t do anything to him about it, and she wants to protect the real father.",
            "A_score": 405
        },
        {
            "Question": "my boyfriend is gonna break up with me if i go abroad for college\ni (f18) am a high school senior and i'm at the stage of applying to different universities. so i live in a city where going abroad for university is a really popular option, especially given its political state at the moment. i don't want to fully disclose the city i live in but it's known as an international city where a lot of non-native/foreign people, like us, reside.\n\ni've been dating my boyfriend (m18) for almost 2 years now and he's currently studying in a local university. i've been wanting to study in australia for a while now, even before i met my bf. my family is planning to immigrate there and my older sister already got a job there and is in the works of managing her move. \n\nmy boyfriend and i talked about studying in australia together but he ended up not being able to go. now it's my turn to decide whether i want to stay here or study there. i'm getting really anxious at the fact that even though the local universities here are highly regarded and have high global university rankings, i feel that their education won't really work with me. and having studied in a local school previously and currently being in an international school allowed me to compare the two environments. and i feel stuck in a local environment since they're so competitive and have a toxic learning environment. i also feel like i would thrive being abroad since this city is so suffocating, i just want to get out. but at the same time, i applied for the national university here and im scared i won't be able to get in.\n\nmy parents are kinda encouraging me to go to australia and they know that the only reason i want to stay is because of my boyfriend. i know that it's wrong to let him hold me back, but my love for him runs really deep. but im questioning whether it's right to stay with him since he's letting me know that he would want to break up with me if i ultimately go to australia for university since he can't manage long distance relationships. i thought that partners would encourage their significant other to achieve great things and that they would stick by them despite ldrs being really difficult. i know that's an immature way of looking at relationships but i've seen that work for my oldest sister and her husband before they got married.\n\ni feel like this might be able to summarise everything you need to know about my situation but i still have so many f thoughts and feelings but i don't think they're relevant for this post. i just don't really know what to do right now. do i stay here with someone i genuinely see a future with or do i go to australia and potentially lose a lifelong partner?",
            "Q_score": 33,
            "Id": "11ujz89",
            "Url": "https://www.reddit.com/r/Advice/comments/11ujz89/my_boyfriend_is_gonna_break_up_with_me_if_i_go/",
            "Aswer": "You are 18, go explore the world, go to Australia, especially if your whole family is planning on going there eventually too...",
            "A_score": 145
        },
        {
            "Question": "A delusional teenager I work with is telling people we're dating\nUPDATE: OKAY! So I consulted with a family friend who is a lawyer and IF THIS GETS OUT I CANNOT BE ARRESTED!! My state has odd statutory rape laws that DO NOT apply in this case. HOWEVER there is still the case of a hostile work environment! He recommended going to the manager once more and explaining the true weight of the situation, and told me to go to HR if they do nothing. He also said to try to find a way to contact his parents in an attempt to let them know that he needs serious help. Thank you so much for all the advice and for helping me relax bout a situation that is fairly easily taken care of!! I'll update again if anything else happens\n\nAlright! So I don't know what to do about any of this. I (20F) am a server at a local restaurant. I have a decent amount of underage coworkers that I'm always nice to because I remember what it was like to be a teenager around adults who hated me. However, this one busser (16M) has gotten some sort of delusion in his head that we're dating, and I'm worried it's going to ruin my life.\n\nI've heard from coworkers who are my age AND who are his age and go to school with him that he's been saying we've had sex, I've performed sexual acts on him, and that my long-term partner who I talk frequently about at work is a cover story. Apparently he's said these things both at work (less of the lewd rumors) and at school CONSTANTLY.\n\nI've spoken to him about this, I've spoken to my managers (unfortunately they can't schedule me around him, against corporate rules.) Every single time someone mentions these rumours I vehemently disspell them, but it's all just getting worse and I'm afraid he's going to absolutely ruin my life.\n\nUnfortunately quitting isn't an option as this is the only place I can work with my school schedule, and I've gone as far as threatening legal action. I'm at a loss as to what to do to make these rumours stop besides finding a way to contact his parents and begging them to get him help. What do I do?! I'm constantly on the verge of a panic attack...",
            "Q_score": 1198,
            "Id": "11tqyw2",
            "Url": "https://www.reddit.com/r/Advice/comments/11tqyw2/a_delusional_teenager_i_work_with_is_telling/",
            "Aswer": "Go above the managers to thier managers or HR. And let them know it's sexual harassment.",
            "A_score": 1856
        },
        {
            "Question": "How to help partner with period?\nI (m17) am in my first committed relationship with my girlfriend (f17) who has had inconsistent periods all her life, she’s finally on birth control for consistency and today her period started, what can I do to help her? I’ve made myself as available as I can be to help her out and talk to her, I just want to be able to help her somehow since I know she is feeling horrible. Any advice?",
            "Q_score": 196,
            "Id": "11u1hh4",
            "Url": "https://www.reddit.com/r/Advice/comments/11u1hh4/how_to_help_partner_with_period/",
            "Aswer": "It's very sweet that you want to help her, but there is no \"How to\". Ask your girlfriend what she needs and provide that.",
            "A_score": 273
        },
        {
            "Question": "My girlfriend (23F) is asking me (23M) to unfollow girls I know on Instagram.\nSo my girlfriend of almost 1.5 years has very bad anxiety, and I do all that I can to ease her worries, reassure her I love her, and help her out. Things have been rough for us both personally, but our relationship has been good together for the most part.\n\nToday, out of the blue, I woke up to a long message about how she doesn't like me following other girls on Instagram (mind you, these are girls I've met once or twice either at EDM festivals, just out and about, struck up a conversation once or twice and or mutuals. I've never had anything romantic with them and I have no intentions on hitting them up/cheating on my girlfriend.). This was a recurring topic for a while that died down for a very long time, but just came up again. I told her I never talk to these girls online really, and I never check their pages, their feeds, etc and that there's nothing to worry about. I'm hardly even much of a media person outside of YouTube. I know she has problems with guys following models, but I don't do that. So I said that I don't want her to be controlling towards me because I'm never that way with her, and I'm not okay with her if she gives me this ultimatum when I've done so much for her to try to ease her anxiety and prove to her that I love her. (BTW she is posted on my Instagram so other girls would know I have a girlfriend anyway)\n\nShe says that me being reluctant to unfollow them shows I value them more than I value my relationship with her and that me following other girls gives her the ick. But for me, it's not about her telling me to unfollow specific people -- for me, it's about upholding my standards and establishing what trust means and not letting other people tell me how to manage my social media, etc. I have no problem unfollowing these people, but I think it points to larger red flags if she feels this way simply about me following these girls I don't interact with at all.\n\nAm I in the wrong for not unfollowing these girls I don't interact with on Insta because my girlfriend wants me to? Should I just leave?",
            "Q_score": 318,
            "Id": "11tv34v",
            "Url": "https://www.reddit.com/r/Advice/comments/11tv34v/my_girlfriend_23f_is_asking_me_23m_to_unfollow/",
            "Aswer": "As a woman who has struggled with these feelings in the past in relationships (as in i was wanting my partner to block IG girls) even if you unfollow these girls there will always be something else or someone else that will make her insecure and it will just cycle again. She will believe you are doing it to appease her if you do it or she will believe you are choosing them over her if you don’t. I have matured from these insecurities after therapy but honestly medication was the biggest help for my anxiety/self esteem. Try and explain your point of view with understanding and sensitivity. If she isn’t willing to trust you and to begin to self love it will be impossible for her to maintain a healthy relationship with you or anyone else. Do you interact with the specific girls at all by swiping on stories or liking lots of their photos? Is there a reason she feels insecure about them in particular?",
            "A_score": 349
        },
        {
            "Question": "Why am I still disgusted with my boyfriend\nI’ve been dating my boyfriend for three years now. Honestly when we met I wasn’t looking for a relationship, and I don’t think he was either. \nSo when we first met I saw him and I felt disgusted. This overwhelming feeling of disgust… \nI ignored it then, as we’d only just met, but to this day it’s still there. \nThere’s things I’ve grown to love about him, but still underneath this feeling of disgust is there. \nWhy do I feel this way?",
            "Q_score": 34,
            "Id": "11u8el3",
            "Url": "https://www.reddit.com/r/Advice/comments/11u8el3/why_am_i_still_disgusted_with_my_boyfriend/",
            "Aswer": "Why did you date someone you think is disgusting in the first place? Why  are you still dating him? You are not doing either him nor you any favors. You haven't changed in feelings towards him and honestly it's going to turn to resentment eventually, it doesn't matter if you've \"grown to love some stuff...\"  Break up so he can find someone who truely loves and accept him, you'll be cruel to stay. \n\n\nAnd if your only arguments to this is \"but we've been together this long..\" and \"but I kinda love him..\"  , that's not a good enough reason to stay",
            "A_score": 648
        },
        {
            "Question": "Do I tell my sister she messed up my life from a car accident when we were teenagers?\nShe was 16. I was 14. She was driving, I was thrown from the vehicle.  We are now both in our late 40s.  I have had chronic pain, chronic migraines, infertility, and mental health issues mostly starting after that accident.  \nMy sister and I do not have a good relationship.  My sister is not a nice person and has kept her kids away from me because of family drama.  This has broken my heart.  Due to this I also have very bad relationships with my parents, they side with her.  They think I’m the problem and she’s the saint.   After a series of MRIs recently, I have learned all these health issues I’ve had most of my life are probably happened to me because of that car accident.  If I don’t tell her how can I stop myself from internally blaming her more?",
            "Q_score": 292,
            "Id": "11to9u9",
            "Url": "https://www.reddit.com/r/Advice/comments/11to9u9/do_i_tell_my_sister_she_messed_up_my_life_from_a/",
            "Aswer": "Have you discussed your resentment towards her in any other way besides internally? If not Try writing it on paper or talking to a therapist or someone close to you. 100% there is no need to bring it up to her unless you feel that it will help you forgive and start to rekindle a healthy relationship. She was young and cannot be held fully responsible for your physical and mental problems. It’s time to forgive and forget.",
            "A_score": 273
        },
        {
            "Question": "Am I under social obligation to buy two chairs for my balcony?\nI am still recovering from losing my family in 2021, and my cat and I have moved to an apartment building for people with disabilities or who are elderly (I am on disability and very poor.).  I really love it here, and I especially love that I can pay the bills here, without being in the red.  I have a very nice balcony on the seventh floor and am trying to get things for it, now that the weather is changing.  I looked at Walmart today, and I had an anxiety crisis at Walmart and left chairless.  The issue is that I really don't have a lot of money, and my choice is that I can either afford one nice chair that is really comfy, where I can sit outside with my cat and metabolize my vitamin D; or I can afford two plastic deck chairs that are pretty comfortable but not as good as the more expensive one (and the expensive one is pretty, while these are grey molded plastic).  I feel like I'm being a jerk if I just buy one chair though, because people will come over, and I will only have my own chair and nothing for them, and I am breaking some social contract.  But I also really want to just have a comfy chair that I can sit in and watch the sun rise, with my cat.  I wanted to hear the opinions of some people who don't find this to be an anxiety inducing, tear summoning conundrum to help me decide.  Thank you in advance for any help.",
            "Q_score": 39,
            "Id": "11u3pkf",
            "Url": "https://www.reddit.com/r/Advice/comments/11u3pkf/am_i_under_social_obligation_to_buy_two_chairs/",
            "Aswer": "You can bring a kitchen chair out when you have the occasional guest. They can sit in the pretty chair. 99% of the time you will have it to yourself.",
            "A_score": 88
        },
        {
            "Question": "Mods from depression post retaliating?\nI made a post on the r/ depression a while ago and looked through the rules 3 times before finalizing my post to make sure it met the mod’s standards. Soon it got to 16 comments and almost 100 likes and I was able to gain a lot of insight from so many amazing people. However, there were 3 comments that I got email notifications on but they were deleted off of my post so I could unfortunately only read through the first half of them. I sent a message to the moderators to find out why they had been deleted, and shortly after I found that I can no longer access ANY of the comments on from the original post, and the post itself has been disabled/deleted. Why would they do this to someone struggling? I gained so much reassurance from the comments that I was able to read in time and was just starting to feel alright again. Now the mods have completely taken it away. I’ve messaged them again about this, and still complete silence on their end. Can anyone else access those comments from your end from my profile? Please help me learn what went wrong if you can…",
            "Q_score": 28,
            "Id": "11tyywb",
            "Url": "https://www.reddit.com/r/Advice/comments/11tyywb/mods_from_depression_post_retaliating/",
            "Aswer": "I can see the post in your profile, but it’s locked and all the comments are gone. Reddit mods being cruel and drunk on their own little bit of “power” is a pretty well known issue. Not really much you can do about it; they’ll never admit they were wrong or reverse their decisions. They’ll also never bother with explaining to you what the problem was. I’m surprised they didn’t mute you so you can’t even contact them anymore, that’s what usually happens.",
            "A_score": 31
        },
        {
            "Question": "Nobody likes me\nI don't understand. I'm sociable. I'm attractive. I'm empathetic. I'm well-mannered. I'm charming. I'm wise. I give good advice. These are some qualities other people have ascribed to me.\n\nI've had friends before when I was in my early 20s, but I had a falling out with many of them, and the overall number of friends I had were minimal at best. I'm now in my late 20s and left with but a single friend with no idea how to find more. I'm not invited to parties anymore as I was in my teens/early 20s since my peers now have families and careers. Also, I'd feel awkward going to a party thrown by early 20s. \n\nI feel that it might be my attitude that is off-putting to people. I don't know why, I always try to uplift everyone around me, and im kind and respectful. Though it's true that I can often be rather sassy. I suppose the main inhibitor of my attitude is my persistent depression, which dampens my mood and, therefore, my attitude considerably. My life sucks. That's just how I feel. I don't really go out there displaying this attitude to everyone, though,  but I guess maybe people feel the energy when they're around me?",
            "Q_score": 113,
            "Id": "11tmwxo",
            "Url": "https://www.reddit.com/r/Advice/comments/11tmwxo/nobody_likes_me/",
            "Aswer": "Hey! i feel like losing friends is a part of growing up, it’s totally fine. instead of focusing on the people that you’re losing touch with, i think you should find a new hobby, start treating yourself as a friend and go out for walks, start enjoying your own company. I used to feel like you too, i decided to focus on myself and now i don’t feel the need to socialise, i talk to whoever talks to me, and i am content with myself. I hope your depression gets better !",
            "A_score": 92
        },
        {
            "Question": "How can I style my hijab and outfit for a formal event (wedding or dinner party)?\nAs many Muslim women living in the West know, wearing \"\"modest traditional\"\" fashion when with family is a must, even if we dress however we like on any other day. So, I don't have much experience with dressing for formal events such as weddings or dinner parties with (distant) relatives and old family friends. As I was recently invited to such an event, I realized I don't really own a lot of \"\"appropriate\"\" attire and don't really know how to style my hijab and outfit to look stylish but modest.\n\n&#x200B;\n\nWhile the internet helped me come up with a few ideas that might help other Muslim women who are in a similar situation, I'm hoping to hear from women on this sub, especially Muslim.\n\n&#x200B;\n\nOne idea I liked is a long, flowing maxi dress in a luxurious fabric such as silk or chiffon, paired with a coordinating hijab in a complementary color (and adding some sparkly accessories). Another is to wear a formal suit or dress pants with a blazer and blouse, again in luxurious fabrics such as silk or satin. A turban-style hijab (or even a simple hijab) with a fancy brooch should also add some elegance.\n\n&#x200B;\n\nI've also found inspiration from other Muslim women online who share their outfit ideas and styling tips. Many Muslim fashion bloggers and influencers have Instagram pages or YouTube channels where they share their latest looks and outfit ideas, and I'm increasingly falling in love with the designs from [Abaya](https://www.amanis.co.uk/).\n\n&#x200B;\n\nFinally, are there specific online retailers that cater to Muslim fashion you girls use more than others? And how do they balance fashion and modesty when selecting their outfits?\n\n&#x200B;\n\nTL;DR: I would love to hear other Muslim women's experiences with dressing for formal events. I would really love to feel \"\"stylish\"\" while also honoring my family's cultural traditions. Any tips or advice would be greatly appreciated!",
            "Q_score": 33,
            "Id": "11tu1qh",
            "Url": "https://www.reddit.com/r/Advice/comments/11tu1qh/how_can_i_style_my_hijab_and_outfit_for_a_formal/",
            "Aswer": "Probably r/hijabis will help",
            "A_score": 7
        },
        {
            "Question": "How do I make my gf orgasm ?\n\nSoo i and my girl are in early 20s . I am not able to make her orgasm , even after fingering her for like 15 min straight she does get to that point .\nPlease help me , how do i make her orgasm . Even with penetration she is not getting it , although she used to get them in previous relationships",
            "Q_score": 150,
            "Id": "11tikli",
            "Url": "https://www.reddit.com/r/Advice/comments/11tikli/how_do_i_make_my_gf_orgasm/",
            "Aswer": "Are you aware of the clitoris?",
            "A_score": 804
        },
        {
            "Question": "I’m having doubts on if my daughter is biologically mine and don’t know if I should take a paternity test and risk my marriage..\nI’m new to Reddit but I’m currently in a tough place and need an outside perspective. \n\nMe and my wife of 3 years have a baby girl she’s 2. They’re my world and honestly I’ve been beating myself up even having these thoughts but recently I’ve doubted if she’s really my biological daughter. We have similarities but there are certain things that have me second guessing. My wife and I both have green eyes I’m mixed and she’s Italian and American. My baby has brown eyes I know it’s a possible for two green eyed parents to have a brown eyed baby but I’ve read it’s rare. \n\nA few years back I had to travel for work and I had my suspicions of my wife cheating but the thought alone brought me to tears. I discussed it with her and she assured me she was loyal to me. She has cheated in her previous relationship but I didn’t want to judge based on that because she was in high school and we’ve all done dumb shit we regret as kids. \n\nI have discussed my concerns with her and to say I caused an argument would be an understatement. She got extremely upset and asked me how I could insinuate that she would ever cheat on me or that my baby isn’t mine. I’ve spoken to her in the past ab my doubts and she told me she would never cheat. I brought it up again and said I had my doubts but I’ll drop it and apologized. She got very defensive and started crying saying “I guess you want a paternity test since you don’t believe me”. I said no but after speaking with my family about it I think I may want one just to clear my mind. If she’s mine I’ll hate myself for ever being doubtful but if she’s not I still haven’t thought about the consequences that can bring. She is my daughter and I love her no matter what but what will that do to my marriage. \n\nThis has caused me so much internal conflict and I’ve spent nights crying thinking I could be making the biggest mistake of my life. If anyone has any advice or has been in a similar situation from mine or my wife’s perspective it would be greatly appreciated.\n\nEdit/Update: \nI was going to make an update post but don’t know how so I hope this works.\nI wasn’t expecting to make this update especially the day after. \n\nThis conversation with my wife isn’t new. But from the point where I made the comment she’s been very cold and threatening our marriage saying I better not get the test done behind her back and she also would not allow it to happen at all. I read comments from a lot of women saying they’d be pissed too either way if the test positive or negative from mistrust, so I thought that was the case. We did have a long conversation this morning. She looked through my phone last night and found the post. That’s what sparked the conversation again. She said she was hurt I would keep bringing this up and I should trust her and leave my insecurities behind. \n\nIt was long conversation, a lot of tears and words were said. I offered marriage counseling and dropped the topic of the dna test. She refused and said it’s ridiculous and doesn’t want to involve anyone else in our marriage. \n\nI read a lot of comments and stories saying sometimes the guilt will get to them and they’ll just confess without needing to do a test… I didn’t think that would happen in my case but it did. She told me that she didn’t want this to happen but she did cheat on me and my daughter is not mine. She said she wanted me to be the father and loved me and thought this would be her best option. She didn’t want me to take a test and find out on my own which I wish she would’ve come clean way before. I didn’t know how to respond but asked who the father was because my mind already is making a million assumptions. She didn’t tell me and began crying more telling me to not hate her and not end the marriage. I didn’t say anything again waiting for an answer. This happened early this morning and I didn’t an answer until this afternoon. \n\nI had to leave for work this morning so when I came back she had calmed down a bit and was ready to tell me. Her answer was probably the last thing I was expecting. She cried while saying this but said a few years back when I went on a business trip, she slept with my father who she “ran into on a drunk night” I don’t believe it. My father passed away in December from a colon cancer when he was 45. He did meet my daughter, half sister, his daughter idk.. but never said anything clearly. She said they both decided it was a dumb mistake (a major understatement) and it’d be best to erase it and play me as being the father. Me and my father never had the best relationship I grew up with my single mom but he was present in my life and when he passed it hurt my family a  lot. So hearing this broke me. I am currently staying with my brother. I haven’t spoken about what I’ve learned with anyone even him. I don’t think I’ve fully processed so coming here to write this felt like a good place to get my thoughts out. \n\nI didn’t say anything after she told me that and just left after she finished explaining. I don’t know where I even go from here. I don’t want to abandon my child while she’s technically my half sister but do need time to process this. I don’t think any amount of marriage therapy will fix this so divorce is my next step. I am going to seek a therapist for myself and help myself so I can be there for my daughter.",
            "Q_score": 184,
            "Id": "11t7w2x",
            "Url": "https://www.reddit.com/r/Advice/comments/11t7w2x/im_having_doubts_on_if_my_daughter_is/",
            "Aswer": "Okay, my advice? Take 3 steps back!\n\nI understand your doubts, the might be valid but when focusing on just eye color you have about a 25% change of that happening (a lot of other factors come in but it's a ballpark) that's the same as flipping heads twice in a row... Happens all the time!\n\nFirst: Before you do anything decide what you would do if the child isn't yours. Are you actually leaving? Or would you stay regardless?\n\nThere was a story on Reddit lately from a MIL that did the testing for the couple and it broke the guys heart because it was a SA baby and he really didn't want to know so he could keep pretending it was his. \n\nIf you stay regardless I can imagine it being worse if you would know she isn't yours. \n\nLeaving would be a valid choice, let's get that clear. However you need to decide before you do the test what the results will mean for you, because knowing may hurt you more than not knowing.\n\nSecond: get couples counseling, recently heard a story where after a good talk through a therapist both partners were on the same page (and got the test). Where your feelings are valid so are your wife's feelings. And finding a middle ground while both coming from a place of hurt is (almost) impossible. \n\nThird: if you really can't live without knowing and you can't find middle ground on this test, your relationship is already over. You will either resent yourself for not pushing, your partner for not agreeing or she will resent you for doing it anyway. Resentment is a top indicator (iirc even the number 1 indicator) for a failing relationship. Realize NOW if you really need that resentment in your life (in whatever shape) and act accordingly. \n\nBut, if you are ending the relationship anyway, might as well get the test through a court before paying child support.",
            "A_score": 231
        },
        {
            "Question": "Food randomly disappearing from my house, need advice.\nI've been experiencing a strange problem lately and I'm hoping to get some advice on how to deal with it. For the past few weeks, I've noticed that food in my house has been disappearing without any explanation. At first, I thought I was just forgetful and had eaten it myself, but I've started keeping track and now I'm sure that something else is going on.\n\nThe food that's been disappearing is usually things like snacks, fruits, and other small items that can be easily grabbed and eaten. It's never anything substantial like a full meal, but it's enough to be noticeable. I live alone, so it's not like anyone else is eating it without my knowledge and there aren't any extra wrappers or peels in any of my trash cans or bags.\n\nI've checked my apartment for any signs of a break-in, but everything seems to be in order. I've also considering asking my neighbours if they've noticed anything suspicious, but I haven't yet\n\nI'm starting to feel paranoid and I'm not sure what to do. Has anyone else experienced something like this?\n\nQuick Edits: Don't want to divulge much information about myself, but I'm 20, I'm Brazilian, the apartment is owned by parents while I study in my university and they will sell it back once I'm done. Nobody has any keys and my parents added a tetra key lock (I believe that's the name) when they bought the place.\n\n\n Currently taking the following advice:\n*Taking pictures of the kitchen and other areas to compare while I'm away from home.\n*I'm going to talk to the janitor today, hopefully she'll be of help.\n*Slept with my leg tied up to the bed frame and I believe that's enough proof that I'm not sleepwalking, but I can't be sure.\n*Windows are now closed. Just leaving my bedroom's window open so I can get some air and I can keep an eye on it constantly.",
            "Q_score": 143,
            "Id": "11t80xw",
            "Url": "https://www.reddit.com/r/Advice/comments/11t80xw/food_randomly_disappearing_from_my_house_need/",
            "Aswer": "If items in the fridge or other locked areas are disappearing then I think it's you (sleepwalking etc). Regardless get a motion camera.\n\nIf it's things left out it could be rats/mice, get a camera and/or traps.",
            "A_score": 154
        },
        {
            "Question": "How do I tell my coworker to stop bothering me every single time I'm on my break trying to eat?\nTitle. I have extreme anxiety being seen eating and I always pick a time slot for my break that nobody else claims. Everyone respects this and leaves me alone in the break room except for one coworker who, nearly every time without fail, comes in when I am approximately 2-3 minutes into my meal and lingers talking about random things. I immediately lose my ability to eat the moment he walks in and by the time he leaves my break is over and I have to return to work starving. I am starting to get really upset by this but I have no idea how to bring it up or ask for his understanding and cooperation without coming across as a weird mentally fragile idiot. I thought he would eventually notice I stop eating whenever he visits and get the hint but he hasn't. I feel so stupid about this but it's really starting to effect me. I don't want to hurt his feelings but I need to be able to eat to get through the day. What do I say? How do I approach? Should I just start eating lunch in my car?",
            "Q_score": 261,
            "Id": "11suawi",
            "Url": "https://www.reddit.com/r/Advice/comments/11suawi/how_do_i_tell_my_coworker_to_stop_bothering_me/",
            "Aswer": "I think you’d have the right to say “hey man, I only have a few minutes for my break and I prefer to enjoy it it silence so I can recharge. I’ll talk to you after!”\n\nBut I don’t think you have the right to boot someone out of what I assume is a *shared* break room. Everyone’s got a right to be in there, if they work there. If you need total solitude, I would find somewhere else to eat.\n\nI’d also recommend seeking professional help to move through this anxiety.",
            "A_score": 350
        },
        {
            "Question": "Are we in danger?\nMy girlfriend's alcoholic, incel, antisemitic brother who owns a gun has threatened to kill her the next time she goes to Miami. Should there be a concern? She needs to go to Miami for her business and needs to talk to her parents, who her brother lives with. What should we do?",
            "Q_score": 54,
            "Id": "11t23cr",
            "Url": "https://www.reddit.com/r/Advice/comments/11t23cr/are_we_in_danger/",
            "Aswer": "Yes. Contact her parents and contact the police. And stay as far away from him as you can.\n\nYou and your gf can probably better evaluate how likely he is to follow up on his threats.",
            "A_score": 118
        },
        {
            "Question": "ASKING ADVICE: I want to play a metal song at my wedding\nMy Dad took his life before he could see me marry anyone. My Dad's last favorite song was a metal song, and it has some screaming in it, but not the whole song. And I would like to add that the \"screaming\" isn't \"messy\"- you can understand what the words are, but it's still screaming (Skyline, by Erra).\n\nI wanted to do a tribute to my dad by playing this song, but I'm having my wedding in a church, so I am conflicted about it. Not only that reason, but also because it's going to be a small wedding, and most attendees are older women who are very vocal about not liking that type of music.\n\nShould I play the song for my Dad, or should I choose another song for him? My runner up would be \"Brighter Side of Grey\", by FFDP- (still \"hard rock\", but softer, no screaming, and I love the message)\n\n&#x200B;\n\nEditing to include- I am 22F, American, and my family is Christian (Don't worry- I'm not the type that forces it on people lol, but some of the women are the more strict/old testament types..)- the bot said I should include this info",
            "Q_score": 31,
            "Id": "11t4c75",
            "Url": "https://www.reddit.com/r/Advice/comments/11t4c75/asking_advice_i_want_to_play_a_metal_song_at_my/",
            "Aswer": "https://www.youtube.com/watch?v=nksQDNR8AjE\n\nJust as an idea - if you think the screaming is too much - you can do an instrumental version.\n\nOr you can find a \"softer\" part of the song that has meaning and find someone who can work that portion with words into a portion with the instrumental. \n\nI think what you want to do is a beautiful idea and I think you should go with the song that honors your dad, honors a moment you didn't get to have with him ... it's your wedding, it's your tribute, he's your dad ... \n\nYou use his song!\n\nETA: Even with the screaming - the little old ladies can hang onto their pearls for a few minutes so you can have a lifetime memory.",
            "A_score": 46
        },
        {
            "Question": "Wife wants to circumcise son, but I don't want to.\nHello, I need advice on this situation, my wife is pregnant and is due in 1 week, ever since the news that it was a boy she has been adamant about circumcising the baby, the thing is I do not want my son to not have a choice of whether he wants to be cut or not, when he is at the age of consent I will allow him to make the decision, but not now. I tried showing her information about how harmful the procedure is but she won't agree or even listen to the information because she just won't believe it, I tried to talk but she refuses to talk about it because \"pregnancy mood swings.\"",
            "Q_score": 513,
            "Id": "11sj47l",
            "Url": "https://www.reddit.com/r/Advice/comments/11sj47l/wife_wants_to_circumcise_son_but_i_dont_want_to/",
            "Aswer": "If it’s a matter of “hygiene,” that shit has been debunked. It’s not difficult to clean underneath the foreskin at all.",
            "A_score": 892
        },
        {
            "Question": "I can't be bothered to make food, but I don't feel hungry quick enough, so I go full days without eating.\nAnd then I get even more depressed/sad/suicidal. Every time I forget that it's just that I need to eat, because I live in a haze of emptyness every day, because I don't eat.\n\nI really want to break this cycle, but I don't know how. Does anybody know some tricks that might help me get better at this?",
            "Q_score": 34,
            "Id": "11svs1x",
            "Url": "https://www.reddit.com/r/Advice/comments/11svs1x/i_cant_be_bothered_to_make_food_but_i_dont_feel/",
            "Aswer": "From my experience, not eating makes the anxiety/depression/suicide worse. And it's hard to find the energy to actually cook. Especially with my chronic pain. \n\nWhen I lived on my own, I took advantage of The Tray. The Tray is a tray of ready to eat foods that take no time to prepare. Buy a large flat surface you can carry food on. Put food on it. Carrot sticks, cheese sticks, crackers, lunchables, literally whatever you want. So long as it takes next to no preparation. Keep it in the fridge, fully loaded. Vaguely hungry? Pull it out, eat some, put it back. Is it out? Refill it. Maybe you go to the store or maybe you order grocery pickup or delivery. The Tray works for all.",
            "A_score": 22
        }
    ]
}