{
    "Posts": [
        {
            "Question": "My boyfriend said he’s not paying rent while he’s deployed…\nSo I just recently found out that my boyfriend will be getting deployed in a few months. He’s supposed to be leaving this month for pre deployment training and told me to pay his half for him and gave me his card info. So I guess being naive I said “will I be doing the same thing while your deployed?” To which his reply was “No, why would it be fair for me to pay rent for a place I’m not going to be living in for up to 6-9 months.” It caught me way off guard because I moved all the way to OK from NH because he told me he wanted us to live together, that’s 22 hours away. I have no family or friends down here and I even had to pay and drive a Penske truck just to get here… what am I supposed to do? I don’t want to be here all alone and I definitely don’t want to be financially responsible for an apartment that has the rent continuously increasing almost every month. My best friend and family keep telling me that I should leave him because the way he already treats me and then when I told them about this they lost their minds… Is there any other people that are dating a service member and have they left you solely responsible for rent while they where away?",
            "Q_score": 466,
            "Id": "11qqy9s",
            "Url": "https://www.reddit.com/r/Advice/comments/11qqy9s/my_boyfriend_said_hes_not_paying_rent_while_hes/",
            "Aswer": "Ya, that’s bullshit and he’s scamming you. If you both signed the lease to the place, you’re both responsible for your half of the rent. It doesn’t matter how often either of you are there. The man signed a contract and he’s obligated to hold himself to that contract. \n\nBased on the rest of your post, it sounds like the most straightforward solution would be to not pay your half of the rent because you left the douchebag.",
            "A_score": 826
        },
        {
            "Question": "Is it normal to love your family but want to move far away and have nothing to do with them?\nI (23M) live with 2 parents and a younger brother. My parents are really great people and I love them to death. I would do almost anything for them if I they ever needed help, hope to financially support them if able and wish them the best in life. Same applies to my younger brother. However, I absolutely hate living together and being within touching distance where I have to interact and talk to them, or even see them for that matter. I would like to move as far away from them as possible and cut off frequent contact. I would not mind talking to them every once in a while to check up (once a month, let’s say). And going to see them for a couple of days a year. I want to live a life completely separate from them in which they are not involved. Am I lying to myself by saying that I love them ? Can both of my feelings coexist ? I feel guilty for wanting what I want.\n\nEdit: Thank you for the kind replies everyone! Helps to know I’m not actually a dick haha. I definitely agree with it being an autonomy thing. However, they come from a culture that is very interdependent family wise. That is probably why I felt like it’s such a ‘bad’ thing to not want the same.",
            "Q_score": 139,
            "Id": "11qpnsl",
            "Url": "https://www.reddit.com/r/Advice/comments/11qpnsl/is_it_normal_to_love_your_family_but_want_to_move/",
            "Aswer": "We all need to learn to set and maintain healthy boundaries with family. Watch youtubes to learn how. \n\nThe relationship you're describing is referred to as \"Low Contact\". \n\nWhen a person goes low contact with family, it's important to work on creating a FRAMILY (friends you choose who eventually become closer and more supportive than family), so you have support and connection in your life.",
            "A_score": 56
        },
        {
            "Question": "My sons girlfriend has some issues. Help!\nMy son (20) has been with his girlfriend (20) for about 5 months and she's just moved in with us as she doesn't get along with her parents but she comes with issues that I'm not used to or know how to deal with.\n\nShe's not working so my son and I are supporting her. I've been trying to help her find work but she's not making an effort.\n\nWhen it was me and my son, I'd put food in the fridge (cooked meats, salads, bread, sandwich wraps etc) and he'd take care of himself but his girlfriend always asks for cooked meals for lunch and dinner and to make it worse, she won't eat left overs or the same thing twice in one day. Won't even eat them the next day.\n\nWhen I do cook meals, she loads her plate up so full that she can't eat it all. Ends up in the fridge but as I said, she won't eat left overs so it gets thrown out.\n\nIn the mornings when I first wake up, I like to sit in peace and have my coffee, watch the morning news etc but she right there non stop talking and doesn't seem to take a breath.\n\nShe's not a bad person. She's actually a lovely girl who clearly hasn't had the best upbringing. If we could get these small issues sorted, I feel we'd have a much better relationship.\n\nHow do I help her understand that these things are not ok without hurting her?",
            "Q_score": 573,
            "Id": "11qb3of",
            "Url": "https://www.reddit.com/r/Advice/comments/11qb3of/my_sons_girlfriend_has_some_issues_help/",
            "Aswer": "Maybe you can offer to teach her to cook? It would be a good way to bring up that you’d like her to do it herself and if she’s missing the skills you can help her develop them. If you have time of course",
            "A_score": 587
        },
        {
            "Question": "What is a good excuse to leave a vacation with friends and go home. I don’t want to say I have family in the hospital.\nThank you for each and everyone of you that responded. It is hard for me to tell the truth but it seems like that’s what I need to do. I do apologize if it sounds like I’m picking a part everyone’s answer,it’s just a really stressful situation and I don’t want to hurt anyones feelings. I’m either going to say that I’m sick or just tell the truth. Or maybe a combination of both. I just can’t wait to be home with my family.",
            "Q_score": 133,
            "Id": "11ql1m9",
            "Url": "https://www.reddit.com/r/Advice/comments/11ql1m9/what_is_a_good_excuse_to_leave_a_vacation_with/",
            "Aswer": "“I’d stay, but I don’t want to” and leave.",
            "A_score": 239
        },
        {
            "Question": "Do I tell my friend she dresses inappropriately for her age and size?\nI want to start this post by saying I’m not passing judgment on my friend, but I would want to know personally if my attire was considered inappropriate for my body or for the venue or audience. \n\nMy husband and I belong to a social organization for couples. A few months ago we recommended two married friends of ours who I will call Mark and Lisa for membership. We invited them for a meet and greet with other members one evening at an upscale lounge. \n\nLisa likes to dress very sexy and youthful. She is 60 years old, on the heavier side, and has very large breast implants that she can never seem to keep inside her clothes. She showed up to the evening wearing platform flip flops and a semi-see-through beach romper that left nothing to the imagination. When the evening was over, several members shared their feedback and gave her a hard “no” for membership. Some cited a “personality conflict” but others stated that they found her appearance and dress to be “trashy” and “inappropriate” and “contradictory to the public persona our group is trying to establish.”  Needless to say they did not become members. \n\nI love my friend. She is kind, funny, hardworking, and would give you the shirt off her back (no pun intended). I don’t judge her for her clothing choices but I do feel uncomfortable sometimes when we hang out, husbands in tow, and she has yet another (entirely preventable) wardrobe malfunction. Do I tell her how wildly inappropriate this is?  Or do I bite my tongue and accept her and her fashion choices?  Thanks.",
            "Q_score": 61,
            "Id": "11qlqcz",
            "Url": "https://www.reddit.com/r/Advice/comments/11qlqcz/do_i_tell_my_friend_she_dresses_inappropriately/",
            "Aswer": "Nah, don’t tell her. Let her be happy, she’s freaking sixty and living her life, she don’t need that club anyways.",
            "A_score": 282
        },
        {
            "Question": "My boyfriend of 7 is overweight lazy and eats junk food l.He is constantly gambling on his phone and is never intimate with me when i initiate it. He only wants to be intimate in the middle of the night when im asleep. what should I do?\n",
            "Q_score": 233,
            "Id": "11q8xl6",
            "Url": "https://www.reddit.com/r/Advice/comments/11q8xl6/my_boyfriend_of_7_is_overweight_lazy_and_eats/",
            "Aswer": "Well 7 year olds tend to have these tendencies. What did you expect when you starting dating him?",
            "A_score": 756
        },
        {
            "Question": "A boy asked me (16F) out. What do I do?\nI feel like such a stereotypical teenage girl writing this, God. Long story short, a boy I know texted an offer to go on a date. He is an interesting guy - we haven’t talked that much but he’s fun to talk to. However, I’m pretty sure I don’t feel anything towards him romantically rn. I really hate to be a girl who friendzones, I do, but I think that’s what must be done, especially since I think I might be gay for unrelated reasons.\n\nHowever, you only live once, and maybe I will end up liking him, or at least, I will have gotten out of my shell for once. But I don’t want to be selfish and end up hurting his feelings.\n\nWhat do I do???",
            "Q_score": 56,
            "Id": "11qj9wb",
            "Url": "https://www.reddit.com/r/Advice/comments/11qj9wb/a_boy_asked_me_16f_out_what_do_i_do/",
            "Aswer": "Just go and have fun. It’s not a marriage proposal.",
            "A_score": 179
        },
        {
            "Question": "How do I get rid of 20 lighters?\nPlease don’t ask why I have 20 lighters. I need to get rid of these immediately.\n\nEdit: I’m 15",
            "Q_score": 27,
            "Id": "11qo2vm",
            "Url": "https://www.reddit.com/r/Advice/comments/11qo2vm/how_do_i_get_rid_of_20_lighters/",
            "Aswer": "Walk up to the first person smoking you see and say \"do you want these lighters\"?\n\nUnless they're dead. In that case just throw them away.",
            "A_score": 70
        },
        {
            "Question": "I feel like I missed my chance and now I’m to old for everything\nTo expand more on the title, I don’t know what to do anymore. I feel to old to do most things but to young for others. I feel like I’m stuck in the middle with no idea how to move forward. To be honest I never thought I would live this long so I never bothered to think of my future. I work two jobs and I don’t like either I just do them for money. I have a few hobbies but mostly I feel like I’m just daydreaming through life with no idea what to do next. I have things that in the last few years I have wanted to do but i feel like I’m past the age I can do them. It feels like I missed out building these kinds of thing when I was younger (not to sound even older than I am) but seeing young kids know what they want to do and work towards them or even do things I could never achieve. I feel like leftovers. I’m turning 30 this year, never been in a relationship, never really accomplished much personally or in my jobs. So does anyone know how to find motivation later in life? how to find joy in things again? how to have a new goal or dream? \n\nany words of advice would help.",
            "Q_score": 42,
            "Id": "11qfsld",
            "Url": "https://www.reddit.com/r/Advice/comments/11qfsld/i_feel_like_i_missed_my_chance_and_now_im_to_old/",
            "Aswer": "There’s no time like the present to start something new.  I’m 36 and have recently decided to finish my bachelor’s degree.  Yes, I wish I’d done it sooner, but I’m a procrastinator by nature and put it off long enough!  30 is still young anyway!  Find what you love and try it!  Put yourself out there if you really want to find a partner, lots of people use dating apps I hear nowadays.  \n\nDo whatever you want to do now because when you’re 36 37 38 you’ll have regrets, trust me.",
            "A_score": 19
        },
        {
            "Question": "My gf is being tracked.\nSo I’ll keep it brief. My gf has been getting notifications that an AirTag is following her car. We recently moved, and it travels with her everywhere she goes in her car. \n\nWe searched what we could. But where are some good places to look? It’s a 2016 Mazda 3 if that helps. \n\nYes, we’ve got in touch with the police. They said they can’t do much until we actually find a tracker. \n\nShe’s going to try to have a shop look for it asap.  Thanks for any and all help.",
            "Q_score": 447,
            "Id": "11pxwd8",
            "Url": "https://www.reddit.com/r/Advice/comments/11pxwd8/my_gf_is_being_tracked/",
            "Aswer": "My nasty fuckin ex gf put a android smart tag in my kid's backpack and I found it really easy but mostly because she previously was trying to record my conversations with a recording spy pen.There's an app called BLE Scanner. Download it and take it outside maybe 75 feet from her car and refresh the app. Take note of all devices that it picks up. Then got next to the car and refresh the app, if there is a tracker in or on the car you'll notice a new device appearing in the app. Look at the distance which is in meters, then walk around to different sides of the car, and look at the distance. The lower the distance means the closer you are to the Air Tag. The app should display Air Tag so it should be really easy to find in the app when looking at it. I'd also recommend maybe doing this search with her car at least 75 feet from all other cars and bluetooth device that are on phones and cars. It should be super easy to find. Good luck and keep us posted on the progress. Here's a [link for the app](https://apps.apple.com/us/app/ble-scanner-4-0/id1221763603).",
            "A_score": 569
        },
        {
            "Question": "My ftm trans friend is becoming misogynistic to me. Female.\nOkay so I have a friend and we’ve been friends for awhile. He has transitioned into a man and I fully support. However, I’ve noticed he’s started to become misogynistic. Sometimes he will make a kitchen joke or say “woman moment” and I’m just so confused on what to do? I feel like obviously he craves validation from cis men and is mirroring his cis male friends behavior so he can “fit in”. But I feel like it’s ruining our friendship. Any advice?",
            "Q_score": 698,
            "Id": "11ppaqn",
            "Url": "https://www.reddit.com/r/Advice/comments/11ppaqn/my_ftm_trans_friend_is_becoming_misogynistic_to/",
            "Aswer": "I'd call him on it like you would anyone else saying those things, \"Hey, not funny. No really, disrespectful and not cool.\"",
            "A_score": 1124
        },
        {
            "Question": "I met up with my son after four years of no contact.\n \n\nOriginal Post: [https://www.reddit.com/r/relationship\\_advice/duplicates/11lcng9/my\\_son22m\\_cut\\_contact\\_with\\_me\\_43f\\_four\\_years\\_ago/](https://www.reddit.com/r/relationship_advice/duplicates/11lcng9/my_son22m_cut_contact_with_me_43f_four_years_ago/)\n\nFor the few that gave me actual advice, I went to meet up with my son without Max or my daughter. It was at a local coffee shop. I found him sitting in one of the booths at the coffee shop. He was on his phone. I was really scared. A part of me wanted to tackle him with a hug and beg for his forgiveness. Another part of me, wanted to leave before he noticed me. I said his name to get his attention. He didn't even leave his seat; he just looked at me and said hi. I asked if I could sit. I started asking about how is he doing. He said he was fine. I was about to apologize, but he interrupted me by saying, \"Before you apologize, I want to understand how the relationship between Max and you even started.\"\n\nI started telling him everything. When it came to mentioning my meet-ups, he interjected me and started asking me questions that were difficult to answer. He asked \"So all the times that you were going out you were lying to me about where were you going. Weren't you?\" I nodded. \"What about the times I asked to spend time with you? Did you lie to me so you meet up with Max instead?\" I started tearing up. It was hard being there. \"Did you miss out on events to be with Max? What about my birthday?\" That's when I started crying. He told me to save my tears. He said he figured that out soon after he learned about the relationship with Max. He just wanted to hear it from me. He then asked me if I was still with Max. I told him I was married to him and I have a daughter with him. He seemed to need a minute to process that.\n\nThen he started speaking. He told me he never had an issue with me dating or meeting someone. In fact, he hoped I found love. He understands that I needed companionship and a type of love he couldn't offer as my son. He told me throughout all these years he felt conflicted because both Max and I were both consenting adults and adults have a right to find happiness. My son admitted he shouldn't Max and was glad he didn't press charges. He said despite all of that, they were some things that he can't get over. He told me he can't get over the fact that I didn't take him into consideration when it came to pursuing the relationship. It was also hurtful to realize that I would value a romantic relationship to the point of being willing to throw away a close relationship with him for it. If I had the attitude of being done raising him and finally pursuing my own life, then that's valid, according to him. However, I would have no right to want to have a close relationship with him in return. Again, that's what he said he believes. He told me he wouldn't have forgotten me when he left for college. He would have wanted me to move close to him after he got a job if he couldn't move close to me. In this ideal world we would live close by so he we could still see each other even after he had a family.\n\nHe said he loves himself and his life too much to have back in my life.. My son said he works as a mechanical engineer now. He is engaged to the love of his life. She was also raised by a single mom like him until she was 16 when her stepdad into the picture. Both of them have welcomed him into the family. He told me his future in-laws and his fiance are his family now. He said he was getting a job near them.\n\nHe finally admitted that he just wanted closure before permanently cutting me off. He told me not to contact him or his family at all. He made it clear he wouldn't be there for me at my last stage of life or even come to my funeral. He made it clear he won't even hold my hand when I pass away. I won't have the privilege of knowing his fiance or his future kids. He made it clear that if his half-sister ever contacts him as an adult he'll be upfront on why he doesn't want a relationship with her. He said good bye to me and left. I cried so hard that I got the attention of the people in the coffee shop. I was crying on the way back home. I don't even know how therapy can even help. I never felt so much emotional pain in my life before. What do I do now?",
            "Q_score": 877,
            "Id": "11pfgyz",
            "Url": "https://www.reddit.com/r/Advice/comments/11pfgyz/i_met_up_with_my_son_after_four_years_of_no/",
            "Aswer": "Now, you respect him and move on with your life.",
            "A_score": 1133
        },
        {
            "Question": "Should I feel bad for not wanting to help my parents past age 25?\nMy parents recently told me that they cannot afford certain things and they need help, I live with them and I’m 20 so I help out with bills every so often, I’m the youngest I have an older sister and an older brother who both drained them of money for college, trips, etc. my brother has nothing to do with my parents because they drove him away and my sister works on and off but they don’t expect her to contribute, she also dropped out of college that they were paying for. \n\nI recently started my own business and work full time so I can eventually go to school or fund my business for more return. They know I have a lot of money saved for my future and told me I will have to start helping out because my sister refuses to work full time and make money, they also don’t expect her to pay bills or rent. \n\nThey ended up telling me that i have to pay them money for retirement because they had expectations that the child with the most money will take care of them, I barely started my life and it seems unfair for the youngest child to have to take care of my parents who are mid 60s when I am just learning my way around my personal life and business. I feel a huge burden on my shoulders because they made bad financial decisions and they are expecting money from me to fund their vacations , groceries for everyone , bills , cooking, cleaning etc. im starting to think of moving out but I feel bad because they did give birth to me and take care of me when I was a kid. \n\nI think they should ask my sister (22 f) to help or my brother (30 m), I can’t take on their financial burden as I have to think about my future, I want a family of my own and children.\n\nWhat do I tell them? Do I stand my ground? Do I owe them money for taking care of me? They also let me use one of their cars to go to work, should I buy them a new car?\n\nEdit: these are the type of financial decisions my parents make;\nMy mother spent $500 on designer glasses but she can’t pay for groceries so I have to pick up the slack.\nMy father retired early with no investments just a pension that can barely cover the mortgage and electric bill, he payed for my sisters college and struggles with those bills too.",
            "Q_score": 63,
            "Id": "11pyt67",
            "Url": "https://www.reddit.com/r/Advice/comments/11pyt67/should_i_feel_bad_for_not_wanting_to_help_my/",
            "Aswer": "You never owe your parents anything. You never asked to be born.\n\nStand your ground and let them rely on your other siblings, or like actual adults, they can figure it out.",
            "A_score": 121
        },
        {
            "Question": "In a really bad mood..... What can I do to calm down??\n*Title*",
            "Q_score": 146,
            "Id": "11provd",
            "Url": "https://www.reddit.com/r/Advice/comments/11provd/in_a_really_bad_mood_what_can_i_do_to_calm_down/",
            "Aswer": "I have a punching bag in the garage for my bad moods. Go do something physical. Try running or just smash some empty cans",
            "A_score": 104
        },
        {
            "Question": "should I(f32) sue hairdresser for not refunding $140\nLong story short, I went into a salon to dye my hair. They said, \"we can dye it that color, no problem, no bleach will be used.\" After dyeing it, my hair came out two very different colors. Then they apply something in my hair. I ask what it is and, it's bleach. I express how much I didn't want that and that and how dare they just put it on my hair without telling me even after it was agreed that bleach wouldnt be used etc. They're like, \"oh you'll be fine\" and then proceeded to dye my hair a second time after the bleach. I look like a clown now with different colors on my hair (orange at the root and brownish red at the body). But the worst of it all is that I have bleach in my hair and I'm upset that my hair will never be the same. I will have to keep cutting it until the damaged bleached hair is gone. I have curly hair so my curls will most likely not be the same also. \n\nI wanted a refund for this experience. These stylist did whatever they wanted to me. Bleached my hair and dyed it twice in 1 day. Instead the stylist and the owner start yelling at me telling me they can't refund me and that I'm wasting their time and that the most they could do for me is give me some type of moisturizing treatment the next time I come in. (They are so clueless) I explain that I'm never coming back and leave with damaged hair, orange roots, and redish/brown hair, a lousy blowout, an uneven trim, and the delight of being shouted at by two extremely unprofessional ladies. Not to mention I paid $140 for this nightmare.\n\nI spoke to friends they're all in shock of such an experience and they warn me that in a couple of months, my hair might fall out bc of the bleach 😢 . I am considering suing this business. What are your thoughts?",
            "Q_score": 25,
            "Id": "11pzspj",
            "Url": "https://www.reddit.com/r/Advice/comments/11pzspj/should_if32_sue_hairdresser_for_not_refunding_140/",
            "Aswer": "I would definitely start by leaving a one star review with picture evidence. \n\nAre you able to do a charge back on your card?",
            "A_score": 73
        },
        {
            "Question": "Cousin who molested me as a child, just assaulted his sister. She doesn’t want to call the police. Is there anything I could do?\nHe never got any repercussions for molesting me multiple times when I was 6-10 years old, and now he just physically assaulted his sister. They both live a block  away from me. I have a recording of him admitting it on the phone. She doesn’t want to call the police. He’s not remorseful. It’s triggering me really bad that once again he’s not going to be punished. Is there anything I can do, or do I have to just take the L on this one and sit with my anger? Their mom witnessed it, but she doesn’t want him to go to jail. I want him gone from our lives. He’s a disgusting piece of trash person.\nEdit: people are assuming his sister is a child. He is 29, his sister is 31.\n\nEdit again: they were arguing and he grabbed her hair or ear and threw her on the floor. Then he ran to his room and locked the door. I believe he’s still locked in his room and everyone is comforting his sister and their mom, who has a heart condition, and is hysterical since she witnessed it",
            "Q_score": 35,
            "Id": "11pudyx",
            "Url": "https://www.reddit.com/r/Advice/comments/11pudyx/cousin_who_molested_me_as_a_child_just_assaulted/",
            "Aswer": "You can still call the police and made a police report",
            "A_score": 41
        },
        {
            "Question": "My(F19) own siblings(M17 M22) show signs of wanting to sexually assault me\nThis is not my main account for privacy reasons.  \nWe were at the house and my older brother told me to take the trash out, I was angry because of his tone and how he always sounds like he is bossing me around, so I told him he can take it out himslef. He proceded to yell at me and calling me names, my younger brother was also there and they started talking about how I am a b\\*\\*\\*\\* and they also made fun of the way I look and the fact that my ex was ugly and bla bla.   \nI didn't really care about all of this because it's not uncommon in our house (probably the only person who loves me in our house is my mom). but what was really disturbing is that they joked about how they would want to gang bang me so I can 'shut up'. this was absolutely disgusting and creepy  \nI am not making a big deal of this because like 3 months ago I found semen on one of my panties and and don't know which one did that but they both are really trash human beings and can definitely do this.  \nI don't know if I should finally tell my mom about this or if it is even a good idea to tell her. and I don't have anywhere to go.",
            "Q_score": 245,
            "Id": "11pdlkz",
            "Url": "https://www.reddit.com/r/Advice/comments/11pdlkz/myf19_own_siblingsm17_m22_show_signs_of_wanting/",
            "Aswer": "You should definitely tell your mom about what’s going on if you suspect that they will harm you. Brothers should not be saying things like that. Be safe please.",
            "A_score": 445
        },
        {
            "Question": "My sister (F56) is angry with me (F51) for buying my nephew (M18) Plan B, and I've been getting harassed and accused of being inappropriate for it.\nI (F51) live with my husband Brian (M55) only around half an hour away from my sister Lisa (F56), BIL Harold (M55), and nephew Robby (M18). Robby's in his senior year of high school and he's honestly always been a good kid. I love that little brat.\n\nHowever, a few nights ago, I was in the middle of watching cobra kai while Brian was at work. I get a frantic call from Robby. I'll spare the details but he said that he had no money and was in emergency need of Plan B for his girlfriend (F18). He begged me not to tell his parents, and I agreed to it. It's worth noting that he doesn't have a car just yet, and apparently neither does his girlfriend. The kid was freaking out and screaming on the phone, so I took some time to calm him down and reassure him that his future was not ruined and everything was going to be okay.\n\nI went to the nearby CVS and even bought two Plan Bs in case this happens again in the future, and drove down to Robby. My sister and BIL were out for the night, and Robby couldn't thank me enough. I told him not to mention it and also advised him to stay careful in the future. Robby begged me to keep this between us, and I agreed to spare him embarrassment. Unfortunately, I got an angry call from Lisa the next morning, and she had found the other Plan B in Robby's bathroom drawer while she was cleaning the bathroom. She said it was out of line for me to go and do that behind her back, and that I should've told her and Harold. I said that Brian was freaking out and I didn't want to embarrass him or make him feel bad, but Lisa said I was an AH for interfering with her parenting, and that me \"advising him to stay careful in the future\" was an inappropriate thing to say to my own nephew. It's literally gotten to a point where Harold and even a couple of Lisa's friends have been messaging me. I haven't even told Brian about this to keep Robby's word. I wasn't judging him at all, I really was just trying to help.\n\nSince then, I've still been getting messages from Lisa, Harold, and their friends. I haven't responded to a single one, and I even posted to AITA about this before it got taken down. I got a lot of advice on giving Robby the talk, but I'm extremely worried about how inappropriate that's just going to look. But at the same time, I fear that Robby might be uneducated on this stuff, as Lisa and Harold have honestly always been weird about this. Where do I go from here?",
            "Q_score": 44,
            "Id": "11pr42c",
            "Url": "https://www.reddit.com/r/Advice/comments/11pr42c/my_sister_f56_is_angry_with_me_f51_for_buying_my/",
            "Aswer": "Your sister sounds irrational and over the top. I would simply not respond to anything your sister says or does, and not see her until she can apologize. Her son is an adult, and you just saved him from a ruined future.\n\nInstead, I would check in on the adult nephew and see how he's doing and if it all worked out. \n\nIn a few years after this, you will have a nephew who will be on his own and will probably VERY grateful for you, and views you as more trustworthy than his mother. And a sister who either realized you saved her son from having a kid too early, a sister who can forgive and forget, or a sister who shouldn't be in your life.",
            "A_score": 55
        },
        {
            "Question": "Should I not get a silicone \"stand in\" ring to wear in place of my wedding band in active and/or dangerous situations?\nTL;DR I'm ordering a silicone band to wear when I'm exercising and visiting places where theft might be an issue. My fiance thinks this is weird and keeps asking me why I won't just wear my wedding ring all the time. Should I not be getting this \"stand in\" ring?\n\nI'm a 40 something guy getting married for the first time. I'm pretty active, including cycling a lot. I also sometimes go to less than safe places where theft can be an issue. I also cook and often have my hands in foods that may be acidic etc. Finally, I lose things all the time! So I'm ordering a silicone band to wear when I'm not comfortable wearing my wedding ring. Mainly in the situations I just listed.\n\nMy fiance seems to think this is weird. Every time I bring it up he asks me why I wouldn't just wear my ring. I've explained all of the above.\n\nAm I missing something here? Maybe I'm not being empathetic. Any advice as to how I should look at this?",
            "Q_score": 97,
            "Id": "11ph7ff",
            "Url": "https://www.reddit.com/r/Advice/comments/11ph7ff/should_i_not_get_a_silicone_stand_in_ring_to_wear/",
            "Aswer": "This is a very common thing to do. I used to work for zales and I was told to recommend also getting a cheaper silicone type band we offered along with their wedding band if they worked jobs where their ring can get caught on anything dangerous like machinery. Better safe than sorry with the precious wedding band :)",
            "A_score": 216
        },
        {
            "Question": "Can’t control my laughter\nI be talking to my mom and I giggling non stop and I stg she said she’s gonna drug test me came in my room at 2am and I was just giggling at her I can’t talk to anybody without giggling ik yous are gonna think this mad dumb but I’m honest I can’t stop laughing non stop is there a medical reason for that or sum anybody got an idea",
            "Q_score": 103,
            "Id": "11peprw",
            "Url": "https://www.reddit.com/r/Advice/comments/11peprw/cant_control_my_laughter/",
            "Aswer": "If it’s genuinely constant it’s either caused by a neurological disorder or brain injury. Go to your doctor.",
            "A_score": 133
        },
        {
            "Question": "I LOVE eating but need to lose weight. How can I change my mindset and strengthen my will?\n",
            "Q_score": 51,
            "Id": "11pi0sd",
            "Url": "https://www.reddit.com/r/Advice/comments/11pi0sd/i_love_eating_but_need_to_lose_weight_how_can_i/",
            "Aswer": "Eat large volumes of low calorie foods before eating anything else. It limits the damage of high calorie, low volume foods.\n\nNobody ever put on unwanted fat from eating too much steamed broccoli or too many apples. \n\nSimple changes are change white to brown: brown rice, not white, whole sweet potatoes vs white, whole wheat flour (breads, etc.) vs white, etc. The \" brown\" is about the fiber, which is more filling and less calories than the starches. \n\nDon't drink your calories. Don't eat any cheese you can't taste. If you can't tell the difference, don't add it. If you want alcohol, stop with the added calories and sugary mixes. Buy good booze and drink it straight. If you want the buzz, do it on an empty stomach because it takes a whole lot less. \n\nFollow a simple rule: if it's not in the house,  you can't eat it. This holds true for Twinkies and apples. So fill up the house with what you do want to be eating and never with what you don't.  \n\nTreat calories like money. If you went on a shopping spree and over spent, would you say \"fuck it\" and run up all the credit cards and take out a 2nd mortgage? No you would not! Don't do it with it food either. If you screw up, you screw up. Make a plan to minimize the damage and get back on your better eating plan. \n\nWhenever confronted with a menu, make the best choices possible and then enjoy the meal and the company. \n\nYou didn't gain the weight overnight and you won't lose it overnight. \n\nMake a list of 5 things you can do to soothe yourself for at least 30 minutes before diving into [your favorite downfall food here]. Then decide if you still want it. Remember, it shouldn't be in the house, so that means going and getting it. Give yourself every chance for the feeling to pass so you'll know if it's a temporary thing or an actual craving. \n\nThink about every little thing that can help. If you can find 10 things that give you a 10% improvement,  you'll have a 100% improvement. \n\nBe compassionate with yourself.",
            "A_score": 132
        },
        {
            "Question": "Should a married woman (me) be “allowed” to go out dancing with a group of women without her husband?\nA little background info; We’ve been together since I was 13 and married for 10 years in April. I’m 33 and he’s 34.\n\nMy husband guilted me out of going out saying he wasn’t comfortable with it but not because he doesn’t trust me. I rarely do anything besides work, take care of my children and home and visit family. My best friend invited me out for a night of dancing at a local bar. It was her sister’s birthday and 5 or 6 other women were going. He said a married woman shouldn’t be going out without her husband and at first suggested that he go and just “hang out” in the bar. I told him that I thought that would be weird, him just standing in a corner of the bar watching us. He then sent me several pictures of posts where people had asked if their wives should go out without their husband which of course supported his opinion. He also sent me a very long text explaining that he wasn’t comfortable with it. Saying that he doesn’t trust other people and he thinks it’s just wrong for a married woman to go out to a bar where people go looking to “hook up”. I just wanted to go out with a group of ladies to dance.",
            "Q_score": 826,
            "Id": "11oq8g6",
            "Url": "https://www.reddit.com/r/Advice/comments/11oq8g6/should_a_married_woman_me_be_allowed_to_go_out/",
            "Aswer": "I literally shook my head after reading the title. This really shouldn't really even be a question. Everyone deserves a night out w/ friends.",
            "A_score": 1237
        }
    ]
}